{"id": "NME_69", "url": "https://www.nme.com/news/music/everclear-frontman-art-alexakis-diagnosed-multiple-sclerosis-2467536", "name": ["Everclear", "frontman", "Art", "Alexakis", "reveals", "multiple", "sclerosis", "diagnosis"], "description": ["alexaki", "told", "fan", "state", "health", "lengthi", "lettereverclear", "frontman", "art", "alexaki", "reveal", "diagnos", "multipl", "sclerosisalexaki", "cofound", "longrun", "portland", "band", "1991", "band", "sole", "constant", "member", "he", "plan", "releas", "tour", "debut", "solo", "album", "sun", "song", "summerth", "singersongwrit", "publicli", "announc", "ms", "diagnosi", "letter", "fan", "post", "everclear", "websit", "reveal", "diagnos", "shortli", "involv", "car", "accid", "year", "ago", "believ", "pinch", "nerv", "neck", "result", "crash", "alexaki", "underw", "number", "test", "hospit", "neurologist", "told", "form", "multipl", "sclerosi", "rrm", "10", "20", "yearsth", "word", "multipl", "sclerosi", "conjur", "sort", "imag", "helpless", "wheel", "chair", "pain", "miseri", "worst", "hopeless", "piti", "eye", "famili", "friend", "pictur", "alexaki", "wrote", "rememb", "later", "night", "wife", "vanessa", "hold", "face", "hand", "tell", "got", "shred", "piti", "fear", "eye", "knew", "wasnt", "go", "wife", "lot", "thing", "good", "thing", "isnt", "fake", "common", "dont", "fake", "famili", "wife", "bad", "ass", "remind", "moment", "year", "diagnosi", "ms", "life", "continu", "amaz", "thing", "time", "tour", "tour", "everclear", "addit", "250", "plu", "show", "world", "im", "go", "strong", "spent", "preciou", "time", "famili", "friend", "bought", "hous", "love", "year", "learn", "word", "gratitud", "realli", "meansal", "said", "feel", "diseas", "slowli", "grow", "inject", "time", "week", "neurologist", "say", "long", "stay", "medic", "live", "80", "progress", "shall", "seealexaki", "said", "want", "make", "diagnosi", "public", "hed", "hear", "lot", "peopl", "say", "drink", "drug", "seen", "look", "unsteadi", "stage", "town", "peopl", "say", "sort", "nasti", "thing", "dont", "think", "hear", "themto", "honest", "care", "peopl", "say", "person", "peopl", "care", "ieyou", "think", "said", "want", "know", "truth", "simpl", "thatso", "stumbl", "sweati", "look", "tire", "anxiou", "time", "mayb", "littl", "confus", "usual", "forget", "lyric", "look", "happi", "weird", "know", "fallen", "wagon", "just", "learn", "new", "everclear", "album", "black", "new", "black", "releas", "2015"], "date_published": ["2019-03-27T09:30:13+00:00"], "sentiment": -0.025068181818181812, "content": "Alexakis told fans about the state of his health in a lengthy letterEverclear frontman Art Alexakis has revealed that he has been diagnosed with multiple sclerosis.Alexakis co-founded the long-running Portland band back in 1991, and has been the band’s sole constant member. He’s also planning to release and tour his debut solo album ‘Sun Songs’, which is due out in the summer.The singer/songwriter has now publicly announced his MS diagnosis. In a letter to fans which was posted on Everclear’s website, he revealed that he was first diagnosed shortly after he was involved in a car accident three years ago. Believing that he had a pinched nerve in his neck as a result of the crash, Alexakis underwent a number of tests in hospital before a neurologist “told me that I have a form of Multiple Sclerosis (RRMS), and that I have had it for anywhere between 10 to 20 years”.“The words Multiple Sclerosis conjure up all sorts of images: helplessness, wheel chairs, pain, misery, and worst of all, hopelessness – and pity in the eyes of my family and friends (you get the picture),” Alexakis wrote. “I remember later that night my wife Vanessa holding my face in her hands, and telling me ‘we got this’, with not a shred of pity or fear in her eyes. I knew then that I wasn’t going to go through this alone. My wife is a lot of things – all good, but one thing she isn’t is fake, something we have in common. We don’t do fake in our family. My wife is a bad ass, and she reminded me in that moment, that so am I.”\n“It’s been almost three years since that diagnosis, and MS has become another part of my life,” he continued. “I have done amazing things in that time – touring four full tours with Everclear, in addition to another 250 plus shows all around the world, and I’m still going strong. I have spent precious time with my family and friends; we bought a house that we love last year, and I have learned what the word gratitude really means.“All that said, I can feel the disease slowly growing in me. I now have to give myself injections three times a week. My neurologist says as long as I stay on the medication, I should live into my 80’s without progression. We shall see.”Alexakis also said that he wanted to make his diagnosis public because he’d been hearing “a lot of people say that I am drinking again or back on drugs because they have seen me look unsteady on stage or around town (people say all sorts of nasty things when they don’t think you can hear them)”.“To be honest, I have never cared about what people say about me personally – except, that is, for the people that I care about (ie..YOU) and what they think,” he said. “I wanted you to know the truth, simple as that.“So, if you see me stumbling… sweaty, looking both tired and anxious at the same time, maybe a little more confused than usual, or forgetting lyrics yet looking happy (which is weird for me), please know that I have not fallen off the wagon. I am just learning how to be the new me. “Everclear’s last album, ‘Black Is The New Black’, was released in 2015.", "pptitle": ["everclear", "frontman", "art", "alexaki", "reveal", "multipl", "sclerosi", "diagnosi"]}