{"id": "PF_65", "url": "https://pitchfork.com/reviews/albums/william-basinski-on-time-out-of-time/", "name": ["On", "Time", "Out", "of", "Time"], "description": ["william", "basinski", "oeuvr", "stretch", "1980", "21st", "centuri", "final", "recogn", "exalt", "work", "twin", "tower", "hadnt", "fallen", "basinski", "profound", "music", "eventu", "audienc", "year", "releas", "disintegr", "loopsa", "fragil", "ambient", "set", "record", "crumbl", "magnet", "tape", "shortli", "911", "pair", "haunt", "video", "manhattan", "damag", "skylin", "shot", "brooklyn", "rooftopw", "music", "archivist", "worst", "nightmar", "profound", "medit", "death", "loss", "decay", "earn", "basinski", "longoverdu", "accolad", "he", "memeworthi", "stream", "music", "follow", "basinski", "continu", "strike", "singular", "balanc", "past", "present", "beauti", "nois", "signal", "silenc", "titl", "time", "time", "fit", "virtual", "basinski", "releas", "music", "base", "encount", "past", "present", "record", "sourc", "shortwav", "radio", "old", "lofi", "piano", "loop", "drawn", "tape", "lain", "dormant", "archiv", "decad", "time", "reach", "littl", "bit", "past", "collabor", "artist", "evelina", "domnitch", "dmitri", "gelfand", "work", "aegi", "mit", "caltechoper", "laser", "interferomet", "gravitationalwav", "observatori", "ligo", "basinski", "util", "deepspac", "record", "captur", "ligo", "interferomet", "decad", "decay", "inform", "tape", "disintegr", "loop", "sound", "time", "time", "date", "13", "billion", "year", "ago", "massiv", "black", "hole", "merg", "result", "gravit", "wave", "rippl", "univers", "basinski", "glibli", "present", "piec", "live", "sound", "like", "black", "hole", "fuck", "39minut", "composit", "draw", "deep", "univers", "retain", "telltal", "intimaci", "basinski", "work", "spectral", "drone", "warm", "crackl", "static", "squiggl", "radio", "frequenc", "night", "air", "just", "come", "sky", "basinski", "use", "say", "cull", "method", "hand", "dial", "shortwav", "radio", "use", "space", "record", "align", "basinski", "method", "hark", "childhood", "grow", "houston", "father", "work", "nasa", "earli", "1970", "there", "inher", "warm", "signal", "ligo", "pick", "consid", "separ", "sound", "convey", "chilli", "eeri", "void", "deep", "space", "buzz", "bring", "mind", "inhuman", "thing", "microwav", "quasar", "fluoresc", "light", "offic", "depot", "basinski", "weav", "transmiss", "far", "evoc", "small", "quiver", "high", "frequenc", "reson", "minut", "ad", "brief", "glimps", "warmth", "vanish", "rang", "bass", "thud", "like", "cannon", "fire", "distant", "galaxi", "boom", "deep", "mix", "lumin", "larg", "emerg", "linger", "like", "carina", "nebula", "time", "disappear", "consider", "basinski", "lead", "drift", "good", "24", "minut", "slow", "fade", "overtak", "piec", "near", "silenc", "complet", "black", "care", "otherworldli", "tone", "return", "basinski", "draw", "way", "corner", "univers", "human", "presum", "reach", "basinski", "employ", "inhuman", "element", "amplifi", "mourn", "heart", "middl", "black", "hole", "just", "disintegr", "loop", "conjur", "elegiac", "encroach", "abyss", "time", "time", "make", "billionyearold", "buzz", "neutron", "star", "heartstir", "cd", "digitalonli", "piec", "4ed4erepr", "cull", "2017", "instal", "yield", "time", "time", "clock", "10", "minut", "featur", "similar", "element", "arrang", "momentum", "loop", "closer", "spirit", "placid", "moment", "wolfgang", "voigt", "ga", "project", "feel", "slight", "comparison", "main", "event", "epic", "titl", "track", "loom", "larg", "heavenli", "bodiesb", "float", "fuckingin", "basinski", "night", "sky"], "date_published": ["2019-03-13T05:00:00"], "sentiment": 0.037566156961318244, "content": "William Basinski’s oeuvre stretches back to the 1980s, but only in the 21st century was he finally recognized and exalted for his work. Even if the Twin Towers hadn’t fallen, Basinski’s profound music might eventually have found an audience, but within a year of its release, The Disintegration Loops—a fragile ambient set, recorded from crumbling magnetic tapes shortly before 9/11, that he paired with haunting video of Manhattan’s damaged skyline, shot from his Brooklyn rooftop—went from being a music archivist’s worst nightmare to a profound meditation on death, loss, and decay, earning Basinski his long-overdue accolades. (He’s even become meme-worthy.) In the stream of music that has followed, Basinski continues to strike a singular balance between past and present, beauty and noise, signal and silence.\nThe title On Time Out of Time would fit virtually any of Basinski’s releases, since most of his music is based on encounters between the past and the present, be they recordings sourced from shortwave radio or old lo-fi piano loops, both drawn from tapes that had lain dormant in his archives for decades. But On Time reaches a little bit further into the past. As part of a collaboration with artists Evelina Domnitch and Dmitry Gelfand, working under the aegis of the MIT- and Caltech-operated Laser Interferometer Gravitational-Wave Observatory (or LIGO), Basinski utilized deep-space recordings captured by LIGO’s interferometers. Two decades of decay informed the tapes behind The Disintegration Loops, but the sounds of On Time Out of Time date from 1.3 billion years ago, when two massive black holes merged and the resultant gravitational waves rippled across our universe. Or, as Basinski glibly put it when presenting the piece live, it’s what it sounds like “when two black holes fuck.”\nThe 39-minute composition may draw from deep in the universe, but it retains the telltale intimacy of all Basinski’s work. There are spectral drones, the warm crackle of static, the squiggle of radio frequencies in the night air. “It was just coming from the sky,” Basinski used to say of his culling method, one hand on the dial of his shortwave radio. As much as the use of space recordings is aligned with Basinski’s method, it also harks back to his own childhood, growing up in Houston, where his father worked for NASA in the early 1970s.\nThere’s nothing inherently warm about the signals that LIGO picked up. Considered separately, most of the sounds here convey all the chilly eeriness of the void of deep space. It’s a buzz that brings to mind inhuman things: microwaves, quasars, the fluorescent lights at Office Depot. But Basinski weaves these transmissions into something far more evocative. A small, quivering high frequency resonates some four minutes in, adding a brief glimpse of warmth before vanishing back out of range. Bass thuds like cannons fired from a distant galaxy boom from deep within the mix. Something luminous and large emerges, lingering like the Carina Nebula. Time seems to disappear from consideration.\nBasinski leads us to drift for a good 24 minutes before a slow fade overtakes the piece, nearing silence and complete blackness. But, ever so carefully, the otherworldly tones return and Basinski draws us back in. Way out here, in a corner of the universe that humans will presumably never reach, Basinski employs the most inhuman of elements to find and amplify the mournful heart in the middle of a black hole. Just as The Disintegration Loops conjured the elegiac out of the encroaching abyss, On Time Out of Time makes the billion-year-old buzz of two neutron stars into something heart-stirring.\nThe CD and digital-only piece “4(E+D)4(ER=EPR)” is also culled from the 2017 installations that yielded “On Time Out of Time.” It clocks in at under 10 minutes and features similar elements, but arranged with more momentum, the loops closer in spirit to the placid moments of Wolfgang Voigt’s GAS project. It feels slight in comparison to the main event here. But the epic title track looms large, up with the other heavenly bodies—be they floating or fucking—in Basinski’s night sky.\n", "pptitle": ["time", "time"]}