{"id": "PF_61", "url": "https://pitchfork.com/reviews/albums/foals-part-1-everything-not-saved-will-be-lost/", "name": ["Everything", "Not", "Saved", "Will", "Be", "Lost", "Part", "1"], "description": ["foal", "rsum", "fill", "role", "look", "quaint", "guitar", "band", "2019", "emerg", "wave", "hype", "british", "press", "dave", "sitekproduc", "debut", "sub", "pop", "transatlant", "hipster", "band", "meant", "year", "later", "imperi", "rock", "act", "won", "nme", "best", "track", "award", "nearli", "sevenminut", "singl", "windswept", "majest", "titl", "spanish", "sahara", "subsequ", "album", "foal", "rare", "uk", "act", "manag", "break", "america", "persever", "industri", "muscl", "number", "mountain", "gate", "inconceiv", "neighbor", "imagin", "dragon", "kroq", "cage", "eleph", "silversun", "pickup", "spring", "fling", "rock", "af", "packag", "tour", "lane", "their", "want", "foal", "probabl", "greater", "ambit", "big", "sentiment", "boy", "britannia", "right", "indulg", "doubl", "album", "point", "big", "band", "matter", "1", "appel", "save", "lost", "deflat", "foretellingfo", "halfstep", "thing", "drop", "project", "entireti", "mightv", "impress", "power", "split", "sensibl", "foal", "album", "23rd", "way", "true", "great", "obviou", "explan", "overstay", "welcom", "10", "minut", "theyr", "nearli", "ident", "sequenc", "ident", "ratio", "aerob", "funkrock", "ambient", "lunar", "rover", "laserlit", "product", "valu", "despit", "thrown", "gauntlet", "doublealbum", "save", "doesnt", "ask", "forget", "knew", "foal", "just", "look", "discographi", "slightli", "differ", "perspect", "optimist", "view", "exit", "present", "unifi", "theori", "foal", "cocksur", "strut", "miami", "total", "life", "forev", "given", "breath", "room", "spanish", "sahara", "black", "gold", "just", "end", "wear", "groov", "halfway", "white", "onion", "likewis", "meld", "precis", "2008", "antidot", "meatier", "stoogerawk", "2015", "went", "yanni", "philippaki", "increasingli", "anodyn", "lyric", "im", "maze", "break", "cagelikewhich", "assum", "textur", "propuls", "electron", "remix", "cultur", "somewhat", "evid", "flashbulbpop", "synth", "degre", "oddli", "sweatless", "theyr", "observ", "stage", "bodi", "danc", "floor", "foal", "chop", "pull", "interest", "departur", "bassist", "walter", "gerver", "couldv", "drastic", "hamstrung", "band", "reliant", "rhythmic", "precis", "theyv", "song", "bassdriven", "syrup", "save", "lack", "audac", "risk", "embarrass", "inher", "make", "doubl", "album", "panach", "withstand", "foal", "rise", "notabl", "happen", "arctic", "monkey", "spin", "wheel", "1975", "just", "warm", "festivalheadlin", "peer", "boldli", "reinvent", "year", "fair", "assum", "philippaki", "look", "shoulder", "base", "titl", "im", "world", "lack", "charisma", "presenc", "peer", "make", "schmaltzi", "piano", "ballad", "transcend", "subvers", "actual", "foal", "problem", "ambit", "just", "largefont", "rock", "band", "day", "pitfal", "make", "apolit", "art", "feel", "borderlin", "neglig", "easier", "feel", "desensit", "doomsay", "just", "increment", "wors", "philippaki", "feel", "way", "trump", "clog", "computerbut", "im", "watch", "day", "yelp", "luna", "line", "easi", "miss", "amid", "save", "memor", "riff", "lowbrow", "knowhow", "frame", "foal", "think", "person", "red", "hot", "chili", "pepper", "kung", "fu", "kid", "lunari", "moonin", "bella", "luna", "save", "hype", "kind", "concept", "record", "footnot", "green", "new", "deal", "degre", "exit", "pass", "torch", "song", "mother", "earth", "sea", "eat", "skybut", "say", "lie", "there", "real", "sens", "urgenc", "foal", "crowdpleas", "coachellacor", "ice", "age", "come", "iceag", "philippaki", "sing", "citi", "burnw", "dont", "damncaus", "got", "friend", "right", "penultim", "sunday", "handsintheaircoda", "arriv", "right", "cue", "perfunctori", "happi", "end", "bigbudget", "disast", "flick", "doesnt", "need", "sequel"], "date_published": ["2019-03-12T05:00:00"], "sentiment": 0.17835788763208119, "content": "Foals’ résumé is filled with roles that now look quaint for guitar bands in 2019. They emerged on a wave of hype from the British press with a Dave Sitek-produced debut on Sub Pop, a transatlantic “hipster band” when that still meant something.\nTwo years later, they were an imperial rock act that won the NME Best Track Award with a nearly seven-minute single as windswept and majestic as its title (“Spanish Sahara”). On their subsequent two albums, Foals became the rare UK act that managed to break America through perseverance and industry muscle: “My Number” and “Mountain at My Gates” made them inconceivable neighbors with Imagine Dragons on KROQ and Cage the Elephant and Silversun Pickups on a “Spring Fling Rock AF” package tour. This lane is all theirs if they want it, but Foals probably had greater ambitions than being the last of the Big Sentimental Boys of Britannia. They have every right to get indulgent with a double album at a point where big bands have to matter. But the “Part 1” appellation to Everything Not Saved Will Be Lost is deflating as it is foretelling—Foals are half-stepping all over this thing.\nDropping the whole project its entirety might’ve been the more impressive power move, but the split is sensible. All Foals albums get about 2/3rds of the way to true greatness and the most obvious explanation is that they all overstay their welcome by at least 10 minutes. Or, they’re nearly identically sequenced and have an identical ratio of aerobic funk-rock to ambient lunar rovers that show off the laser-lit production values. But despite the thrown gauntlet as the first part of a double-album, Everything Not Saved doesn’t ask to forget everything you knew about Foals, just to look at their discography from slightly different perspectives. The optimistic view of “Exits” is that it presents a unified theory of Foals, where the cocksure strut of “Miami” or “Total Life Forever” is given the same breathing room as “Spanish Sahara” or “Black Gold,” but it just ends up wearing out its groove about halfway through.\n“White Onions” likewise melds the precision of 2008’s Antidotes to the meatier Stooge-rawk of 2015’s What Went Down and Yannis Philippakis’ increasingly anodyne lyricism: “I’m in a maze, I break the cage”—like...which one? Their assumed interest in the textures and propulsion of electronic remix culture is somewhat evident from the flashbulb-popping synths of “In Degrees,” but it’s oddly sweatless. They’re observers from the stage rather than bodies on the dance floor.\nFoals have always had the chops to pull off anything that interests them. The departure of bassist Walter Gervers could’ve drastically hamstrung a band this reliant on rhythmic precision yet they’ve never made a song as bass-driven as “Syrups.” What Everything Not Saved lacks is the audacity to risk the embarrassment inherent in making a double album or the panache to withstand it. Foals’ rise notably happened while Arctic Monkeys were spinning their wheels and the 1975 were just warming up, two festival-headlining peers who boldly reinvented themselves last year. It’s fair to assume Philippakis is looking over his shoulder based on the title of “I’m Done With the World (& It’s Done With Me),” but he lacks the charisma and presence of his peers to make a schmaltzy piano ballad transcendent, subversive or something more than it actually is.\nOr, Foals’ problem is that they have the same ambitions as just about every other large-font rock band these days and thus the same pitfalls. Making apolitical art feels borderline negligent, and yet it’s easier than ever to feel desensitized to the doomsaying when everything just seems to get incrementally worse. Philippakis feels the same way: “Trump clogging up my computer/But I’m watching all day,” he yelps during “On the Luna,” a line easy to miss amid Everything Not Saved’s most memorable riff and lowbrow know-how that frames Foals as the thinking person’s Red Hot Chili Peppers (“When I was a kung fu kid on the lunar/I was moonin’ at the Bella Luna”).\nEverything Not Saved has been hyped as a kind of concept record to be footnoted in the Green New Deal: “In Degrees” and “Exits” could pass as torch songs for Mother Earth (“Now the sea eats the sky/But they say that it’s a lie”), yet there’s never any real sense of urgency to Foals’ crowd-pleasing Coachella-core: It’s less “the ice age is coming” and more “Iceage is up next.” And so as Philippakis sings “Cities burn/We don’t give a damn/’Cause we got all our friends right here,” on the penultimate “Sunday,” the hands-in-the-air-coda arrives right on cue, the perfunctory happy ending for a big-budget disaster flick that doesn’t need a sequel but will get one anyway.\n", "pptitle": ["save", "lost", "1"]}