{"id": "PF_25", "url": "https://pitchfork.com/reviews/albums/american-football-american-football-lp3/", "name": ["American", "Football", "(LP3)"], "description": ["american", "footbal", "abandon", "dearli", "belov", "hous", "urbana", "ill", "grace", "cover", "album", "hous", "avatar", "youth", "nostalgia", "band", "midwest", "emo", "replac", "cover", "american", "footbal", "lp", "sinist", "beauti", "bloodshot", "sunris", "creep", "fog", "shot", "taken", "10", "minut", "away", "town", "champaign", "certain", "vantag", "point", "think", "morn", "origin", "hous", "704", "w", "high", "street", "burnt", "cinder", "american", "footbal", "prefer", "way", "dazzl", "album", "doe", "away", "selfmytholog", "take", "bleari", "bold", "step", "new", "dawn", "american", "footbal", "known", "colloqui", "lp3", "band", "studio", "album", "selftitl", "awaken", "microscop", "bell", "chime", "shudder", "vibraphon", "seven", "minut", "silhouett", "swaddl", "band", "guitar", "lattic", "reverb", "glittergray", "exhaust", "steve", "reich", "reincarn", "tinni", "iphon", "alarm", "lead", "singer", "mike", "kinsella", "nightstand", "go", "sleepless", "night", "oh", "muscl", "memori", "stay", "kinsella", "sing", "sharp", "turn", "typic", "american", "footbal", "song", "exlov", "wist", "stare", "midwestern", "autumn", "sunset", "work", "band", "owen", "he", "stare", "old", "style", "line", "like", "tell", "what", "allur", "inconsequenti", "love", "speak", "pull", "have", "felt", "escap", "mundan", "creep", "love", "consequ", "lp3", "explor", "old", "emo", "adag", "feel", "good", "turn", "kind", "middleag", "anhedonia", "sensit", "deprivedi", "feel", "thing", "insid", "kinsella", "sigh", "skitter", "percuss", "gloss", "harmon", "lp2", "2016", "litter", "firstthoughtbestthought", "lyric", "like", "kinsella", "use", "persona", "quintessenti", "emo", "dad", "justif", "selfpiti", "titl", "uncomfort", "numb", "indic", "kinsella", "newfound", "abil", "wink", "time", "use", "age", "40", "conceal", "patholog", "deeproot", "repress", "understood", "genet", "blame", "father", "youthnow", "father", "blame", "booz", "isnt", "exampl", "late90", "midwestern", "emo", "hero", "grace", "transit", "fatherhood", "match", "sonic", "evolut", "american", "footballwith", "unherald", "produc", "jason", "cupp", "render", "american", "footbal", "brilliant", "topograph", "album", "ideal", "form", "music", "test", "hifi", "speaker", "emo", "fractiou", "rhythm", "plaintiv", "untrain", "vocal", "complet", "sever", "hardcor", "root", "bleed", "shoegaz", "postrock", "minimalist", "jazzgenr", "vibe", "feel", "nearli", "track", "lp3", "push", "fiveminut", "mark", "previou", "american", "footbal", "song", "intern", "journey", "album", "travel", "new", "vista", "direct", "flow", "wave", "rise", "languor", "asymmetr", "like", "tide", "pool", "outro", "descend", "deep", "water", "cure", "disintegr", "intro", "doom", "bloom", "dare", "toe", "vast", "ocean", "smash", "pumpkin", "mellon", "colli", "infinit", "sad", "impact", "recent", "induct", "multiinstrumentalist", "nate", "kinsella", "notic", "rubberi", "backbon", "wave", "rise", "feel", "you", "thrum", "motorik", "wealth", "textur", "bring", "lp3", "warrant", "altern", "superl", "titl", "like", "one", "use", "late", "90", "mellotron", "flute", "children", "choir", "heir", "appar", "french", "vocal", "wave", "rise", "bass", "breakdown", "12string", "feel", "emo", "diplomaci", "uncomfort", "numb", "featur", "paramor", "hayley", "william", "biggest", "bombshel", "basic", "emo", "band", "2019", "sound", "somewhat", "like", "american", "footbal", "andor", "paramor", "william", "shatter", "song", "immedi", "brought", "wattag", "paramor", "bestknown", "song", "instead", "slowli", "impercept", "weav", "second", "vers", "voic", "conscienc", "kinsella", "sink", "deeper", "despair", "tenderli", "tri", "buoy", "bridg", "take", "vers", "lower", "duski", "regist", "complet", "unrecogniz", "hayley", "william", "turn", "duet", "emo", "icon", "humbl", "heartbreak", "exchang", "laps", "lover", "15", "year", "lp1", "american", "footbal", "album", "indi", "rock", "equival", "richard", "linklat", "1995", "film", "sunrisea", "humbl", "masterpiec", "mix", "emot", "offer", "affirm", "hopeless", "skeptic", "romant", "believ", "love", "sight", "question", "forev", "meaningdid", "realli", "matter", "got", "like", "sunset", "2016", "lp2", "capit", "sleeper", "success", "origin", "outright", "sequel", "trace", "charm", "awkward", "recoupl", "tri", "hit", "familiar", "beat", "hardli", "redund", "unnecessari", "felt", "bit", "indulg", "dictat", "relationship", "predecessor", "establish", "new", "narr", "mike", "kinsella", "admit", "basic", "fan", "servic", "act", "lp3", "linklat", "wonder", "2013", "film", "midnight", "find", "lead", "unexpectedli", "tradit", "role", "jess", "celin", "marri", "children", "american", "footbal", "regularli", "tour", "band", "make", "album", "year", "instead", "17", "access", "darker", "deeper", "reson", "envis", "immacul", "concept", "just", "want", "home", "william", "plead", "end", "uncomfort", "numb", "mayb", "coupl", "struggl", "vain", "believ", "love", "worth", "fight", "mayb", "wish", "kind", "inconsequenti", "unforgett", "romanc", "meant", "summer", "end", "reason", "fan", "make", "pilgrimag", "hous", "704", "w", "high", "street", "american", "footbal", "clear", "intent", "beginningthey", "home", "theyd", "trudg", "forward", "heaviest", "heart"], "date_published": ["2019-03-21T05:00:00"], "sentiment": 0.08119011179617237, "content": "American Football have abandoned the dearly beloved house in Urbana, Ill. that graced the cover of their first two albums. That house became an avatar for youthful nostalgia, the band, and Midwest emo itself. Its replacement on the cover of the third American Football LP has an almost sinister beauty to it: a bloodshot sunrise, a creeping fog. The shot was taken about 10 minutes away in the town of Champaign and, from a certain vantage point, you might think it was the morning after the original house at 704 W. High Street was burnt to cinders. American Football might prefer it that way, as their dazzling third album does away with their self-mythology and takes bleary, bold steps toward a new dawn.\nAmerican Football (known colloquially as LP3, as all the band’s studio albums are self-titled) awakens with microscopic bell chimes and shudders of vibraphone as the seven minutes of “Silhouettes” swaddle the band’s guitar lattices in reverb and glitter-gray exhaust. It’s Steve Reich reincarnated as a tinny iPhone alarm on lead singer Mike Kinsella’s nightstand, going off after a sleepless night. “Oh, the muscle memory it must take to stay,” Kinsella sings, a sharp turn from the typical American Football song where ex-lovers wistfully stare into a Midwestern autumn sunset, or his work with the band Owen, where he’s staring down an Old Style at last call. And yet, a line like, “Tell me again what’s the allure of inconsequential love,” speaks to the pull of having at least felt something, an escape from the mundanity that creeps into any love of consequence.\nLP3 explores the old emo adage “nothing feels good” and turns it into a kind of middle-age anhedonia. “Sensitivity deprived/I can’t feel a thing inside,” Kinsella sighs over skittering percussion and glossed harmonics. LP2, from 2016, was littered with first-thought-best-thought lyrics like these, Kinsella using his persona as Quintessential Emo Dad as a justification for his self-pity. But the title of “Uncomfortably Numb” is indicative of Kinsella’s newfound ability to wink and cry at the same time. He uses aging into his 40s to conceal a pathology so deep-rooted and repressed, it can only be understood as genetic: “I blamed my father in my youth/Now as a father, I blame the booze.”\nThis isn’t the only example of late-’90s Midwestern emo heroes gracefully transitioning themselves to fatherhood, but few can match the sonic evolution of American Football—with unheralded producer Jason Cupp once again rendering American Football in brilliant topographic detail, the album is an idealized form of music to test hi-fi speakers. Emo’s fractious rhythms and plaintive, untrained vocals are completely severed from its hardcore roots and bleed into shoegaze, post-rock, and minimalist jazz—genres that do vibes more than feelings.\nNearly every track on LP3 pushes out toward the five-minute mark, and where previous American Football songs were internal journeys, this album’s travel to new vistas in all directions. The flow of “Every Wave to Ever Rise” is languorous and asymmetrical like a tide pool before its outro descends into the same deep water as the Cure’s Disintegration, whereas the intro of “Doom in Full Bloom” dares to toe the vast oceans of Smashing Pumpkins’ Mellon Collie and the Infinite Sadness. The impact of recently inducted multi-instrumentalist Nate Kinsella is most noticeable on the rubbery backbone of “Every Wave to Ever Rise” and “I Can’t Feel You”’s thrumming motorik, but the wealth of textures he brings to LP3 warrants alternative superlative titles like the ones they used back in the late ’90s: The One With the Mellotron Flutes and Children’s Choir (“Heir Apparent”), The One With French Vocals (“Every Wave to Ever Rise”), The One With the Bass Breakdown and a 12-String (“I Can’t Feel You”).\nThe emo diplomacy of “Uncomfortably Numb,” featuring Paramore’s Hayley Williams, is the biggest bombshell, as basically every emo band in 2019 sounds at least somewhat like American Football and/or Paramore. Williams would shatter the song immediately if she brought the wattage of Paramore’s best-known songs. Instead, she slowly and imperceptibly weaves into the second verse, a voice of conscience as Kinsella sinks deeper into despair. She tenderly tries to buoy him up during the bridge and takes over the third verse in a lower, dusky register completely unrecognizable as that of Hayley Williams, turning a duet between emo icons into a humble, heartbreaking exchange between lapsed lovers.\nFor the 15 years during which LP1 was the only American Football album, it was indie rock’s equivalent of Richard Linklater’s 1995 film Before Sunrise—a humble masterpiece of mixed emotions that offered affirmation to hopeless and skeptical romantics, believing in love at first sight while questioning whether it has to last forever to have meaning—did it really matter if they got back together again? And like Before Sunset, 2016’s LP2 capitalized on the sleeper success of its original with an outright sequel that traced the charming awkwardness of recoupling and trying to hit the familiar beats. Though hardly redundant or unnecessary, it felt a bit indulgent, too dictated by its relationship with its predecessor to establish a new narrative; Mike Kinsella himself admits it was basically fan service.\nAnd the third act of each, LP3 and Linklater’s wonderful 2013 film Before Midnight, finds their leads in unexpectedly traditional roles: Jesse and Celine married with children, American Football as a regularly touring band that makes albums every three years instead of 17, all accessing a darker, deeper resonance than they ever envisioned during their immaculate conception. “I just want you home,” Williams pleads towards the end of “Uncomfortably Numb.” Maybe it’s a couple struggling in vain to believe their love is worth fighting for, maybe a wish for the kind of inconsequential, unforgettable romances of “Never Meant” or “The Summer Ends”? The latter is the reason fans make the pilgrimage to the house at 704 W. High Street, but American Football is clear about its intent from the beginning—they can go back home, but they’d rather trudge forward with the heaviest of hearts.\n", "pptitle": ["american", "footbal", "lp3"]}