{"id": "PF_49", "url": "https://pitchfork.com/reviews/albums/the-faint-egowerk/", "name": ["Egowerk"], "description": ["faint", "havent", "convict", "match", "furi", "2014", "doom", "abus", "omaha", "electrorock", "outfit", "sound", "like", "band", "search", "machin", "rage", "settl", "instead", "success", "eversilli", "antitech", "anticonform", "antieveryth", "screed", "hard", "imagin", "took", "serious", "substanc", "secondari", "style", "guy", "fun", "listen", "band", "doesnt", "buy", "slogan", "faint", "smirk", "egowerk", "album", "year", "theyr", "do", "better", "job", "disguis", "theyv", "focus", "ire", "subject", "good", "deal", "topic", "reson", "social", "media", "specif", "way", "onlin", "platform", "play", "societi", "worst", "instinct", "exacerb", "cultur", "divid", "singer", "todd", "fink", "doesnt", "need", "overst", "fallout", "live", "especi", "wake", "2016", "weve", "seen", "peopl", "willingli", "spread", "misinform", "bulli", "eat", "disord", "wors", "vicious", "attack", "anybodi", "perceiv", "opposit", "chameleon", "night", "detail", "entrench", "everybodi", "talk", "dont", "know", "shityou", "fight", "fight", "ego", "tripit", "video", "game", "your", "avatarwhat", "fake", "damag", "isnt", "confin", "comment", "section", "there", "gradual", "eros", "selfesteem", "come", "spend", "time", "artifici", "environ", "know", "tri", "best", "make", "live", "look", "better", "life", "joke", "captur", "fruitless", "seek", "valid", "onlin", "want", "fit", "inbut", "want", "stand", "fink", "sing", "grind", "distress", "synth", "want", "trust", "bodybut", "your", "best", "usual", "music", "fit", "viciou", "open", "child", "asleep", "faint", "coloss", "track", "gnarli", "frenzi", "rumbl", "808", "electr", "jolt", "selfproduc", "serv", "band", "drum", "uncanni", "synthet", "clap", "techno", "sound", "like", "theyr", "reverber", "real", "wall", "wont", "surpris", "anybodi", "who", "caught", "live", "group", "fight", "shape", "long", "casual", "listen", "misplac", "copi", "saddl", "creek", "50", "faint", "continu", "draw", "surprisingli", "larg", "passion", "crowd", "stage", "reflex", "carri", "egowerk", "dramat", "halt", "breakdown", "group", "graduat", "reedi", "electron", "earli", "00", "dancepunk", "immers", "fulli", "edm", "music", "retain", "urgent", "physic", "probabl", "best", "faint", "continu", "work", "recent", "leisur", "pace", "album", "half", "decad", "band", "burn", "idea", "fast", "end", "egowerk", "song", "grow", "thinner", "obviou", "80", "refer", "gari", "numan", "synth", "flutter", "fouronthefloor", "electrofunk", "young", "realist", "album", "faith", "callback", "dans", "macabr", "day", "automaton", "robot", "danc", "record", "finish", "line", "particular", "ambit", "awe", "littl", "bit", "faint", "goe", "long", "way", "long", "there", "technolog", "angstand", "imposs", "imagin", "time", "wont", "bether", "go", "life", "left", "sound"], "date_published": ["2019-03-15T05:00:00"], "sentiment": -0.004598747212383578, "content": "The Faint haven’t always had the convictions to match their fury. On 2014’s Doom Abuse, the Omaha electro-rock outfit sounded more than ever like a band in search of a machine to rage against, settling instead on a succession of ever-sillier anti-tech, anti-conformity, anti-everything screeds that it’s hard to imagine even they took very seriously. Substance has always been secondary to style for these guys, but it’s still no fun listening to a band that doesn’t buy their own sloganeering.\nIf the Faint are still smirking on Egowerk, their first album in five years, then they’re doing a better job disguising it. They’ve focused their ire on a subject a good deal more topical and resonant: social media, specifically the ways online platforms play into society’s worst instincts and exacerbate cultural divides. Singer Todd Fink doesn’t need to overstate the fallout, because we’re all living it. Especially in the wake of 2016, we’ve seen how people willingly spread misinformation, bully each other into eating disorders or worse, and viciously attack anybody perceived as the opposition. “Chameleon Nights” details the entrenchment: “Everybody’s talking but we don’t know shit/You fight, I fight, it’s an ego trip/It’s a video game and you’re an avatar/What you fake becomes what you are.”\nThe damage isn’t only confined to the comment sections. There’s also the gradual erosion of your self-esteem that comes from spending so much time in an artificial environment where everyone you know is trying their best to make their lives look better than yours. “Life’s a Joke” captures the fruitlessness of seeking validation online. “You want to fit in/But you want to stand out,” Fink sings over grinding, distressed synths. “You want to trust your body/But you’re best without.”\nAs usual, the music is fitfully vicious. Opener “Child Asleep” may be the Faint’s most colossal track yet, a gnarly frenzy of rumbling 808s and electric jolts. Self-producing has served the band well; the drums have the uncanny synthetic clap of techno, yet they sound like they’re reverberating off of real walls. It won’t surprise anybody who’s caught their live show that the group is still in fighting shape. Long after casual listeners misplaced their copies of the Saddle Creek 50, the Faint continued drawing surprisingly large, passionate crowds, and some of those stage reflexes carry over to Egowerk’s dramatic halts and breakdowns. Even as the group has graduated beyond the reedy electronics of their early ’00s dance-punk and immersed themselves more fully in EDM, the music has retained its urgent physicality.\nStill, it’s probably for the best that the Faint continue working at their recent leisurely pace of about an album every half decade, because this band burns through their ideas fast. Toward the end of Egowerk the songs grow thinner and more obvious in their ’80s references. Gary Numan synths flutter over the four-on-the-floor electro-funk of “Young & Realistic,” the album’s most faithful callback of the Danse Macabre days, while “Automaton” robot dances the record to the finish line with no particular ambition to awe. A little bit of the Faint goes a long way, but as long as there’s technological angst—and it’s impossible to imagine a time when there won’t be—there’s always going to some life left in this sound.\n", "pptitle": ["egowerk"]}