{"id": "PF_101", "url": "https://pitchfork.com/reviews/albums/everything-but-the-girl-walking-wounded/", "name": ["Walking", "Wounded"], "description": ["half", "dozen", "tracey", "thorn", "slouch", "chromewal", "hotel", "suit", "video", "wrong", "wear", "snakeskinprint", "shirtdress", "wilt", "quiff", "kiss", "brow", "hang", "background", "hand", "ben", "watt", "watch", "thorn", "make", "thenlov", "crouch", "floor", "lean", "wall", "sit", "kitchen", "counter", "shot", "lean", "thorn", "shoulder", "mime", "gentl", "line", "want", "know", "like", "gaze", "floor", "version", "bandmat", "seethrough", "qualiti", "ghost", "crowd", "extra", "danc", "choru", "follow", "youcaus", "wrong", "peopl", "love", "equal", "flesh", "blood", "memori", "myriad", "way", "time", "trauma", "impact", "relationship", "fractur", "one", "sens", "self", "territori", "walk", "wound", "stalk", "releas", "1996", "eighth", "album", "uk", "duo", "girl", "sound", "pick", "piec", "tri", "puzzl", "togetherif", "theyll", "fit", "time", "uk", "chart", "domin", "oasiss", "lad", "rock", "lighthous", "famili", "easylisten", "hit", "differ", "exampl", "histor", "rehash", "triphop", "pioneer", "tricki", "massiv", "attack", "critic", "darl", "earli", "experiment", "releas", "skew", "closer", "soul", "hiphop", "opportun", "connect", "dot", "breath", "new", "life", "pop", "long", "brew", "wrong", "song", "push", "love", "break", "point", "elev", "tension", "hous", "piano", "riff", "lion", "share", "walk", "wound", "draw", "downtempo", "drum", "n", "bass", "triphop", "paper", "compress", "wide", "open", "space", "thennasc", "sound", "pop", "format", "couldv", "disast", "word", "dont", "justic", "emot", "multiplicityhurt", "warm", "worn", "richof", "thorn", "voic", "seamlessli", "home", "amid", "watt", "stark", "sonic", "architectur", "thorn", "watt", "songwrit", "trace", "feminist", "leftw", "diarist", "line", "previou", "seven", "album", "matur", "walk", "wound", "trawl", "corner", "psych", "way", "felt", "convers", "music", "precis", "album", "use", "space", "allow", "stretch", "reflect", "realli", "mean", "love", "sustain", "connect", "requir", "despit", "album", "vulner", "dialogu", "circl", "walk", "wound", "time", "releas", "focus", "indiepop", "band", "seemingli", "sudden", "embrac", "danc", "floor", "theyd", "experi", "jazz", "bossa", "nova", "soul", "orchestr", "music", "youth", "new", "direct", "catapult", "previous", "unseen", "level", "stardom", "stori", "ascent", "usual", "goe", "like", "new", "york", "hous", "legend", "todd", "terri", "ginorm", "remix", "song", "miss", "1994", "album", "amplifi", "heart", "led", "hasti", "creation", "clubinspir", "walk", "wound", "terri", "certainli", "set", "stage", "wrong", "like", "comeup", "stori", "heavili", "abridg", "thorn", "watt", "anoth", "muse", "soon", "met", "univers", "1981", "sign", "label", "thorn", "postpunk", "group", "marin", "girl", "favorit", "kurt", "cobain", "watt", "solo", "folk", "artist", "collabor", "robert", "wyatt", "bond", "share", "antipathi", "rock", "hegemoni", "romant", "music", "partnership", "grew", "interest", "explor", "hybrid", "sound", "replic", "statu", "quo", "label", "blanco", "y", "negroa", "subsidiari", "weawarn", "musicw", "pop", "hit", "appli", "kind", "pressur", "eat", "away", "anyon", "confid", "album", "releas", "1991", "lukewarm", "tourlifeinspir", "worldwid", "music", "hit", "nostalg", "tone", "summer", "1992", "watt", "diagnos", "extrem", "rare", "lifethreaten", "autoimmun", "disord", "call", "churgstrauss", "syndrom", "80", "intestin", "remov", "spent", "month", "intens", "care", "includ", "seri", "relaps", "recoveri", "long", "slow", "involv", "radic", "restrict", "diet", "1993", "adjust", "new", "life", "watt", "got", "increasingli", "comput", "sequenc", "start", "journey", "produc", "midway", "year", "thorn", "receiv", "invit", "provid", "guest", "vocal", "massiv", "attack", "second", "album", "protect", "heard", "music", "titl", "track", "struck", "im", "sure", "heard", "piec", "music", "slow", "recal", "memoir", "bedsit", "disco", "queen", "song", "wrote", "drew", "feel", "watt", "claw", "way", "health", "earlier", "summer", "pair", "travel", "oxfordshir", "collabor", "fairport", "convent", "festiv", "perform", "see", "60", "british", "folk", "group", "oper", "outsid", "suffoc", "demand", "major", "label", "remind", "thorn", "watt", "diy", "begin", "help", "shed", "insecur", "like", "old", "day", "make", "record", "need", "wrote", "thorn", "memoir", "album", "follow", "1994", "amplifi", "heart", "address", "distress", "watt", "brush", "death", "perspect", "patient", "caregiv", "thorn", "did", "major", "lyric", "write", "album", "5050", "sonic", "turn", "closer", "fairport", "convent", "yearn", "folk", "massiv", "attack", "proto", "triphop", "song", "clubbi", "edg", "cowbel", "acoust", "guitarl", "miss", "agre", "lead", "singl", "american", "label", "realli", "heard", "potenti", "miss", "atlant", "commiss", "todd", "terri", "remix", "includ", "12", "market", "second", "half", "1994", "convers", "wea", "decid", "end", "road", "band", "uk", "just", "like", "drop", "miss", "overnight", "hit", "wasnt", "earli", "1995", "thorn", "new", "york", "massiv", "attack", "do", "promo", "inkl", "todd", "terri", "fairli", "loyal", "song", "leg", "song", "power", "terri", "said", "later", "just", "ad", "beat", "basslin", "ive", "felt", "hous", "music", "radio", "club", "feel", "simultan", "massiv", "attack", "daddi", "g", "heard", "club", "report", "thorn", "sound", "like", "danc", "floor", "hit", "interview", "commit", "massiv", "attack", "wrote", "singl", "hotel", "room", "set", "tone", "walk", "wound", "album", "swam", "focu", "struggl", "seen", "asto", "asan", "individu", "context", "relationship", "thorn", "later", "sing", "lyric", "mute", "saxsound", "synth", "languid", "triphop", "beat", "youam", "myselfi", "feel", "younger", "louderlik", "dont", "connect", "spring", "1995", "thorn", "return", "new", "york", "watt", "spent", "coupl", "month", "work", "idea", "walk", "wound", "trip", "learn", "terri", "remix", "blown", "miami", "fact", "state", "break", "club", "chart", "worldwid", "went", "sell", "3", "million", "copi", "month", "miss", "mania", "hit", "uk", "watt", "dive", "headfirst", "london", "drum", "n", "bass", "scene", "heard", "dj", "like", "fabio", "doc", "scott", "atmospher", "drum", "n", "bass", "pioneer", "ltj", "bukem", "night", "speed", "connect", "freeform", "flow", "sound", "bukem", "compar", "jazz", "enthusiasm", "eventu", "convinc", "thorn", "join", "club", "night", "wasnt", "rock", "gig", "wasnt", "raveit", "felt", "like", "new", "wrote", "memoir", "strang", "familiar", "felt", "possibl", "mental", "space", "new", "encount", "crack", "open", "observ", "clariti", "thorn", "watt", "approach", "songwrit", "walk", "wound", "breezi", "flipsid", "featur", "lyric", "watt", "scratch", "scottish", "produc", "howi", "b", "moment", "watt", "life", "got", "turn", "upsid", "directli", "referenc", "london", "summer", "92i", "think", "ive", "chang", "lot", "vers", "watt", "write", "blast", "land", "compar", "coastlin", "that", "constantli", "shift", "merci", "sea", "poetic", "remind", "process", "trauma", "shape", "incid", "thorn", "mouth", "lyric", "serv", "underlin", "watt", "neardeath", "experi", "left", "reel", "question", "use", "know", "flipsid", "flipsid", "come", "form", "slomo", "drum", "n", "bass", "number", "call", "big", "deal", "written", "thorn", "use", "titular", "phrase", "sarcast", "attempt", "deliv", "realiti", "check", "air", "frustrat", "sing", "watt", "search", "answer", "club", "say", "wanna", "cure", "wanna", "turn", "headoh", "say", "hurt", "feel", "unsurefirst", "doubt", "doubt", "herbig", "deal", "that", "way", "feel", "goe", "trauma", "form", "song", "suggest", "matter", "give", "space", "work", "strength", "walk", "wound", "lie", "exactli", "girl", "album", "style", "stori", "thorn", "watt", "individu", "gift", "shine", "brightest", "strip", "share", "knottiest", "feel", "creat", "dialogu", "skelet", "new", "sound", "record", "insular", "way", "previous", "time", "sonic", "emot", "wrought", "theme", "spoke", "teenag", "includ", "did", "band", "adult", "contemporari", "bristol", "drum", "n", "bass", "head", "roni", "size", "gave", "thumb", "walk", "wound", "remain", "thorn", "watt", "biggestsel", "album", "worldwid", "sale", "13", "million", "did", "kind", "prompt", "u2", "ask", "tour", "support", "end", "turn", "need", "space", "thorn", "watt", "relationship", "tie", "career", "begin", "time", "listen", "cri", "independ", "walk", "wound", "clearli", "contain", "instead", "go", "tour", "start", "famili", "set", "wheel", "motion", "separ", "career", "come"], "date_published": ["2019-03-03T06:00:00"], "sentiment": 0.04994112038754894, "content": "Half a dozen Tracey Thorns slouch around a chrome-walled hotel suite in the video for “Wrong.” They all wear a snakeskin-print shirt-dress, and have the same wilted quiff kissing their brow. Hanging in the background, a handful of Ben Watts watch every move the Thorns make. There he is, her then-lover, crouching on the floor, leaning against a wall, sitting on a kitchen counter. In one shot, two of him lean over Thorn’s shoulders, miming her gentle line, “I wanted to know what he was like,” as she gazes at the floor. Each version of the two bandmates has a see-through quality to them; they are ghosts to one another and to the crowd of extras that dance around them on the chorus: “Wherever you go I will follow you/’Cause I was wrong.”\nThe people we love are made up equally of flesh, blood, and memories. The myriad ways time and trauma can impact a relationship and fracture one’s sense of self is the territory that Walking Wounded stalks. Released in May 1996, the eighth album from UK duo Everything But the Girl is the sound of picking up the pieces and trying to puzzle them back together—if they’ll fit at all. At the time, the UK charts were dominated by Oasis’s lad rock and the Lighthouse Family’s easy-listening hits: two very different examples of historical rehashes. Trip-hop pioneers Tricky and Massive Attack were critical darlings, but their early experimental releases skewed closer to soul and hip-hop. An opportunity to connect the dots and breath new life into pop had long been brewing.\nWhile “Wrong,” a song about pushing love to its breaking point, elevated its tensions with a house piano riff, the lion’s share of Walking Wounded draws on downtempo, drum ‘n’ bass, and trip-hop. On paper, compressing the wide open space of those then-nascent sounds into a pop format could’ve been a disaster. But words don’t do justice to the emotional multiplicity—hurt but warm, worn but rich—of Thorn’s voice, and how seamlessly she made a home for herself amid Watt’s stark sonic architecture.\nThorn and Watt’s songwriting, which had traced feminist, left-wing, and diaristic lines on their previous seven albums, was mature enough on Walking Wounded to trawl the corners of their psyches in a way that felt in conversation with the music. It was precisely the album’s use of space that allowed them both to stretch out and reflect on what it really means to love someone, and what sustaining that connection requires.\nDespite the album’s vulnerability, the dialogue that circled Walking Wounded at the time of its release focused on the indie-pop band’s seemingly sudden embrace of the dance floor. They’d experimented with jazz, bossa nova, soul, and orchestral music before, but this youthful new direction catapulted them to a previously unseen level of stardom. The story of their ascent usually goes like this: New York house legend Todd Terry’s ginormous remix of their song “Missing,” off their 1994 album Amplified Heart, led to the hasty creation of the club-inspired Walking Wounded. While Terry certainly set the stage for “Wrong,” like all come-up stories, it’s heavily abridged.\nThorn and Watt became one another’s muse more or less as soon as they met at university in 1981. They were both signed to the same label: Thorn with post-punk group Marine Girls, a favorite of Kurt Cobain, and Watt as a solo folk artist who collaborated with Robert Wyatt. As they bonded over their shared antipathy towards rock’s hegemony, a romantic and musical partnership grew. Together, they were interested in exploring hybrid sounds, not replicating the status quo. Their label, however, Blanco y Negro—a subsidiary of WEA/Warner Music—wanted pop hits and applied the kind of pressure that would eat away at anyone’s confidence. Six albums in, with the release of 1991’s lukewarm, tour-life-inspired Worldwide, their music had hit a nostalgic tone. But then, in the summer of 1992, Watt was diagnosed with an extremely rare and life-threatening autoimmune disorder called Churg-Strauss Syndrome. He had to have 80% of his intestines removed and spent months in intensive care, including a series of relapses. His recovery was long and slow, and involved a radically restricted diet.\nIn 1993, as he adjusted to his new life, Watt got increasingly into computers and sequencers, which was the start of his journey to becoming a producer. Midway through the year, Thorn received an invitation to provide guest vocals on what would become Massive Attack’s second album, Protection. When she first heard the music for the title track, she was struck: “I’m not sure whether I have ever heard a piece of music this slow and empty before,” she recalls in her memoir, Bedsit Disco Queen. The song she wrote for it drew on her feelings for Watt as he clawed his way back to health.\nEarlier that summer, the pair had travelled to Oxfordshire to collaborate with Fairport Convention on a festival performance. Seeing the ’60s British folk group operate outside of the suffocating demands of a major label reminded Thorn and Watt of their own DIY beginnings, and helped them shed their insecurities. “Like in the old days, we were making a record again because we NEEDED to,” wrote Thorn in her memoir.\nThe album that followed, 1994’s Amplified Heart, addressed the distress of Watt’s brush with death from the perspective of both the patient and the caregiver (while Thorn often did the majority of the lyric writing, on this album it was 50/50). Yet sonically, it turned out closer to Fairport Convention’s yearning folk than Massive Attack’s proto trip-hop. The one song that had more of a clubby edge to it was the cowbell and acoustic guitar-led “Missing.”\nWhile everyone agreed it should be the lead single, it was their American label that really heard the potential in “Missing”: Atlantic commissioned the Todd Terry remix, which they included on a 12\" for the US market in the second half of 1994. Conversely, WEA decided it was the end of the road for the band in the UK and, just like that, dropped them.\n“Missing” was not an overnight hit. It wasn’t until early 1995, when Thorn was in New York with Massive Attack doing promo, that there was an inkling that Todd Terry’s fairly loyal take on the song might have legs. (“The song was already so powerful,” Terry said later. “I just added a beat and a bassline. I’ve always felt that house music has both a radio and club feel simultaneously.”) Massive Attack’s Daddy G heard it in a club and reported back to Thorn that it sounded like a dance floor hit. Between interview commitments with Massive Attack, she wrote “Single” in her hotel room. It set a tone for Walking Wounded before the album had even swam into focus: one of struggling to be seen as—to see yourself as—an individual in the context of a relationship. Thorn would later sing the lyrics over a muted sax-sounding synth and a languid trip-hop beat: “And how am I without you?/Am I more myself or less myself?/I feel younger, louder/Like I don't always connect.”\nIn spring 1995, Thorn returned to New York with Watt, where they spent a couple of months working on more ideas for Walking Wounded. During that trip, they learned that Terry’s remix had blown up in Miami and, in fact, across the States, breaking out of the clubs and into the charts. Worldwide, it went on to sell 3 million copies.\nIn the months before “Missing” mania hit the UK, Watt had dived headfirst into London’s drum ‘n’ bass scene. He heard DJs like Fabio and Doc Scott at atmospheric drum ‘n’ bass pioneer LTJ Bukem’s night Speed, and connected with the freeform flow of the sound that Bukem has compared with jazz. His enthusiasm eventually convinced Thorn to join him at the club night. “It wasn’t a rock gig, and it wasn’t a rave—it felt like something new again,” she wrote in her memoir. “Strange and yet familiar, it felt possible.”\nThe mental space that these new encounters cracked open can be observed in the clarity with which both Thorn and Watt approached their songwriting on Walking Wounded. On the breezy “Flipside,” which features lyrics by Watt and scratching by Scottish producer Howie B, the moment Watt’s life got turned upside down is directly referenced: “London, summer ’92/I think I’ve changed a lot since then, do you?” In the next verse, Watt writes that he is “blasted land,” comparing himself to a coastline that’s constantly shifting at the mercy of the sea. It’s a poetic reminder that the processing of trauma can shape you as much as the incident itself.\nIn Thorn’s mouth, the lyrics serve to underline that Watt’s near-death experience left them both reeling, questioning everything they used to know. The flipside to “Flipside” comes in the form of a slo-mo drum ‘n’ bass number called “Big Deal.” Written by Thorn, she uses the titular phrase sarcastically in an attempt to deliver a reality check. With an air of frustration, she seems to sing of Watt’s search for answers in the club: “You say you wanna get cured, you wanna turn off your head/Oh and you say it hurts, and you feel unsure/First you doubt yourself and then you doubt her/Big deal, that's the way we all feel.” Everyone goes through trauma in some form or other, the song suggests, what matters is giving one another the space to work through it.\nThe strength of Walking Wounded lies in exactly that. Each Everything But the Girl album has its own style and story, but the one on which Thorn and Watt’s individual gifts shine brightest is the one on which they stripped everything back. They shared their knottiest feelings, created dialogue with skeletal new sounds, and made the record in a much more insular way than they ever had previously. Its timely sonics and emotionally wrought themes spoke as much to teenagers, myself included, as it did the band’s adult contemporaries (Bristol drum ‘n’ bass head Roni Size gave it thumbs up). Walking Wounded remains Thorn and Watt’s biggest-selling album with worldwide sales of 1.3 million. It did the kind of well that prompted U2 to ask them to be their tour support, something they ended up turning down because, well, they needed some space. Thorn and Watt’s relationship had been tied to their career from the very beginning, and it was time to listen to the cries for independence that Walking Wounded so clearly contained. Instead of going on tour, they started a family, and set the wheels in motion for their separate careers to come.\n", "pptitle": ["walk", "wound"]}