{"id": "PF_21", "url": "https://pitchfork.com/reviews/albums/lafawndah-ancestor-boy/", "name": ["Ancestor", "Boy"], "description": ["lafawndah", "music", "proudli", "rootless", "singer", "produc", "work", "labyrinth", "genr", "style", "teem", "trapdoor", "voic", "lith", "contralto", "dust", "warm", "rasp", "give", "song", "sensual", "qualiti", "she", "trickster", "romant", "jungl", "exit", "debut", "ep", "written", "spanish", "translat", "english", "sung", "swahili", "cheeki", "elus", "make", "music", "play", "weari", "pall", "hang", "debut", "album", "ancestor", "boy", "built", "global", "sourc", "strain", "pop", "ambient", "industri", "record", "rich", "resourc", "poor", "spirit", "releas", "lafawndah", "concordia", "imprint", "ancestor", "boy", "intend", "blueprint", "wayward", "artist", "idea", "creat", "home", "orphan", "world", "said", "artist", "dont", "sit", "properli", "do", "thing", "challeng", "obey", "what", "expect", "that", "worthwhil", "goal", "lafawndah", "professor", "x", "hell", "she", "emma", "frost", "lafawndah", "discern", "vision", "aesthet", "shroud", "song", "signifi", "let", "entropi", "wheel", "uniform", "album", "open", "track", "vagu", "statement", "iconoclasm", "know", "knowwhich", "color", "colorth", "wanna", "pen", "narr", "context", "know", "make", "storytel", "cryptic", "best", "gibberish", "worst", "titl", "track", "vagu", "ponder", "church", "marque", "did", "come", "waterdid", "come", "skydid", "come", "mountain", "ask", "talk", "jesu", "columbu", "optimu", "prime", "hard", "care", "abstract", "wouldnt", "frustrat", "mood", "werent", "grave", "selfseri", "product", "polish", "blend", "quak", "bass", "milit", "percuss", "blare", "drone", "shock", "awe", "rare", "doe", "lafawndah", "voic", "consist", "promin", "lead", "composit", "temper", "volatil", "substancia", "siren", "warp", "horn", "swell", "peak", "drop", "away", "lafawndah", "offer", "toothless", "threat", "tell", "got", "encircl", "ask", "synth", "joseph", "quiver", "tension", "pantomim", "danger", "lafawndah", "sing", "peril", "journey", "song", "feel", "harrow", "work", "home", "album", "blip", "color", "tourist", "litedancehal", "track", "take", "jab", "exotic", "lafawndah", "convincingli", "embodi", "latent", "coloni", "underli", "tourism", "speak", "firstperson", "tourist", "make", "casual", "observ", "reek", "unearn", "intimaci", "like", "dress", "braid", "hair", "coo", "treacli", "smug", "song", "ultim", "feel", "like", "catfish", "trophous", "she", "mock", "lowhang", "fruit", "ancestor", "boy", "clear", "precis", "she", "come", "liter", "artist", "perspect", "blandli", "adrift", "tether", "point", "origin", "destin", "island", "declar", "blueprint", "attempt", "pride", "singular", "big", "mood", "littl", "substanc"], "date_published": ["2019-03-27T05:00:00"], "sentiment": 0.05085784313725489, "content": "Lafawndah’s music is proudly rootless. The singer and producer’s works are labyrinths of genre and style that teem with trapdoors. Her voice, a lithe contralto dusted with a warm rasp, gives her songs a sensual quality, but she’s more trickster than romantic. “Jungle Exit,” from her debut EP, was written in Spanish, translated to English, then sung in Swahili. That cheeky elusiveness can make her music seem playful, but a wearying pall hangs over her debut album Ancestor Boy. Built from globally sourced strains of pop, ambient, and industrial, the record is rich in resources and poor in spirit.\nReleased on Lafawndah’s Concordia imprint, Ancestor Boy is intended as a blueprint for wayward artists. “The idea is to create a home for all the orphans of the world,” she has said. “All the artists that don’t sit properly, that are doing things that are challenging, that are not obeying enough of what’s expected of them.” That’s a worthwhile goal, but Lafawndah is no Professor X. Hell, she’s no Emma Frost, either. Lafawndah has no discernible vision or aesthetic: She shrouds songs in signifiers and lets entropy take the wheel.\n“Uniform,” the album’s opening track, is a vague statement of iconoclasm. “I would never know, I would never know/Which color, which color/The one they wanna see me in.” She pens narratives within contexts that only she knows, making her storytelling cryptic at best, and gibberish at worst. The title track is so vague and ponderous it could be a church marquee. “Did he come from the water?/Did he come from the sky?/Did he come from the mountains?” she asks. She could be talking about Jesus or Columbus or Optimus Prime. It’s hard to care.\nThis abstraction wouldn’t be as frustrating if the mood weren’t so grave and self-serious. The production, a polished blend of quaking bass, militant percussion, and blaring drones, is made to shock and awe. It rarely does. Lafawndah’s voice is consistently prominent, leading the compositions along and tempering their volatility. On “Substancia” sirens and warped horns swell to a peak then drop away so Lafawndah can offer toothless threats. “Can’t you tell I got you encircled?” she asks. The synths on “Joseph” quiver with tension, but only pantomime danger. Lafawndah sings of some perilous journey, but the song itself feels about as harrowing as working from home.\nThe album’s one blip of color is “Tourist,” a lite-dancehall track that takes a jab at exoticism. Lafawndah convincingly embodies the latent colonialism that can underlie tourism. Speaking in first-person, her tourist makes casual observations that reek of unearned intimacy. “I like how you dress and how you braid your hair,” she coos with a treacly smugness. The song ultimately feels like a catfish though. Not only is the trop-house she's mocking low-hanging fruit, but throughout Ancestor Boy, it's never clear where precisely she's coming from, literally or artistically. Her perspective is blandly adrift, tethered to neither a point of origin nor a destination. “I am an island,” she declares on “Blueprint,” attempting to find pride in her singularity. Big mood, little substance.\n", "pptitle": ["ancestor", "boy"]}