{"id": "PF_17", "url": "https://pitchfork.com/reviews/albums/strand-of-oaks-eraserland/", "name": ["Eraserland"], "description": ["timothi", "showalt", "decadeplu", "career", "strand", "oak", "teeter", "empir", "belief", "mayb", "line", "art", "life", "tower", "synthinfus", "rock", "anthem", "solemn", "guitarandvoic", "medit", "relay", "experi", "plain", "languag", "adolesc", "small", "indiana", "town", "goshen", "music", "hero", "fear", "selfloath", "messi", "emot", "goulash", "love", "marriag", "rocker", "distil", "henri", "jame", "positionthat", "novel", "broadest", "definit", "person", "direct", "impress", "lifefus", "bold", "shoegaz", "heartlandrock", "aesthet", "lyric", "postur", "modern", "confessionalist", "like", "mount", "eeri", "margo", "price", "contrast", "reflect", "dimens", "showalt", "altern", "contempl", "reclus", "figur", "steep", "craft", "unrepent", "showman", "command", "room", "comed", "bit", "tale", "latenight", "rager", "new", "album", "eraserland", "find", "break", "point", "written", "cloud", "depress", "selfdoubt", "follow", "year", "tour", "success", "breakthrough", "record", "heal", "acknowledg", "followup", "hard", "love", "didnt", "quit", "land", "fan", "way", "winter", "2017", "feel", "deplet", "showalt", "took", "sabbat", "toof", "placesth", "jersey", "shore", "walk", "beach", "medit", "favorit", "album", "listen", "talk", "talk", "spirit", "eden", "he", "said", "liter", "save", "life", "height", "showalt", "existenti", "crisi", "morn", "jacket", "guitarist", "carl", "broemel", "ralli", "bandmat", "bo", "koster", "keyboard", "patrick", "hallahan", "drum", "tom", "blankenship", "bass", "showalt", "new", "suit", "song", "vote", "confid", "prove", "potent", "motiv", "eraserland", "soar", "boom", "hush", "moment", "testament", "skill", "lockstep", "outfit", "season", "player", "navig", "showalt", "emot", "cosmo", "equal", "part", "profession", "empathi", "countri", "star", "jason", "isbel", "lend", "underst", "shred", "singersongwrit", "multiinstrumentalist", "emma", "ruth", "rundl", "add", "eleg", "background", "vocal", "bring", "easygo", "qualiti", "overwrought", "extens", "emot", "turmoil", "instead", "eraserland", "lyric", "constel", "shine", "plain", "profound", "confess", "dont", "feel", "anymor", "line", "open", "weird", "way", "slacker", "excus", "sting", "admiss", "defeat", "song", "portend", "eraserland", "emot", "arc", "anguish", "despond", "cue", "philosoph", "probe", "rebirth", "relay", "stori", "famili", "friend", "idol", "dream", "disclosur", "leav", "littl", "room", "interpret", "capabl", "hand", "feel", "naiv", "sentiment", "radiat", "showalt", "fibrou", "voic", "roadworn", "phrase", "end", "he", "light", "believ", "love", "youll", "outliv", "past", "promis", "forev", "chord", "album", "conclus", "unfold", "sober", "medit", "electrifi", "anthem", "synth", "fuse", "glisten", "electr", "guitar", "ring", "cymbal", "showalt", "prefer", "blend", "celesti", "touchston", "british", "postpunk", "sinewi", "qualiti", "american", "hero", "better", "execut", "final", "fire", "meld", "synth", "guitar", "tone", "cure", "upcountri", "jangl", "tom", "petti", "titl", "track", "swirl", "haze", "bloodi", "valentin", "crescendo", "joy", "divis", "neg", "space", "moon", "land", "refer", "vibey", "narrat", "guitar", "jam", "endless", "boogi", "totem", "influenc", "work", "stack", "atop", "monument", "newli", "refocus", "strand", "oak"], "date_published": ["2019-03-26T05:00:00"], "sentiment": 0.046539748130657206, "content": "Timothy Showalter’s decade-plus career as Strand of Oaks teeters on an empirical belief that maybe there are no lines between art and life at all. His towering, synth-infused rock anthems and solemn guitar-and-voice meditations relay his experience in plain language: his adolescence in the small Indiana town of Goshen, his musical heroes, his fears and self-loathing, the messy emotional goulash of love and marriage. His rocker’s distillation of Henry James’ position—that “A novel is in its broadest definition a personal, a direct impression of life”—fuses a bold shoegaze and heartland-rock aesthetic with the lyrical posture of modern confessionalists like Mount Eerie and Margo Price. The contrast reflects the dimensions of Showalter, alternately a contemplative and reclusive figure steeped in the craft and an unrepentant showman who can command a room with comedic bits and tales of late-night ragers.\nNew album Eraserland finds him at his breaking point. It was written in a cloud of depression and self-doubt, following years of touring on the success of breakthrough record HEAL, and the acknowledgment that its follow-up, Hard Love, didn’t quite land with fans the same way. By winter of 2017, feeling depleted, Showalter took a sabbatical to—of all places—the Jersey Shore. Alone, he walked the beaches and meditated on his favorite albums. Listening to Talk Talk’s Spirit of Eden, he’s said, almost literally saved his life.\nAt the height of Showalter’s existential crisis, My Morning Jacket guitarist Carl Broemel rallied bandmates Bo Koster (keyboards), Patrick Hallahan (drums), and Tom Blankenship (bass) to back Showalter on a new suite of songs, a vote of confidence that proved to be a potent motivator. Eraserland soars in both its booming and hushed moments, a testament to the skills of this lockstep outfit. These seasoned players navigate Showalter’s emotional cosmos with equal parts professionalism and empathy. Country star Jason Isbell lends his understated shredding, while singer-songwriter and multi-instrumentalist Emma Ruth Rundle adds elegant background vocals. Together they bring an easygoing quality to what could have been an overwrought extension of emotional turmoil.\nInstead, Eraserland’s lyrical constellations shine in plain, profound confessions. “I don’t feel it anymore,” the first line of opener “Weird Ways,” is less a slacker’s excuse than a stinging admission of defeat. The song portends Eraserland’s emotional arc: Anguish and despondence cues philosophical probing and rebirth, relayed through stories about family, friends, idols, and dreams. Such disclosure leaves little room for interpretation and, in less capable hands, might feel naive. Here, each sentiment radiates through Showalter’s fibrous voice and road-worn phrasing. By the end, he’s found some light. “If you believe you can be loved, you'll outlive your past,” he promises on “Forever Chords,” the album’s conclusion.\nAll this unfolds in sober meditations and electrified anthems where synths fuse with glistening electric guitar and ringing cymbals. Showalter’s preference for blending the celestial touchstones of British post-punk with the sinewy qualities of his American heroes has never been better executed than it is here: “Final Fires” melds the synth and guitar tones of the Cure with the upcountry jangle of Tom Petty, while the title track swirls in a haze of My Bloody Valentine’s crescendos and Joy Division's negative space. “Moon Landing” references the vibey narration and guitar jam of Endless Boogie. Somehow this totem of influences works, stacked one atop another in a monument to the newly refocused Strand of Oaks.\n", "pptitle": ["eraserland"]}