{"id": "PF_37", "url": "https://pitchfork.com/reviews/albums/karen-o-danger-mouse-lux-prima/", "name": ["Lux", "Prima"], "description": ["year", "danger", "mous", "work", "parquet", "court", "run", "jewel", "karen", "os", "recent", "cv", "includ", "soundtrack", "kid", "film", "wild", "thing", "industri", "cover", "led", "zeppelin", "immigr", "song", "compani", "trent", "reznor", "atticu", "ross", "serial", "collabor", "differ", "thing", "nearimposs", "accur", "predict", "sound", "like", "new", "record", "lux", "prima", "appear", "revel", "possibl", "blank", "slate", "o", "said", "make", "lux", "prima", "creat", "blurri", "place", "place", "youv", "danger", "mous", "talk", "look", "place", "sound", "listen", "result", "imagin", "place", "pari", "1969", "detroit", "1964", "bristol", "1995", "blend", "serg", "gainsbourg", "orchestr", "grace", "motown", "pop", "hustl", "pack", "dusti", "sound", "90", "trip", "hop", "time", "result", "sublim", "lux", "prima", "open", "track", "arriv", "swell", "drum", "synth", "harmoni", "glide", "wash", "beatif", "chord", "chang", "redeem", "carri", "theatric", "tang", "spaghetti", "western", "nox", "lumina", "close", "album", "fug", "sour", "summer", "love", "vibe", "album", "sound", "spars", "allow", "listen", "savor", "interact", "element", "help", "karen", "o", "immacul", "voic", "album", "highlight", "woman", "featur", "greatest", "vocal", "astound", "mixtur", "power", "control", "agil", "read", "like", "forc", "fuckyou", "tri", "mess", "time", "vocal", "various", "dramat", "ministri", "aquat", "drown", "melanchol", "nox", "lumina", "versatil", "vocal", "perform", "grace", "recent", "pop", "album", "lux", "prima", "sound", "lush", "fact", "time", "wish", "o", "mous", "worri", "convent", "song", "structur", "album", "weak", "spot", "chorus", "whichturn", "light", "woman", "asidefeel", "tack", "hero", "suddenli", "rememb", "song", "convent", "need", "chorus", "act", "accordingli", "karen", "o", "write", "killer", "hookyeah", "yeah", "yeah", "zero", "map", "prove", "long", "time", "agobut", "lacklust", "hook", "lux", "prima", "ministri", "drown", "sit", "like", "poorlydrawn", "mustach", "otherwiseimmacul", "portrait", "accordingli", "lux", "prima", "work", "better", "journey", "destin", "sound", "better", "go", "fast", "charmingli", "anachronist", "sound", "odd", "sharpli", "engin", "hustl", "modern", "pop", "world", "karen", "o", "danger", "mous", "dreamt", "vividli", "imagin", "world", "pleasur", "lost", "littl", "freedom", "divin"], "date_published": ["2019-03-18T05:00:00"], "sentiment": 0.15090831787260361, "content": "In the last five years alone, Danger Mouse has worked with everyone from Parquet Courts to Run the Jewels, while Karen O’s recent CV includes the soundtrack to kids film Where the Wild Things Are and an industrial cover of Led Zeppelin’s “Immigrant Song” in the company of Trent Reznor and Atticus Ross. The two of them have become serial collaborators, and they have done so many different things that it is near-impossible to accurately predict what they might sound like together.\nOn their new record Lux Prima, they appear to revel in the possibility of a blank slate. O said of making Lux Prima that “when you create from a blurry place you can go places further than you’ve ever been,” while Danger Mouse talked of “looking for a place rather than a sound.” Listening to the results, I imagine that place to be Paris 1969, Detroit 1964 or Bristol 1995, a blend of Serge Gainsbourg’s orchestral grace, Motown pop hustle, and the packed and dusty sound of ‘90s trip hop.\nAt times, the results are sublime. “Lux Prima,” the opening track, arrives on a swell of drums and synth harmonies then glides out on a wash of beatific chord changes. “Redeemer” carries the theatrical tang of spaghetti Westerns, and “Nox Lumina” closes the album in the fug of soured summer of love vibes. The album’s sound is sparse, allowing the listener to savor the interaction between elements.\nIt helps that Karen O is in immaculate voice throughout. Album highlight “Woman” features one of her greatest vocals, an astounding mixture of power, control, and agility that reads like a forceful fuck-you to anyone who has ever tried to mess with her. At other times her vocals are variously dramatic (“Ministry”), aquatic (“Drown”), and melancholic (“Nox Lumina”), in what must be one of the most versatile vocal performances to grace a recent pop album.\nLux Prima sounds so lush, in fact, that at times you wish that O and the Mouse had worried less about conventional song structure. The album’s weak spots are its choruses which—“Turn the Light” and “Woman” aside—feel tacked on, as if our heroes suddenly remembered that songs conventionally need choruses and acted accordingly. Karen O can write a killer hook—Yeah Yeah Yeahs’ “Zero” and “Maps” proved that a long time ago—but the lackluster hooks on “Lux Prima,” “Ministry,” and “Drown” sit like a poorly-drawn mustache on an otherwise-immaculate portrait.\nAccordingly, Lux Prima works better as a journey than a destination. It never sounds better than when going nowhere fast, its charmingly anachronistic sound at odds with the sharply engineered hustle of the modern pop world. Karen O and Danger Mouse have dreamt up a vividly imagined world, and it’s a pleasure to get lost in it. With a little more freedom, it could have been divine.\n", "pptitle": ["lux", "prima"]}