{"id": "PF_85", "url": "https://pitchfork.com/reviews/albums/solange-when-i-get-home/", "name": ["When", "I", "Get", "Home"], "description": ["t", "magazin", "interview", "solang", "publish", "fall", "writer", "ayana", "mathi", "describ", "make", "new", "album", "take", "singer", "kind", "houston", "mind", "citi", "figur", "heavili", "knowl", "famili", "mytholog", "birthplac", "solang", "sister", "time", "interview", "didnt", "know", "record", "home", "indic", "album", "return", "music", "accompani", "short", "film", "reconstruct", "houston", "solang", "mind", "liter", "objectif", "past", "futur", "memori", "citi", "ephemer", "mental", "grid", "seesaw", "bass", "boom", "phantom", "slab", "woodgrain", "candypaint", "local", "tradit", "synthes", "sampl", "ricochet", "tall", "offic", "build", "downtown", "houston", "reverber", "heaven", "black", "cowboy", "gallop", "duskth", "clip", "hoov", "drumbeat", "space", "refus", "treasur", "snatch", "vocal", "hometown", "rapper", "devin", "dude", "scarfac", "float", "like", "murmur", "pass", "car", "window", "year", "releas", "soulbar", "opu", "seat", "tabl", "solang", "ditch", "tradit", "song", "structur", "worldweari", "lyric", "sonic", "themat", "ambigu", "record", "feel", "freer", "burden", "white", "gaze", "houston", "beat", "heart", "core", "like", "new", "orlean", "puls", "seat", "music", "spectral", "freeassoci", "qualiti", "suggest", "idea", "home", "root", "solang", "offer", "fundament", "lesson", "leav", "home", "isnt", "possess", "live", "understand", "trust", "memori", "solang", "give", "music", "motion", "slide", "houston", "mind", "repeat", "refrain", "reinforc", "slipperi", "recal", "saw", "thing", "imaginedth", "imagin", "music", "motion", "hard", "pin", "obliqu", "doe", "automat", "signific", "instead", "like", "jazz", "drone", "music", "engag", "listen", "instig", "feel", "solang", "doesnt", "offer", "clear", "thesi", "like", "seat", "tabl", "onu", "fall", "listen", "close", "make", "mean", "liber", "creativ", "impuls", "particularli", "pop", "star", "wide", "consid", "auteur", "solang", "music", "collaboratorsfor", "worth", "nearli", "men", "asid", "abra", "cassieduck", "weav", "variou", "time", "signatur", "buri", "easter", "egg", "beneath", "bold", "key", "moog", "magic", "textur", "drum", "line", "embellish", "omnipres", "low", "end", "sampl", "background", "vocal", "addit", "personnel", "credit", "peopl", "repres", "houston", "past", "present", "futur", "phylicia", "rashad", "poet", "pat", "parker", "solang", "young", "son", "julez", "smith", "ii", "product", "credit", "interlud", "intent", "home", "exploratori", "kind", "glossi", "melodi", "cliqu", "way", "rearrang", "remnant", "album", "solo", "star", "releas", "teen", "pop", "day", "pharrel", "king", "sheen", "show", "signatur", "fourcount", "intro", "sound", "rain", "song", "perfectli", "channel", "kitschi", "pixel", "optim", "late", "90searli", "aught", "futur", "bring", "toolkit", "stapl", "tightli", "wound", "drum", "syncop", "piano", "almeda", "earli", "fanfavorit", "unexpect", "featur", "babyvo", "playboi", "carti", "rap", "diamond", "shine", "dark", "track", "solang", "herald", "black", "ownership", "houston", "track", "hint", "time", "solang", "recent", "spent", "jamaica", "binz", "wallslapp", "waistwind", "bootypopp", "airi", "threepart", "harmoni", "true", "call", "card", "cover", "dirti", "projector", "still", "ascend", "dens", "arpeggi", "basslin", "way", "play", "backandforth", "toast", "solang", "thedream", "echo", "incant", "sister", "nanci", "sundown", "wind", "chimesi", "just", "wanna", "wake", "cp", "time", "solang", "frolick", "use", "freeform", "templat", "aspir", "endlessli", "uplift", "magic", "stevi", "wonder", "psychedel", "pleasur", "chop", "screw", "music", "spiritu", "jazz", "alic", "coltran", "arkestra", "sun", "ra", "chief", "collabor", "john", "carrol", "kirbi", "solo", "music", "describ", "new", "age", "stand", "corner", "young", "new", "york", "citi", "jazz", "group", "provid", "sublim", "moment", "drama", "tensiona", "perfect", "templat", "gestur", "postmodern", "kate", "bushesqu", "choreographi", "solang", "prefer", "home", "particularli", "beauti", "ambient", "piec", "that", "unencumb", "emot", "catharsi", "seat", "tablebut", "miss", "palpabl", "thesi", "statement", "fourteen", "album", "19", "track", "clock", "minut", "patchwork", "effect", "suggest", "streamofconsci", "bricolag", "say", "tierra", "whack", "ideal", "breviti", "she", "got", "lot", "idea", "im", "left", "wonder", "album", "tell", "aesthet", "practic", "despit", "titl", "interlud", "intent", "doesnt", "provid", "clue", "need", "direct", "matter", "seat", "tabl", "felt", "urgent", "solang", "unhurri", "album", "reward", "repetit", "listen", "execut", "repetit", "cue", "medit", "state", "code", "saw", "thing", "imagin", "thing", "imagin", "sing", "open", "continu", "cliqu", "time", "switch", "singl", "phrase", "repetit", "almeda", "list", "pride", "brown", "skin", "brown", "face", "black", "skin", "black", "braid", "album", "half", "mood", "dream", "state", "reset", "spiritu", "tradit", "use", "repeat", "mantra", "prayer", "invit", "awar", "presenc", "way", "invok", "past", "alter", "futur", "design", "principl", "teach", "repetit", "commun", "uniti", "cohesionent", "skin", "logo", "solang", "trade", "admir", "vers", "coo", "gucci", "mane", "conjur", "endless", "monogram", "interlock", "gs", "song", "childlik", "love", "macho", "rapper", "soften", "nurseri", "rhymeflow", "sound", "like", "actual", "nurseri", "rhyme", "repetit", "solang", "resurrect", "timeless", "formless", "houston", "mind", "use", "devic", "extens", "compuls", "tri", "rememb", "tri", "harder", "forget", "tri", "harder", "situat", "tradit", "wider", "context", "black", "music", "cultur", "america"], "date_published": ["2019-03-05T06:00:00"], "sentiment": 0.05638443256090314, "content": "In a T Magazine interview with Solange published last fall, writer Ayana Mathis described the making of the new album as taking the singer back to “a kind of Houston of the mind.” It’s a city that figures heavily in Knowles family mythology as the birthplace of Solange and her sister. At the time of the interview, we didn’t know the name of the record, When I Get Home, which indicates that this is an album about return. Now we have music and an accompanying short film that reconstructs the Houston of Solange’s mind.\nIt’s not literal objectification of the past so much as a future memory of the city, an ephemeral mental grid. See-sawing bass booms from phantom slabs, wood-grained and candy-painted per local tradition. Synthesizers and samples ricochet off the tall, empty office buildings of downtown Houston, reverberating to the heavens. Black cowboys gallop through the dusk—the clip of hooves a drumbeat. Space refuse is treasure. And snatches of vocals from hometown rappers Devin the Dude and Scarface float like murmurs from passing car windows.\nThree years after releasing the soul-baring opus A Seat at the Table, Solange has ditched traditional song structure and world-weary lyrics for a sonically and thematically ambiguous record that feels freer, and less burdened by the white gaze. Although Houston is the beating heart at its core, much like New Orleans pulsed through A Seat, the music’s spectral, free-associative quality suggests that the idea of “home” is less rooted. Solange offers a fundamental lesson of those who leave: Home isn’t something you can possess, it lives on without you. Perhaps she also understands that we can’t trust our memories and so Solange gives her music motion. We slide into this “Houston of the mind,” on a repeated refrain that reinforces the slipperiness of recall: “I saw things… I imagined/Things… I imagined.”\nThe music is so in motion it’s hard to pin down. Its obliqueness does not give it automatic significance; instead, like in jazz or drone music, engaged listening instigates feeling. Because Solange doesn’t offer a clear thesis like on A Seat at the Table, the onus falls on the listener to get close and make their own meaning. That can be a liberating creative impulse, particularly for a pop star who is widely considered an auteur. Solange and her musical collaborators—for what it’s worth, nearly all men aside from Abra and Cassie—duck and weave through various time signatures, burying Easter Eggs beneath bold keys, Moog magic, and textured drum lines that embellish the omnipresent low end. There are samples, background vocals, and additional personnel credits to people representing Houston’s past, present, and future: from Phylicia Rashad and the poet Pat Parker, to Solange’s young son Julez Smith II, who has a production credit on the interlude “Nothing Without Intention.”\nWhen I Get Home is exploratory, but still kind of glossy. The melodies on “Down With the Clique” and “Way to the Show” could be rearranged remnants from her first album Solo Star, released in her teen pop days. Pharrell, the king of sheen, shows up with his signature four-count intro on “Sound of Rain,” a song that perfectly channels the kitschy, pixelated optimism of late ’90s/early aughts futurism. He also brings his toolkit staples of tightly wound drums and syncopated piano for “Almeda,” an early fan-favorite because of an unexpected feature by a baby-voiced Playboi Carti who raps about diamonds shining through the darkness on a track where Solange heralds black ownership. We’re in Houston, so only one track hints at the time Solange recently spent in Jamaica. “Binz” is a wall-slapper, waist-winder, booty-popper. The airy three-part harmonies that have been her true calling card since covering the Dirty Projectors’ “Stillness Is the Move” ascend over a dense arpeggiated bassline, and then give way to playful back-and-forth toasting between Solange and The-Dream that echoes the incantations of Sister Nancy: “Sundown, wind chimes/I just wanna wake up on C.P. time.”\nSolange is frolicking here, using a freeform template that aspires to the endlessly uplifting magic of Stevie Wonder, the psychedelic pleasures of chopped and screwed music, or the spiritual jazz of Alice Coltrane and the Arkestra of Sun Ra. One of her chief collaborators throughout is John Carroll Kirby, whose solo music could only be described as New Age. Standing on the Corner, a young New York City jazz group, provide some sublime moments of drama and tension—a perfect template for the gestural, post-modern, Kate Bush-esque choreography that Solange prefers.\nWhen I Get Home is particularly beautiful as an ambient piece that’s unencumbered by the emotional catharsis of A Seat at the Table—but it is missing a palpable thesis statement. Fourteen of the album’s 19 tracks clock in at under three minutes, but the patchwork effect suggests a more stream-of-consciousness bricolage than, say, Tierra Whack’s idea-led brevity. She’s got a lot of ideas, but I’m still left wondering what this album can tell us about her aesthetic practice. (Despite its title, the interlude “Nothing Without Intention” doesn’t provide a clue.) But this need for direction only matters because A Seat at the Table felt so urgent.\nHere, Solange is unhurried. The album rewards repetition, in listening and in execution. Repetition can cue a meditative state; it can also be code. “I saw things I imagined, things I imagined,” she sings on the opener. “We were down with you, down with you,” she continues on “Down With the Clique.” And by the time she switches up the single phrase repetition on “Almeda,” listing with pride, “brown skin, brown face, black skin, black braids,” the album is half over and the mood, the dream state, resets.\nSome spiritual traditions use repeated mantras or prayers to invite awareness and presence, others as a way to invoke the past or alter the future. Design principles teach that repetition communicates unity and cohesion—enter “My Skin My Logo,” where Solange trades admiring verses with a cooing Gucci Mane, whose name conjures an endless monogram of interlocking Gs. The song itself is childlike and loving; the macho rapper softening his nursery rhyme-flow for something that sounds like an actual nursery rhyme. It’s through repetition that Solange resurrects a timeless, formless Houston of her mind. She uses the device extensively and almost compulsively, trying to remember, trying harder not to forget, and trying even harder to situate these traditions within a wider context of black music and culture in America.\n", "pptitle": ["home"]}