{"id": "PF_53", "url": "https://pitchfork.com/reviews/albums/kari-faux-cry-4-help-ep/", "name": ["Cry", "4", "Help", "EP"], "description": ["kari", "faux", "wasnt", "introspect", "arkansa", "nativ", "popular", "grew", "immens", "2014", "releas", "girlbossi", "singl", "small", "talk", "song", "way", "soundtrack", "issa", "rae", "hit", "televis", "seri", "insecur", "remix", "childish", "gambino", "year", "releas", "primari", "ep", "rapper", "singer", "take", "intim", "approach", "kari", "4", "help", "confront", "trauma", "heal", "outlet", "upbeat", "braggadoci", "anthem", "ep", "lead", "singl", "leav", "explor", "kari", "lust", "isol", "coupl", "disdain", "peopl", "simpli", "want", "wast", "time", "product", "draw", "inspir", "1970", "soul", "show", "new", "small", "talk", "bold", "declar", "confid", "fill", "cellphon", "chirp", "808", "kari", "use", "live", "drum", "hazi", "synth", "work", "carri", "alto", "croon", "think", "damn", "man", "friend", "guess", "love", "just", "pretend", "resound", "yearn", "need", "simpl", "human", "companionship", "equal", "present", "kari", "remain", "just", "unguard", "medic", "woozi", "song", "built", "slow", "heavi", "drumbeat", "song", "hook", "spell", "intens", "high", "emot", "lowsher", "againsh", "rollercoasterin", "sing", "voic", "lag", "beat", "give", "play", "wink", "open", "line", "dont", "wanna", "medic", "quickli", "follow", "second", "vers", "idea", "drink", "away", "pain", "speed", "doesnt", "help", "sustain", "life", "she", "tri", "lead", "latch", "key", "ep", "close", "song", "kari", "cut", "chase", "longer", "croon", "revert", "vivid", "storytel", "monoton", "resent", "voicesepar", "record", "song", "number", "im", "poppin", "thyroid", "pill", "balanc", "levelspreparin", "motherhood", "lord", "knew", "wasnt", "readyabout", "week", "later", "babi", "miscarri", "kari", "unpack", "load", "emot", "turmoil", "give", "listen", "chill", "look", "trauma", "deliv", "unflinch", "attent", "song", "peel", "layer", "pain", "kari", "strongli", "suggest", "intern", "wound", "dont", "deal", "one", "continu", "haunt", "lie", "dark", "moodi", "ep", "silver", "line", "4", "help", "wakeup", "ahead", "face", "hurt", "thing", "life", "believ", "reflect", "kari", "extens", "growth", "artist", "woman", "experienc", "life", "challeng"], "date_published": ["2019-03-16T05:00:00"], "sentiment": 0.07213976499690786, "content": "Kari Faux wasn’t always this introspective. The Arkansas native’s popularity grew immensely back in 2014 when she released the girl-bossy single “No Small Talk”; the song even made its way to the soundtrack for Issa Rae’s hit television series “Insecure” after being remixed by Childish Gambino. But a year after the release of her PRIMARY EP, the rapper and singer takes a more intimate approach. For Kari, CRY 4 HELP is about confronting trauma and healing, rather than an outlet for upbeat, braggadocious anthems.\nThe EP’s lead single, “Leave Me Alone,” explores Kari’s lust for isolation coupled with a disdain for people who simply want to waste her time. Over production that draws inspiration from 1970’s soul, she shows us a new side of herself. While “No Small Talk” was a bold declaration of confidence filled with cell-phone chirps and 808s, Kari now uses live drums and hazy synths working together to carry her alto croons. “Thinking ‘Damn man, where are my friends?’ I guess that love is just for pretend,” she resounds. Though she yearns to be alone, the need for simple human companionship is equally as present.\nKari remains just as unguarded on “Medicated,” a woozy song built on a slow, heavy drumbeat. The song’s hook spells out her intense highs and emotional lows—“Here we go again/She’s rollercoasterin,” she sings. Her voice lags behind the beat, giving a playful wink to the opening line, “I don’t wanna be medicated.” She quickly follows up in the second verse with the idea that drinking away the pain may be much more her speed, though it doesn’t help with sustaining the life she’s trying to lead.\nOn “Latch Key,” the EP’s closing song, Kari cuts to the chase. No longer crooning, she reverts to vivid storytelling in a monotonous yet resentful voice—separating this record from the other songful numbers. “All the while, I’m poppin’ thyroid pills to balance out my levels/Preparin’ for motherhood, Lord knew I wasn’t ready/About two weeks later, the baby had miscarried.” As Kari unpacks her load of emotional turmoil, she gives listeners a chilling look into her trauma and delivers it with unflinching attention to detail.\nWith each song peeling back another layer of her pain, Kari strongly suggests that the internal wounds you don’t deal with are the ones that will continue to haunt you. But therein lies this dark, moody EP’s silver lining. CRY 4 HELP is not only a wake-up call to go ahead and face the hurtful things in your life that you may believe you can’t, but also a reflection of Kari’s extensive growth as an artist and as a woman who has experienced life’s many challenges.\n", "pptitle": ["4", "help", "ep"]}