{"id": "PF_33", "url": "https://pitchfork.com/reviews/albums/laurel-halo-dj-kicks/", "name": ["DJ-Kicks"], "description": ["laurel", "halo", "spent", "career", "warili", "circl", "dancefloor", "year", "middl", "decad", "threw", "club", "music", "gusto", "thrill", "effect", "2013", "chanc", "rain", "remain", "underr", "slab", "avanttechno", "broken", "beat", "rumbl", "subbass", "2015", "situ", "sound", "ahead", "time", "dust", "raw", "silk", "uncut", "wood", "favor", "abstract", "rhythm", "diffus", "atmospher", "pois", "ambient", "music", "microton", "composit", "free", "improv", "popadjac", "vocal", "drape", "loos", "havent", "caught", "club", "set", "know", "halo", "topnotch", "dj", "facil", "sort", "forc", "rhythm", "absent", "recent", "album", "chief", "skill", "nonstop", "negoti", "peaktim", "thrill", "thorniest", "rhythmic", "thicketsan", "onagain", "offagain", "dtent", "grip", "geopolit", "drama", "that", "precis", "doe", "djkick", "commerci", "mix", "album", "aton", "piano", "open", "sessionhalo", "public", "art", "exclus", "setar", "fakeout", "equival", "dryic", "fog", "waft", "floor", "club", "door", "open", "minut", "plung", "headfirst", "chug", "ebminspir", "beat", "kick", "unbroken", "stretch", "shapeshift", "groov", "wont", "let", "save", "brief", "breather", "hour", "seamless", "isnt", "predict", "great", "pleasur", "halo", "mix", "switchback", "path", "earli", "stretch", "dank", "electro", "clammi", "catacomb", "wall", "swiftli", "give", "way", "warm", "flicker", "chord", "spiral", "synth", "arpeggio", "sleek", "brandnew", "corkscrew", "long", "gauzi", "passag", "erupt", "gutpunch", "bass", "music", "extend", "foray", "detroitinspir", "techno", "trepanationdril", "precis", "flip", "beatless", "stockhausendoeslooneytun", "interlud", "pave", "way", "newli", "focus", "son", "clave", "rhythm", "hurtl", "murk", "overarch", "ebbandflow", "hold", "sway", "halo", "toy", "momentum", "mix", "period", "tug", "mbiu", "strip", "wad", "ball", "smooth", "havent", "name", "individu", "song", "that", "halo", "style", "mix", "way", "blur", "differ", "track", "deemphas", "uniqu", "fold", "aesthet", "that", "that", "case", "great", "dj", "especi", "true", "halo", "product", "distinguish", "certain", "smeari", "like", "charcoal", "draw", "smudg", "elbow", "hazi", "qualiti", "distinguish", "djkick", "tend", "choos", "tune", "brim", "shaker", "brittl", "hihat", "808", "cowbel", "shimmeri", "trebli", "sound", "kick", "drum", "sturdi", "slipperi", "tendenc", "stagger", "downbeat", "hurtl", "forward", "drunkenli", "determin", "except", "final", "cut", "temptat", "1989", "track", "earli", "project", "detroit", "techno", "icon", "jeff", "mill", "pummel", "away", "industri", "relentless", "like", "fellow", "detroit", "veteran", "blake", "baxter", "1991", "cut", "funki", "world", "except", "present", "larg", "set", "happen", "backtobas", "deton", "ensu", "psychedel", "firework", "worth", "mill", "baxter", "song", "track", "arent", "recent", "vintag", "probabl", "coincid", "halo", "song", "hodg", "collabor", "light", "built", "sampl", "sound", "like", "selfhelp", "audiobook", "deliv", "melliflu", "tone", "verg", "asmral", "good", "thing", "come", "woman", "voic", "repeat", "dulcet", "whisper", "haltingli", "inton", "pull", "bad", "mood", "sampl", "pure", "halo", "wryli", "sardon", "slyli", "effect", "encapsul", "what", "great", "mix", "bodi", "music", "headi", "dancer", "triumph", "danc", "music", "trippiest", "control", "weird", "lie", "real", "liber"], "date_published": ["2019-03-23T05:00:00"], "sentiment": 0.1839131503417217, "content": "Laurel Halo has spent much of her career warily circling the dancefloor. For a few years in the middle of this decade, she threw herself into club music with gusto, to thrilling effect: 2013’s Chance of Rain remains an underrated slab of avant-techno, while the broken beats and rumbling sub-bass of 2015’s In Situ still sound ahead of their time. But Dust and Raw Silk Uncut Wood favored more abstracted rhythms and diffuse atmospheres, poised somewhere between ambient music, microtonal composition, and free improv, with pop-adjacent vocals draped loosely over the top.\nWhat those who haven’t caught one of her club sets might not know is that Halo is also a top-notch DJ, with a facility for the sorts of forceful rhythms absent from her recent albums. Chief among her skills: A nonstop negotiation between peak-time thrills and the thorniest rhythmic thickets—an on-again, off-again détente as gripping as any geopolitical drama. That’s precisely what she does on DJ-Kicks, her first commercial mix album. The atonal pianos that open the session—Halo’s own “Public Art,” exclusive to this set—are a fakeout, the equivalent of dry-ice fog wafting over an empty floor as the club’s doors open. Not a minute in, she plunges headfirst into a chugging, EBM-inspired beat, kicking off an unbroken stretch of shapeshifting grooves that won’t let up, save for one brief breather, for the next hour.\nBut seamless isn’t the same as predictable, and one of the great pleasures of Halo’s mix is its switchbacking path. An early stretch of dank electro, clammy as catacomb walls, swiftly gives way to warm, flickering chords and spiraling synth arpeggios, sleek as a brand-new corkscrew. A long, gauzy passage erupts into gut-punching bass music; an extended foray into Detroit-inspired techno, all trepanation-drill precision, flips into a beatless, Stockhausen-does-Looney-Tunes interlude, which then paves the way for a newly focused son clave rhythm hurtling through the murk. That overarching ebb-and-flow holds sway throughout. Halo toys with the momentum of the mix as though periodically tugging at a Möbius strip, wadding it into a ball, and then smoothing it out again.\nIf I haven’t named many individual songs here, that’s in part because Halo’s style of mixing has a way of blurring the differences between tracks, of deemphasizing their uniqueness and folding them into an aesthetic that’s hers alone. That’s the case for many great DJs, but it seems especially true of Halo. Her own productions are distinguished by a certain smeariness, like a charcoal drawing smudged by an elbow, and the same hazy qualities distinguish DJ-Kicks. She tends to choose tunes that brim with shakers, brittle hi-hats, 808 cowbells, and other shimmery, trebly sounds; her kick drums are sturdy but slippery, with a tendency to stagger around the downbeat or hurtle forward, as though drunkenly determined.\nOne exception: Final Cut’s “Temptation,” a 1989 track from an early project of Detroit techno icon Jeff Mills, which pummels away with almost industrial relentlessness. But that, much like fellow Detroit veteran Blake Baxter’s 1991 cut “Funky World,” is an exception, present largely to set up everything that happens around it: a back-to-basics detonator for the ensuing psychedelic fireworks. (For what it’s worth, Mills’ and Baxter’s songs are among the very few tracks here that aren’t of recent vintage.)\nIt’s probably not a coincidence that one of Halo’s own songs, the Hodge collaboration “The Light Within You,” is built around a sample of what sounds like a self-help audiobook, delivered in mellifluous tones that verge on ASMR—“All good things come to me,” a woman’s voice repeats in a dulcet whisper; then, haltingly, she intones, “Pulling out of a bad mood.” These samples are pure Halo, wryly sardonic but also slyly effective, and they encapsulate what’s so great about the mix. Body music for heady dancers, this is a triumph of dance music at its trippiest, and in its controlled weirdness lies real liberation.\n", "pptitle": ["djkick"]}