{"id": "PF_45", "url": "https://pitchfork.com/reviews/albums/chief-keef-zaytoven-glotoven/", "name": ["GloToven"], "description": ["chief", "keef", "didnt", "know", "tape", "2017", "project", "2018", "cap", "januari", "seventh", "instal", "leek", "seri", "despit", "activ", "roughli", "project", "do", "weird", "interest", "feel", "like", "peopl", "actual", "pay", "attent", "way", "draw", "attent", "entir", "tape", "zaytoven", "virtuos", "trap", "pianist", "brought", "soul", "verv", "great", "rapper", "catalog", "glotoven", "12track", "collabor", "effort", "find", "chief", "keef", "tinker", "song", "week", "ago", "zaytoven", "play", "tini", "desk", "concert", "futur", "noshow", "plan", "set", "featur", "coupl", "breathtak", "song", "rapper", "band", "zay", "sensat", "stranger", "format", "have", "accompani", "gucci", "mane", "comeback", "tour", "2016", "focu", "empow", "vers", "smaller", "space", "song", "intim", "breath", "chord", "linger", "confound", "youtub", "comment", "wrote", "zayl", "set", "crazi", "just", "hear", "trap", "music", "turn", "contemporari", "jazz", "chang", "perform", "style", "transform", "adapt", "zaytoven", "play", "hallmark", "he", "turn", "futur", "blue", "singer", "usher", "man", "half", "age", "keef", "interpret", "zay", "product", "differ", "maestro", "previou", "partner", "except", "fast", "kind", "beast", "mode", "real", "sister", "doesnt", "emot", "warm", "bed", "produc", "masterli", "keystrok", "lurch", "zay", "busiest", "kingmak", "process", "way", "gucci", "doe", "start", "taper", "bark", "melodi", "settl", "just", "shimmer", "superb", "set", "zay", "beat", "allow", "product", "speak", "nearli", "doe", "glotoven", "find", "keef", "entir", "differ", "mode", "octob", "dead", "3", "keep", "seri", "rap", "nois", "music", "larg", "amelod", "bar", "erupt", "boom", "product", "vers", "sit", "way", "mix", "nearli", "cacophon", "zaytoven", "establish", "term", "far", "simpatico", "perfectli", "measur", "suppress", "sound", "cushion", "crystallin", "gleam", "spi", "kid", "bounc", "sneez", "keef", "inton", "flow", "perfectli", "phase", "godfath", "mumbl", "keef", "continu", "push", "new", "sound", "expand", "scope", "music", "opportun", "young", "nigga", "grew", "wanna", "meyou", "act", "like", "bitch", "know", "rap", "knowingli", "defiantli", "spi", "kid", "glotoven", "constantli", "chang", "shape", "voic", "fiddl", "composit", "keef", "far", "postform", "adlib", "acolyt", "like", "playboi", "carti", "song", "clear", "idea", "laid", "perform", "deliber", "littl", "rhyme", "reason", "songcraft", "keef", "feel", "great", "instinct", "3rd", "person", "singl", "rambl", "vers", "flow", "float", "wind", "tunnel", "sound", "zaytoven", "starter", "kit", "half", "f", "opp", "said", "just", "wordless", "autotun", "warbl", "buoy", "zaytoven", "oscil", "key", "maverick", "keef", "turn", "tender", "arrang", "fit", "thedream", "petti", "antiballad", "paramour", "nag", "cheat", "he", "definit", "do", "isnt", "realli", "keef", "natur", "sentiment", "zaytoven", "way", "get", "hardest", "rapper", "presenc", "fallen", "love", "one", "loom", "peripheri", "tape", "goe", "aint", "got", "choic", "shit", "dead", "partner", "rap", "earli", "wanna", "bring", "brother", "know", "aint", "gon", "happen", "accept", "aint", "gonna", "happen", "call", "fredo", "santana", "anthropomorph", "gold", "star", "cover", "doubl", "cup", "cross", "eye", "like", "homag", "late", "fredo", "appear", "promo", "footag", "glotoven", "keef", "bang", "tune", "babi", "grand", "dub", "new", "beethoven", "piano", "chord", "swell", "glotoven", "chief", "keef", "continu", "expand", "legaci", "sake", "sake", "he", "lost"], "date_published": ["2019-03-20T05:00:00"], "sentiment": 0.1446582282451848, "content": "Chief Keef, if you didn’t know, put out five tapes in 2017, nine projects in 2018, all capped this January by the seventh installment of his The Leek series. Sometimes, despite all that activity, and roughly one in every three of those projects doing something weird or interesting, it feels like very few people are actually paying attention. One way to draw such attention is to do an entire tape with Zaytoven, the virtuosic trap pianist who has brought soul and verve to many a great rapper’s catalogs. GloToven, a 12-track collaborative effort, finds Chief Keef once again tinkering with what his songs can be.\nA few weeks ago, Zaytoven played his own Tiny Desk Concert when Future no-showed a planned set featuring a couple of their most breathtaking songs. With no rapper in front of him and a band behind him, Zay was sensational. He was no stranger to the format, having accompanied Gucci Mane there during his comeback tour in 2016, but being the focus seemed to empower him. Without verses, in a smaller space, the songs were even more intimate; they breathed, each chord lingering. One confounded YouTube commenter wrote of the Zay-led set, “It’s crazy just hearing this trap music turn into contemporary jazz with a change of performance style.” The transformative, adaptiveness of Zaytoven’s playing has become a hallmark of his: He’s turned Future into a blues singer and Usher into a man half his age.\nKeef interprets Zay’s production differently than any of the maestro’s previous partners (with the exception of “Fast,” which is of a kind with Beast Mode’s “Real Sisters”). He doesn’t emote into the warm beds of the producer’s masterly keystrokes. He can’t lurch through Zay’s busiest king-making processions the way Gucci does, so he has started to taper his barked melodies so they settle just above the shimmers of a superb set of Zay beats, allowing the production to speak nearly as much as he does.\nGloToven finds Keef in an entirely different mode than last October’s Back From the Dead 3, which, in keeping with that series, was rap as noise music, his largely amelodic bars erupting through booming productions, his verses sitting way up in the mix and nearly cacophonous. With Zaytoven establishing the terms, he is far more simpatico; perfectly measured and never suppressing the sounds cushioning him. Be it the crystalline gleam of “Spy Kid” or the bounce of “Sneeze,” Keef’s intoned flows are perfectly in phase.\nAs the godfather of “mumble,” Keef continues to push toward new sounds, expanding the scope of his music at every opportunity. (“All the young niggas grew up, wanna be me/You can act like it, bitch, I know you see me,” he raps knowingly and defiantly on “Spy Kid.”) On GloToven, he is constantly changing the shape of his voice and fiddling with its composition. Keef is far from the post-form ad-libbing of his acolytes like Playboi Carti; these songs have very clear ideas laid out and are performed deliberately. There seems to be little rhyme or reason to the songcraft beyond what Keef feels, but he has great instincts. “3rd Person” is a single rambled verse, in which his flows float through a wind tunnel of sounds from across the Zaytoven starter kit. Half of “F What the Opp Said” is just wordless Auto-Tuned warbling buoyed between Zaytoven’s oscillating keys. Ever the maverick, Keef turns a tender arrangement fit for The-Dream, on “Petty,” into an anti-ballad about how a paramour is nagging him too much about the cheating he’s definitely doing.\nIt isn’t really in Keef’s nature to be sentimental, but Zaytoven has a way of getting to the hardest rappers. The presence of fallen love ones looms in the periphery as the tape goes on. “I ain’t got no choice but do this shit for my dead partners,” he raps early on. “I wanna bring my brother back but I know it ain’t gon’ happen,” he accepts on “Ain’t Gonna Happen,” calling Fredo Santana out by name. The anthropomorphic gold star on the cover, with its double cup and the cross between its eyes, is likely an homage to the late Fredo, who appears in promo footage for GloToven in which Keef bangs out a tune on a baby grand and is dubbed “the new Beethoven.” As the piano chords swell across GloToven, Chief Keef continues to expand his legacy, for both his sake and the sake of those he’s lost.\n", "pptitle": ["glotoven"]}