{"id": "PF_9", "url": "https://pitchfork.com/reviews/albums/ex-hex-its-real/", "name": ["It’s", "Real"], "description": ["day", "lead", "indierock", "stalwart", "helium", "1990", "mari", "timoni", "special", "obliqu", "angl", "listen", "superbal", "singl", "1995", "breakthrough", "dirt", "luck", "drift", "focu", "helium", "studious", "avoid", "direct", "riff", "elus", "meant", "sudden", "shift", "bold", "line", "primari", "color", "came", "shock", "unveil", "powertrio", "ex", "hex", "2014", "name", "2005", "solo", "album", "ex", "hex", "appear", "tightli", "connect", "wild", "flag", "2011", "collabor", "carri", "brownstein", "janet", "weiss", "sleaterkinneya", "record", "kick", "viscer", "rocknrol", "energi", "timoni", "hint", "earlier", "music", "spirit", "drove", "ex", "hex", "debut", "rip", "real", "ex", "hex", "second", "album", "suggest", "dallianc", "hard", "rock", "pass", "phase", "reunit", "produc", "jonah", "takagi", "band", "doesnt", "abandon", "formula", "fuel", "rip", "favor", "heavi", "hook", "cavern", "big", "beat", "conjur", "neonlit", "80", "aor", "fantasia", "ex", "hex", "area", "arena", "rock", "forgotten", "pop", "histori", "pledg", "allegi", "echo", "overdr", "phaser", "harmoni", "thing", "power", "airwav", "day", "mtv", "forget", "stylish", "new", "wave", "touchston", "blondi", "metal", "perenni", "van", "halen", "ex", "hex", "big", "beat", "billi", "squier", "highoctan", "strut", "foreign", "pound", "hard", "rock", "thousand", "burnout", "rais", "denimclad", "fist", "solidar", "key", "ex", "hex", "success", "despit", "echo", "music", "feel", "refreshingli", "free", "nostalgia", "commerci", "calcul", "overs", "shini", "sound", "real", "imagin", "anteced", "mainstream", "underground", "rock", "2019", "sheen", "bright", "guitar", "songwrit", "resist", "big", "hook", "opt", "prickli", "patient", "approach", "big", "payoff", "lay", "fact", "timoni", "admiss", "just", "pop", "person", "melodi", "isnt", "alien", "grand", "gestur", "make", "ex", "hex", "dont", "come", "natur", "theyr", "studi", "consciou", "work", "musician", "make", "uncomfort", "write", "accessiblesound", "music", "timoni", "skill", "alli", "assist", "task", "includ", "takagi", "bassist", "betsi", "wright", "drummer", "laura", "harri", "wright", "takagi", "timoni", "pick", "guitar", "produc", "play", "bass", "dave", "christian", "credit", "drum", "music", "chair", "suggest", "ex", "hex", "open", "formula", "let", "music", "breath", "chang", "classic", "rock", "core", "earli", "80", "era", "real", "conjur", "stretch", "assess", "sign", "matur", "arriv", "lean", "fearless", "rip", "album", "bit", "lax", "rip", "rush", "12", "song", "35", "minut", "real", "take", "40", "minut", "10", "songstough", "rainbow", "shiner", "good", "timesar", "longer", "longest", "song", "debut", "gain", "length", "chunki", "vamp", "slowli", "rare", "fast", "odd", "sensat", "listen", "raucou", "arenarock", "album", "straighta", "student", "ultim", "reward", "everybodi", "involv", "sculpt", "song", "real", "care", "lose", "sight", "album", "sound", "immedi", "brace", "sober", "reconstruct", "beeri", "frivol", "help", "recal", "river", "cuomo", "dissect", "kiss", "oasi", "hit", "like", "biologyclass", "frog", "tri", "figur", "work", "ex", "hex", "work", "isnt", "bloodless", "styliz", "theyv", "retain", "messi", "spirit", "vintag", "classic", "rock", "vener", "real", "feel", "excit", "aliv", "show", "thoroughli", "theyv", "absorb", "lesson", "theyv", "learn"], "date_published": ["2019-03-29T05:00:00"], "sentiment": 0.10352188552188551, "content": "During her days leading indie-rock stalwarts Helium during the 1990s, Mary Timony specialized in oblique angles. Listen to “Superball,”  the single from 1995 breakthrough The Dirt of Luck: it drifts into focus as Helium studiously avoids a direct riff. This elusiveness meant that her sudden shift toward bold lines and primary colors came as something of a shock when she unveiled her power-trio Ex Hex in 2014. Named after her 2005 solo album, Ex Hex appeared to be tightly connected to Wild Flag, her 2011 collaboration with Carrie Brownstein and Janet Weiss of Sleater-Kinney—a record that kicked with a visceral rock’n’roll energy Timony only hinted at in her earlier music. This same spirit drove Ex Hex’s debut, Rips.\nIt’s Real, Ex Hex’s second album, suggests with its very name that this dalliance with hard rock is no passing phase. Reuniting with producer Jonah Takagi, the band doesn’t abandon the formula that fueled Rips, favoring heavy hooks and a cavernous big beat that conjures a neon-lit ’80s AOR fantasia. Ex Hex mine the areas of arena rock that have been forgotten to pop history, pledging allegiance to echo, overdrive, phasers and harmony, the very things that powered the airwaves in the days before MTV. Forget such stylish New Wave touchstones as Blondie or metal perennials as Van Halen: Ex Hex is all about the big beat of Billy Squier and the high-octane strut of Foreigner, the pounding hard rock that made thousands of burnouts raise their denim-clad fists in solidarity.\nThe key to Ex Hex’s success is that despite all these echoes, their music feels refreshingly free of both nostalgia and commercial calculation. The oversized, shiny sound of It’s Real has no imaginable antecedent in either mainstream or underground rock in 2019: its sheen is too bright for the latter and the guitars are too thick for the former. The songwriting resists big hooks, opting for a prickly and patient approach to big payoffs.\nPart of this may lay in the fact that Timony is, by her own admission, “just not a pop person.” Melody isn’t alien to her, but the grand gestures she makes in Ex Hex don’t come naturally. They’re studied and conscious, the work of a musician who is making herself uncomfortable by writing her most accessible-sounding music. Timony has several skilled allies to assist her in this task, including Takagi, bassist Betsy Wright and drummer Laura Harris. Wright, Takagi and Timony all picked up guitars, the producer also plays some bass, while Dave Christian is credited with some drums. These musical chairs suggests how Ex Hex opened up their formula, letting the music breathe without ever changing its classic rock core.\nBack in the early ’80s, the era which It’s Real so often conjures, such stretching would often be assessed a sign of maturity, but arriving after the lean, fearless Rips, the album can sometimes seem a bit lax. Rips rushed through its 12 songs in 35 minutes, while It’s Real takes 40 minutes to get through 10. The first three songs—“Tough Enough,” “Rainbow Shiner,” and “Good Times”—are all longer than the longest songs on the debut, gaining their length through chunky vamps. They never move slowly, yet they rarely move fast.\nIt’s an odd sensation, listening to a raucous arena-rock album made by such straight-A students, but it’s ultimately a rewarding one. Everybody involved sculpted the songs of It’s Real with care, while also not losing sight that the album should sound immediate and bracing. Such sober reconstructions of beery frivolity can’t help but recall Rivers Cuomo, who dissected KISS and Oasis hits like so many biology-class frogs, trying to figure out what made them “work.” But Ex Hex’s work isn’t bloodless or stylized. Somehow, they’ve retained all the messy spirit of the vintage classic rock they venerate. That It’s Real feels so exciting and alive only shows how thoroughly they’ve absorbed the lessons they’ve learned.\n", "pptitle": ["real"]}