{"id": "PF_89", "url": "https://pitchfork.com/reviews/albums/2-chainz-rap-or-go-to-the-league/", "name": ["Rap", "or", "Go", "to", "the", "League"], "description": ["2", "chainz", "form", "rap", "group", "playaz", "circl", "1997", "year", "play", "colleg", "basketbal", "alabama", "state", "hed", "sold", "dope", "meantim", "life", "felon", "legal", "adult", "colleg", "park", "nativ", "turn", "rap", "search", "legal", "hustl", "said", "stay", "jail", "stay", "grave", "dream", "rout", "d1", "prospect", "nba", "franchis", "player", "didnt", "pan", "eventu", "way", "allstar", "game", "year", "allegedli", "spent", "1", "million", "blimp", "flew", "stapl", "center", "lo", "angel", "announc", "rap", "album", "construct", "2", "chainz", "embrac", "youth", "follow", "stardomthat", "permiss", "prospect", "path", "success", "black", "kid", "look", "way", "ghetto", "document", "ideolog", "rap", "historyi", "reevalu", "said", "album", "rap", "leagu", "peopl", "center", "rappertrapperathlet", "venn", "diagram", "join", "alum", "like", "camron", "game", "recur", "success", "do", "result", "posit", "anatom", "process", "album", "propos", "rapper", "reject", "premis", "titl", "asid", "outro", "doe", "occasion", "question", "bifurc", "black", "liber", "music", "track", "path", "prosper", "minefield", "regard", "cogent", "organ", "album", "far", "thought", "provid", "context", "stori", "rewrit", "rule", "book", "win", "open", "life", "certifi", "dealer", "rap", "star", "critiqu", "broken", "collegi", "athlet", "apparatu", "war", "uncl", "sam", "execut", "produc", "futur", "nba", "hall", "famer", "snapchat", "rap", "ar", "lebron", "jame", "find", "2", "chainz", "explor", "thing", "he", "danc", "entir", "career", "closer", "2", "chainz", "album", "pretti", "girl", "like", "trap", "music", "set", "tabl", "vers", "better", "subject", "realerse", "mom", "addict", "dad", "dealerand", "son", "nigga", "im", "black", "activistim", "black", "millionair", "black", "ass", "kiss", "rap", "present", "success", "sort", "affront", "broken", "opt", "rock", "transit", "rap", "rich", "famou", "except", "prove", "rule", "2", "chainz", "isnt", "activist", "tweak", "messag", "bit", "isnt", "black", "millionair", "question", "condit", "make", "situat", "rare", "lead", "break", "exploit", "measur", "primarili", "black", "sport", "ncaa", "reflect", "cornerboy", "past", "statut", "limit", "momma", "hit", "lick", "lament", "framework", "pay", "cop", "kill", "black", "kid", "undereduc", "sam", "realli", "make", "point", "think", "he", "makingthat", "path", "hisbut", "intent", "make", "he", "modern", "renaiss", "man", "odd", "continu", "win", "revel", "spoil", "way", "see", "he", "triathlet", "turn", "execut", "plenti", "patent", "humor", "sneak", "zinger", "onenight", "stand", "unusu", "serious", "thought", "probabl", "imposs", "exuber", "2", "chainz", "feel", "debilit", "shame", "doe", "point", "express", "regret", "outsiz", "persona", "tamp", "somewhat", "owe", "newfound", "domest", "got", "famili", "gotta", "pipe", "downfor", "young", "ho", "fuck", "timelin", "flow", "nimbler", "standard", "pois", "setuppunchlin", "structur", "long", "anchor", "vers", "larg", "set", "asid", "spin", "yarn", "brace", "hear", "man", "known", "titi", "boi", "talk", "openli", "marri", "famili", "life", "challeng", "establish", "narr", "surround", "innerc", "escap", "rout", "rap", "leagu", "shouldnt", "mistaken", "matur", "2", "chainz", "album", "usual", "element", "patho", "2", "chainz", "funniest", "line", "halflisten", "know", "he", "oper", "peak", "year", "song", "like", "9th", "wonderproduc", "threat", "2", "societi", "lifeaffirm", "sampl", "good", "just", "aliv", "money", "way", "arent", "realli", "departur", "theyr", "simpli", "articul", "differ", "heavyish", "tone", "weve", "come", "associ", "messag", "music", "delv", "deeper", "person", "life", "just", "sharp", "hand", "releas", "isnt", "song", "better", "simpli", "render", "complet", "pictur", "he", "work", "respect", "rap", "leagu", "feel", "like", "person", "triumph", "eyepop", "2", "chainz", "rap", "epic", "2", "chainz", "song", "album", "offer", "2", "chainz", "man", "artist", "find", "retrac", "step", "look", "world", "seek", "way", "forward", "album", "differ", "stori", "unfold", "just", "1", "ncaa", "player", "make", "nba", "odd", "like", "just", "bad", "rap", "ballingin", "permutationswil", "probabl", "beall", "endal", "rebuild", "black", "commun", "sure", "suit", "2", "chainz", "fine"], "date_published": ["2019-03-06T06:00:00"], "sentiment": 0.08270469904133268, "content": "2 Chainz formed his rap group Playaz Circle in 1997, the last year he played college basketball at Alabama State. He’d sold dope in the meantime, and for much of his life; he was a felon before he was legally an adult. The College Park native had turned to rap in search of a “legal hustle,” he said, to “stay out of jail and stay out of the grave.” His dream route from D-1 prospect to NBA franchise player didn’t ever pan out, but he eventually found his way to the All-Star game anyway: Last year, he allegedly spent $1 million on a blimp that flew over the Staples Center in Los Angeles. All to announce a rap album.\nThis construct 2 Chainz embraced in his youth and followed to stardom—that there are only two permissible prospective paths to success for black kids looking for a way out of the ghetto, one of the more well documented ideologies in rap history—is one he reevaluates on said album, Rap or Go to the League. As one of a few people at the center of the rapper-trapper-athlete Venn Diagram (joining alums like Cam’ron and the Game), someone who found recurring success doing at least one as a result, he is in a position to anatomize the process. The album is proposed as the rapper’s rejection of the very premise in the title, and in asides and outros he does occasionally question this bifurcation of black liberation, but the music mostly tracks his own path to prosperity through a minefield. In that regard, it is his most cogent and organized album by far, and his most thoughtful one. As he provides more context for his story than ever, he rewrites the rule book on winning, opening up about his life as certified dealer to rap stars, critiquing the broken collegiate athletics apparatus, and warring against Uncle Sam. Executive produced by future NBA Hall of Famer and Snapchat rap A&R LeBron James, it finds 2 Chainz exploring things he’s danced around his entire career.\nThe closer on 2 Chainz’s last album, Pretty Girls Like Trap Music, set the table for this one: “See my verses are better and my subject is realer/See my mom was an addict and my dad was the dealer/And their son is that nigga, I’m no Black activist/I’m a Black millionaire, give you my Black ass to kiss,” he rapped. He presented his success as its own sort of affront to a broken system: He opted for one rock over another, transitioned into rap, and became rich and famous. But his is the exception that proves the rule.\n2 Chainz still isn’t an activist, but he has tweaked his messaging a bit. It isn’t enough for him to be a Black millionaire now; he must also question the conditions that make someone in his situation so rare. This leads him to break down the exploitative measures of a primarily black sport (“NCAA”), reflect on his corner-boy past (“Statute of Limitations,” “Momma I Hit a Lick”), and lament a framework that pays cops to kill the same black kids it under-educates (“Sam”). He never really makes the point he thinks he’s making—that there are other paths than these, than his—but he intentionally makes another: that he’s a modern renaissance man. Against the odds, he continues to win, and revel in the spoils. The way he sees it, he’s a triathlete turned executive.\nThere is still plenty of his patented humor, and he sneaks in the zingers (“Have you ever had two one-night stands?”), but there is also an unusual seriousness and thoughtfulness. It’s probably impossible for someone as exuberant as 2 Chainz to feel anything as debilitating as shame, but he does at points express regret. His outsized persona is tamped down somewhat, owing at least in part to his newfound domesticity (“Got a family now so I gotta pipe down/’Fore a young ho fuck up my timeline”) but the flows are nimbler, even by his standards, and more poised. The set-up/punchline structure that has long anchored his verses is largely set aside for spinning yarns.\nWhile it’s bracing to hear the man formerly known as Tity Boi talk openly about married family life, or challenge the established narratives surrounding inner-city escape routes, Rap or Go to the League shouldn’t be mistaken for the  “serious” or “mature” 2 Chainz album. There is usually an element of pathos even in 2 Chainz’s funniest lines, and anyone half-listening knows he’s been operating at his peak for at least three years now. Songs like the 9th Wonder-produced “Threat 2 Society,” with its life-affirming sample (“It’s so good just to be alive!”) and “Money in the Way” aren’t really departures, they’re simply articulated differently, with the heavy-ish tone we’ve come to associate with message music. He delves deeper into his personal life more but he is just as sharp as been across his last handful of releases. It isn’t so much that these songs are better; they simply render a more complete picture of him, one he’s been working toward.\nIn that respect, Rap or Go to the League feels like a personal triumph. There are more eye-popping 2 Chainz raps and more epic 2 Chainz songs elsewhere, but this album offers of 2 Chainz as a man and artist. It finds him retracing his own steps, looking to the world beyond himself, and seeking a way forward for others. Throughout the album, two different stories are unfolding. Just over 1% of NCAA players make it to the NBA; the odds are likely just as bad for rap. “Balling”—in all its permutations—will probably never become the be-all end-all for rebuilding black communities. But it sure suits 2 Chainz fine.\n", "pptitle": ["rap", "leagu"]}