{"id": "PF_97", "url": "https://pitchfork.com/reviews/albums/deem-spencer-pretty-face/", "name": ["Pretty", "Face"], "description": ["high", "school", "attempt", "oneup", "friend", "hit", "girl", "like", "deem", "spencer", "recit", "asher", "roth", "song", "draw", "attent", "work", "start", "write", "rap", "avoid", "he", "rap", "girlssort", "fulllength", "project", "pretti", "face", "similar", "perform", "gestur", "lover", "gestur", "proven", "futil", "tracklist", "piec", "sentenc", "lyric", "play", "tape", "open", "second", "realli", "tryna", "tell", "shorti", "beauti", "shorti", "shorti", "tryna", "hear", "34", "minut", "triesand", "ultim", "failsto", "salvag", "unravel", "relationship", "process", "give", "shape", "beauti", "mute", "music", "spencer", "mousi", "22yearold", "rapper", "jamaica", "queen", "coo", "lyric", "make", "music", "overthink", "arent", "trace", "histor", "queen", "hiphop", "yore", "vers", "inton", "he", "bliss", "unconcern", "nyc", "rap", "lore", "restor", "feel", "pick", "rap", "like", "catch", "convers", "fragment", "just", "bare", "earshot", "beneath", "buzz", "murmur", "restaur", "song", "exist", "crack", "mundan", "profound", "rumin", "onsometim", "throughth", "everyday", "struggl", "young", "move", "forward", "search", "perfectli", "articul", "thought", "feel", "gotta", "express", "impress", "said", "year", "oddli", "express", "problem", "hopeless", "romant", "small", "voic", "obscur", "point", "indistinct", "song", "tendenc", "swallow", "big", "idea", "pretti", "face", "rectif", "volum", "sheer", "impact", "sonic", "materi", "voic", "nearli", "impercept", "presenc", "palpabl", "record", "bedroom", "depress", "shit", "2018", "person", "categor", "music", "didnt", "want", "make", "music", "pretti", "face", "play", "like", "deem", "spencer", "meander", "revel", "amid", "undirect", "record", "process", "heartbreak", "hymn", "pensiv", "extrovert", "tape", "build", "electrosoul", "blend", "minim", "previou", "work", "fuller", "song", "hit", "differ", "iron", "incident", "cut", "develop", "purpos", "disappear", "mix", "felt", "like", "hide", "feel", "like", "invit", "listen", "care", "come", "closer", "project", "2017", "ep", "think", "wade", "fog", "grief", "death", "grandfath", "song", "turn", "introspect", "droll", "capac", "usual", "withdrawn", "shrink", "song", "paint", "glasshalfempti", "perspect", "project", "felt", "incomplet", "fatalist", "way", "bit", "configur", "spencer", "recent", "reveal", "sunflow", "think", "origin", "meant", "call", "pretti", "face", "kept", "save", "titl", "greener", "pastur", "pretti", "face", "releas", "light", "circumst", "doesnt", "feel", "undon", "beat", "break", "reveal", "bubbl", "shorti", "pt", "3", "feel", "like", "decis", "resolut", "mind", "thought", "peek", "underneath", "overcast", "condit", "reveal", "restor", "light", "aton", "take", "respons", "selfsabotag", "role", "he", "play", "misfortun", "feel", "like", "coulda", "shoulda", "wouldnthad", "burn", "bridg", "follow", "sigh", "bend", "flow", "potent", "impetu", "convers", "girl", "god", "love", "unfold", "illumin", "watch", "grew", "angerh", "said", "id", "expect", "hate", "scorn", "exlov", "strangeri", "said", "nah", "aint", "hate", "brother", "thanksand", "ima", "make", "sure", "collect", "cold", "hard", "gem", "got", "bank", "spencer", "find", "relief", "tape", "treasur", "experi", "jazz", "loung", "vibe", "slick", "spit", "tryna", "hear", "deem", "spencer", "turn", "tumultu", "romanc", "kindl", "bonfir", "selfreal", "song", "pretti", "face", "arent", "happen", "insid", "broken", "relationship", "happen", "heartach", "spencer", "stumbl", "truer", "sens", "ident", "music", "hurt", "subsid"], "date_published": ["2019-03-02T06:00:00"], "sentiment": 0.1483333333333333, "content": "Back in high school, in an attempt to one-up a friend who was hitting on a girl they both liked, Deem Spencer recited an Asher Roth song to draw her attention. When it worked, he started writing his own raps to avoid being found out. He’s still rapping to girls—sort of. His first full-length project, Pretty Face, is full of (and about) similar performative gestures for a lover and about how such gestures have proven futile. The tracklist, when pieced together as a sentence, is a lyric played in the tape’s opening seconds: “Really, I been tryna tell shorty how beautiful shorty is to me but shorty not tryna hear it from me.” For 34 minutes he tries—and ultimately fails—to salvage an unraveled relationship, but in the process, he gives more shape to his beautiful, muted music.\nSpencer, a mousy 22-year-old rapper from Jamaica Queens who coos his lyrics, makes music for the overthinkers. There aren’t any traces of the historic Queens of hip-hop yore in the verses he intones. He’s blissfully unconcerned with NYC rap lore and restoring the feeling. Picking out his raps can be like catching conversation fragments from someone just barely within earshot, beneath the buzzing murmur in a restaurant. His songs exist in the cracks between the mundane and profound, ruminating on—sometimes through—the everyday struggles of being young and moving forward. He is in search of both the perfectly articulated thought and feeling. “You gotta be more expressive than you are impressive,” he said last year. Oddly enough, expressiveness has been a problem for the hopeless romantic. His small voice, often obscured to the point of being indistinct in song, has a tendency to be swallowed up in his big ideas. Pretty Face is a rectification, not so much in volume as in the sheer impact of sonic material. Even when his voice is nearly imperceptible here his presence is still palpable.\nRecorded in his bedroom “on some depressed shit” in 2018 and personally categorized as the music he made when he didn’t want to make music, Pretty Face plays like Deem Spencer’s meandering revelations amid an undirected recording process. It’s heartbreak hymns for pensive extroverts. The tape builds on the electro-soul blended minimalism of his previous work toward fuller songs. It hits differently. Ironically, these incidental cuts develop with more purpose. Before, when he would disappear into the mix, it felt like he was hiding; now, it feels like an invitation to listen more carefully, to come in closer.\nHis last project, the 2017 EP we think we alone, waded through the fog of grief after the death of his grandfather. Those eight songs were at turns introspective and droll, with the capacity to be even more, but they were also usually withdrawn or shrinking. All his songs paint with a glass-half-empty perspective, but where his last project felt incomplete in almost a fatalistic way these are a bit more configured. Spencer recently revealed that both sunflower and we think we alone were originally meant to be called Pretty Face, but that he kept saving the title for greener pastures. This Pretty Face, though still not released under light circumstances, doesn’t feel as undone.\nWhen a beat breaks off to reveal another, as on the bubbly “shorty pt. 3,” it feels like a decision made with resolution in mind. Several thoughts peek from underneath the overcast conditions to reveal the restorative light of atonement, taking responsibility for the self-sabotaging role he’s played in his own misfortune: “I still feel like coulda, shoulda, wouldn’t/Had burned bridges so I couldn’t be followed,” he sighs on “is.” The bending flows on “been” are among his most potent, the impetus for a conversation with the “girl’s God” on why “we all can’t love her.” What unfolds next is illuminating: “And as a watched, he grew with anger/He said, ‘I’d expect such hate from a scorned ex-lover, but not from you, a stranger’/I said, ‘Nah, it ain’t even hate, my brother, not for you, it’s thanks/And I’ma make sure I collect all these cold hard gems that I got from you in banks.’” Not only is Spencer finding relief on the tape, he is treasuring the experience.\nFrom the jazz lounge vibes of “but” to the slick spitting on “not tryna hear it,” Deem Spencer turns a tumultuous romance into kindling for a bonfire of self-realization. The songs on Pretty Face aren’t so much about what happens inside a broken relationship as they are what happens after. Through the heartache, Spencer stumbled into a truer sense of identity in his music. When the hurt subsides, all you can do is go on.\n", "pptitle": ["pretti", "face"]}