{"id": "PF_5", "url": "https://pitchfork.com/reviews/albums/lucinda-chua-antidotes-1-ep/", "name": ["Antidotes", "1", "EP"], "description": ["clock", "hundr", "mile", "tour", "slint", "star", "lid", "join", "fka", "twig", "live", "band", "releas", "dainti", "chamber", "pop", "half", "duo", "felix", "lucinda", "chua", "photograph", "pictur", "small", "moment", "dramat", "lit", "girl", "stare", "grand", "piano", "faceless", "woman", "search", "book", "knee", "chua", "photographi", "hope", "convey", "piec", "wider", "stori", "small", "fraction", "emot", "fragment", "narr", "said", "antidot", "1", "debut", "solo", "ep", "radiat", "kind", "heighten", "interior", "swap", "stage", "light", "complex", "rhythm", "cello", "vocalist", "felix", "chua", "kind", "manic", "flow", "urgent", "hush", "like", "spill", "secret", "friend", "middl", "homeroom", "note", "antidot", "1", "chua", "altogeth", "richer", "closer", "patient", "classic", "train", "cellist", "chua", "adeptli", "mold", "vocal", "textur", "drawnout", "bow", "stroke", "wade", "care", "open", "feel", "take", "stock", "surround", "like", "morn", "stretch", "high", "far", "deep", "sing", "voic", "velveti", "like", "weight", "blanket", "tactil", "qualiti", "chua", "sing", "intimaci", "incit", "goosebump", "word", "open", "refrain", "just", "wanna", "feel", "chop", "shorten", "half", "drag", "thing", "reveal", "crevic", "breath", "world", "low", "sooth", "croon", "place", "neorb", "singer", "like", "milosh", "distinct", "raw", "sing", "part", "feel", "origin", "appear", "composit", "call", "music", "record", "design", "solo", "consumpt", "music", "bubbl", "headphon", "said", "music", "2013", "chua", "take", "circuit", "approach", "write", "call", "choru", "instead", "prefer", "repeat", "long", "vers", "hypnot", "like", "photograph", "lyric", "cryptic", "drop", "middl", "fabl", "better", "bore", "son", "sing", "omin", "take", "launch", "dark", "refrain", "witch", "exil", "chua", "way", "sound", "remark", "human", "depth", "fairytal", "narr", "demon", "carri", "fake", "sing", "pain", "palpabl", "voic", "break", "word", "antidot", "1", "lesson", "patiencechua", "hold", "note", "entir", "breath", "buckl", "run", "air", "drag", "cello", "note", "natur", "fade", "semiton", "music", "semiton", "smallest", "interv", "note", "chua", "make", "step", "guitar", "echo", "cello", "slow", "languor", "movement", "convers", "instrument", "fill", "space", "note", "voic", "rais", "bare", "lilt", "whisper", "harmon", "somebodi", "alien", "distort", "record", "sing", "sharpen", "slightli", "earth", "die", "repeat", "plainli", "vocal", "accompani", "begin", "break", "cello", "descend", "disson", "scale", "glassi", "fade", "memori"], "date_published": ["2019-03-29T05:00:00"], "sentiment": 0.07162550833005378, "content": "Before she clocked hundreds of miles touring with Slint and Stars of the Lid, before she joined FKA Twigs’ live band, before she released dainty chamber pop as one half of the duo Felix, Lucinda Chua was a photographer. Her pictures are small moments, dramatically lit — a girl staring at a grand piano; a faceless woman searching for a book on her knees. To Chua, photography could only hope to convey a piece of a wider story, a small fraction of an emotion: “all it can show is a fragment of a narrative,” she said. Antidotes 1, her debut solo EP, radiates with the same kind of heightened interiority, swapping stage lighting for the complex rhythms of her cello.\nAs the vocalist of Felix, Chua had a kind of manic flow, urgent and hushed, like someone spilling secrets to a friend in the middle of homeroom. But from the first notes of Antidotes 1, Chua is altogether richer, closer, more patient. A classically trained cellist, Chua adeptly molds her vocals around her textured, drawn-out bow strokes. She wades carefully into opener “Feel Something,” taking stock of her surroundings, like a morning stretch: “How high, how far, how deep,” she sings, her voice velvety like a weighted blanket.\nThere is a tactile quality to Chua’s singing, an intimacy that incites goosebumps. She can take the word “something” in the opener’s refrain, “I just wanna feel something,” and chop it up, shortening the first half and dragging out “thing” until it reveals the crevices of her breath. In another world, her low, soothing croon could place her next to neo-R&B singers like Milosh, but there is a distinctive rawness to her singing. Parts of “Feel Something” originally appear in a composition called “Music For One,” and the record indeed seems designed for solo consumption: “It’s music for you, in your bubble, with your headphones,” she said of “Music For One” in 2013.\nChua takes a circuitous approach to writing. There is nothing that could be called a “chorus” here; she instead prefers to repeat long verses until they become hypnotic. Like her photographs, her lyrics are cryptic, dropping into the middle of a fable: “You better have bore a son,” she sings ominously on “Whatever It Takes,” before launching into a dark refrain about “witches in exile.” Chua has a way of sounding remarkably human even in the depths of a fairytale narrative: “The demons I carry are fake,” she sings, the pain palpable as her voice breaks on the last word.\nAntidotes 1 is a lesson in patience—Chua holds a note for an entire breath, until she buckles and runs out of air, and drags the cello through one note until it seems to naturally fade into the next, as on “Semitones.” In music, a semitone is the smallest interval between two notes. Chua makes these steps, first on the guitar and then echoed on the cello, in slow, languorous movements. As if in conversation with the instrument, she fills the space in between notes with her voice, raised barely above a lilting whisper. When she harmonizes on “Somebody Who,” it is with an alien, distorted recording of her singing, sharpened slightly. “The earth is dying,” she repeats plainly, as her vocal accompaniment begins to break down. The cello descends a dissonant scale, glassy and full, until it seems to fade into memory.\n", "pptitle": ["antidot", "1", "ep"]}