{"id": "PF_13", "url": "https://pitchfork.com/reviews/albums/christian-scott-atunde-adjuah-ancestral-recall/", "name": ["Ancestral", "Recall"], "description": ["christian", "scott", "atund", "adjuah", "work", "unifi", "multicultur", "idea", "improvis", "music", "career", "new", "orleansrais", "berkleetrain", "trumpet", "prodigi", "hardli", "known", "concept", "dub", "stretch", "music", "2015", "album", "time", "jazz", "reemerg", "mainstream", "conscious", "call", "attempt", "stretchnot", "replacejazz", "rhythmic", "melod", "harmon", "convent", "encompass", "music", "formslanguagescultur", "coincid", "eros", "boundari", "central", "current", "jazz", "renaiss", "ancestr", "recal", "atund", "adjuah", "ninth", "studio", "album", "leader", "progress", "statement", "stretch", "music", "testament", "contemporari", "flexibl", "jazz", "tradit", "time", "constitut", "hyperspac", "leap", "make", "ancestr", "recal", "radic", "beguil", "stretch", "music", "insurg", "product", "jazz", "oldest", "tradit", "wing", "atund", "adjuah", "statu", "thirdgener", "mardi", "gra", "indian", "chief", "grandson", "legendari", "big", "chief", "donald", "harrison", "sr", "overshadow", "youth", "experi", "acclaim", "saxophonist", "uncl", "donald", "harrison", "jr", "group", "influenc", "work", "hand", "hand", "scott", "communitymind", "educ", "tribe", "coupl", "unorthodox", "relationship", "instrumenth", "start", "play", "late", "new", "orleanian", "said", "began", "design", "horn", "unusu", "tonal", "rang", "hate", "sound", "trumpetfost", "creativ", "social", "perspect", "atop", "nola", "canon", "jazz", "studi", "atund", "adjuah", "recogn", "tiger", "rag", "say", "juvenil", "bounc", "eman", "sourc", "reject", "segreg", "race", "class", "technolog", "cultur", "narr", "media", "distribut", "factor", "stretch", "music", "market", "plan", "express", "philosoph", "necess", "make", "sens", "world", "stretch", "music", "atund", "adjuah", "initi", "attempt", "reconcil", "chang", "tradit", "easiest", "way", "track", "intent", "beat", "fractur", "polyrhythm", "base", "spent", "album", "develop", "drummer", "jamir", "william", "central", "figur", "right", "la", "new", "breed", "mutat", "technolog", "robust", "structur", "joe", "dyson", "jr", "corey", "fonvil", "interlock", "beat", "program", "handplay", "spoke", "planet", "drum", "pidgin", "blend", "precis", "polyglot", "atund", "adjuah", "flautist", "elena", "pinderhugh", "soar", "year", "later", "cours", "2017", "sprawl", "centenni", "trilog", "explicit", "music", "nod", "tradit", "rarer", "atund", "adjuah", "piec", "step", "blue", "vernacular", "environment", "digit", "beat", "pronounc", "strong", "cinemat", "horn", "line", "invok", "classic", "player", "familiar", "phrase", "territori", "ocean", "sound", "surfac", "hark", "fusion", "record", "laswel", "allstar", "cast", "jazz", "hiphop", "world", "experiment", "musician", "celluloid", "axiom", "1980", "1990", "occasion", "deep", "dive", "harvest", "gloriou", "origin", "like", "encrypt", "centenni", "trilog", "ruler", "rebel", "spectacularli", "organ", "synthesi", "jazz", "improvis", "trancelik", "rhythm", "detroit", "techno", "scifi", "dread", "ancestr", "recal", "element", "left", "tether", "timeworn", "rule", "jazz", "titl", "make", "abundantli", "clear", "past", "remain", "paramount", "old", "global", "cultur", "prefer", "engin", "futur", "led", "voic", "drum", "electron", "version", "stretch", "music", "cut", "recogniz", "instrument", "sound", "loos", "player", "pinderhugh", "featur", "12", "track", "longtim", "keyboardist", "lawrenc", "field", "bassist", "kriss", "funn", "apiec", "horn", "present", "logan", "richardson", "alto", "reduc", "solitari", "featur", "otherworldli", "quintet", "track", "song", "heard", "instanc", "recal", "approach", "standard", "song", "form", "textur", "presentationmix", "digit", "filter", "light", "percuss", "loop", "bounc", "synth", "wash", "arriv", "late", "songimpli", "mayb", "standard", "did", "arriv", "saturn", "drum", "corp", "hand", "feel", "omnipres", "recal", "harmon", "center", "build", "atund", "adjuah", "previou", "rhythm", "foray", "fonvil", "master", "djemb", "player", "weedi", "braimah", "atund", "adjuah", "extens", "electron", "core", "provid", "scaffold", "track", "percussionist", "join", "proceed", "electr", "onetwo", "open", "arriv", "night", "appear", "saul", "william", "vocal", "timbr", "poetic", "charg", "provid", "perfect", "narr", "foil", "appear", "situ", "deliveri", "bear", "majesti", "dissimilar", "atund", "adjuah", "horn", "night", "recal", "hardtodescrib", "masterpiec", "rare", "track", "natur", "split", "differ", "electron", "club", "music", "ritualist", "tranc", "drummer", "reced", "ancestr", "recal", "unfold", "set", "ceremoni", "procession", "music", "holi", "open", "space", "except", "divin", "devan", "layer", "horn", "flute", "astral", "interplay", "find", "atund", "adjuah", "work", "trumpet", "digit", "facsimil", "rare", "miss", "abet", "hand", "drum", "occasion", "mpc", "industri", "loop", "electron", "vocal", "sampl", "unfold", "melod", "blanket", "increasingli", "melancholi", "tone", "afloat", "atund", "adjuah", "instrument", "appear", "primarili", "tool", "composit", "spontan", "express", "inasmuch", "invest", "rhythmic", "expans", "ancestr", "recal", "mark", "turn", "inward", "excit", "strateg", "choic", "stretch", "music", "philosophi", "born", "cultur", "amplif", "group", "interplay", "feel", "like", "hint", "simpli", "play", "changesno", "matter", "differ", "kind", "broad", "casti", "substitut", "understand", "live"], "date_published": ["2019-03-28T05:00:00"], "sentiment": 0.12365399751763388, "content": "Christian Scott aTunde Adjuah has been working toward a unified, multicultural idea of improvised music for much of his career. But the New Orleans-raised, Berklee-trained trumpet prodigy could hardly have known that the concept he dubbed “stretch music” (on a 2015 album of the same name) would be so well timed to jazz’s reemergence into mainstream consciousness. What he has called an attempt to “stretch—not replace—jazz's rhythmic, melodic and harmonic conventions to encompass as many musical forms/languages/cultures as we can” coincides with an erosion of boundaries that is central to the current jazz renaissance. Ancestral Recall, aTunde Adjuah’s ninth studio album as a leader and his most progressive statement of stretch music yet, is a testament to the contemporary flexibility of the jazz tradition; at times, it also constitutes a hyperspace leap out of it.\nWhat makes Ancestral Recall’s radicalism beguiling is that stretch music’s insurgency is a product of jazz’s oldest and most traditional wing. aTunde Adjuah’s status as a third-generation Mardi Gras Indians chief (grandson to legendary Big Chief Donald Harrison, Sr.) is often overshadowed by his youthful experience in his acclaimed saxophonist uncle Donald Harrison, Jr.’s group, but the influences worked hand in hand. Scott’s community-minded education in the tribe, coupled with an unorthodox relationship to his instrument—he started playing late (for a New Orleanian) and once said that he began designing his own horns with unusual tonal ranges because of his “hate” for the sound of the trumpet—fostered a creative and social perspective atop NOLA’s canonical jazz studies. aTunde Adjuah recognizes that “Tiger Rag” and, say, Juvenile’s bounce emanate from the same source, and he rejects their segregation, whether by race, class, technology, cultural narrative, or media distribution, among other factors. Stretch music is less a marketing plan than an expression of the philosophical necessity to make sense of the world.\nStretch Music was aTunde Adjuah’s initial attempt to reconcile change with tradition. The easiest way to track his intentions was in the beat. The fractured, polyrhythmic base he had already spent two albums developing with drummer Jamire Williams (now a central figure in his own right among L.A.’s new breed) had mutated into a technologically robust structure: Joe Dyson Jr. and Corey Fonville’s interlocking beats (some programmed, some hand-played) spoke to planet drum not in some pidgin blend but in precise polyglot, while aTunde Adjuah and flautist Elena Pinderhughes soared above them. Two years later, over the course of 2017’s sprawling The Centennial Trilogy, the explicit musical nods to tradition became rarer. aTunde Adjuah’s pieces stepped further from the blues vernacular, toward something more environmental, while the digital beats became even more pronounced. His strong, cinematic horn lines could still invoke classic players and familiar phrases, but the territory around him was now an ocean of sound. On the surface, it harked back to fusion recordings that Bill Laswell made with all-star casts of jazz, hip-hop, “world,” and experimental musicians for Celluloid and Axiom in the 1980 and 1990s. Yet occasionally, the deep dives harvested glorious originals, like “Encryption” (on The Centennial Trilogy’s Ruler Rebel), a spectacularly organic synthesis of jazz improvisation with trance-like rhythms and Detroit techno’s sci-fi dread.\nOn Ancestral Recall, few elements are left tethered to the time-worn rules of “jazz,” yet, as the title makes abundantly clear, the past remains paramount, and old global cultures the preferred engines into the future. Led by voice, drums, and electronics, this version of stretch music cuts most recognizable instrumental sounds loose. Players, too. Pinderhughes features on three of 12 tracks, longtime keyboardist Lawrence Fields and bassist Kriss Funn on two apiece; the only other horn present, Logan Richardson’s alto, is reduced to a solitary feature. That otherworldly quintet track, “Songs She Never Heard,” is one of two instances where Recall approaches standard song form, yet even its textural presentation—mixed through a digital filter, with light percussive loops bouncing throughout, a synth wash arriving late in the song—implies that maybe some standards did indeed arrive from Saturn.\nThe drum corps, on the other hand, feels omnipresent. On Recall, it is the harmonic center that builds on aTunde Adjuah’s previous rhythm forays. Fonville, master djembe player Weedie Braimah, and aTunde Adjuah’s own extensive electronics are the core, providing scaffolding for almost all the tracks here; three other percussionists join the proceedings for the electric one-two opening, “Her Arrival” and “I Own the Night.” The latter is among the three appearances by Saul Williams, whose vocal timbre and poetic charge provide the perfect narrative foil whenever it appears, and whose in situ delivery bears a majesty not dissimilar to that of aTunde Adjuah’s horn. “I Own the Night” is one of Recall’s hard-to-describe masterpieces, that rare track that naturally splits the difference between electronic club music and ritualistic trance.\nWhen the drummers do recede, much of Ancestral Recall unfolds as a set of ceremonial processionals: music for holy and open space. With the exception of “Diviner [Devan],” made from layers of horns and flute in astral interplay, it also finds aTunde Adjuah often working alone. The trumpet (or some digitized facsimile of it) is rarely missing, abetted by hand drums, an occasional MPC, and industrial loops, with electronic vocal samples unfolding as melodic blankets to keep this increasingly melancholy tone afloat; aTunde Adjuah’s instrument appears primarily as a tool of composition rather than spontaneous expression.\nInasmuch as it invests in rhythmic expansion, Ancestral Recall also marks a turn inward. It is an exciting strategic choice for stretch music, the philosophy born of cultural amplification and group interplay. It almost feels like a hint that simply playing the changes—no matter how many different kinds, or with how broad a cast—is no substitute for understanding how to live through them.\n", "pptitle": ["ancestr", "recal"]}