{"id": "PF_93", "url": "https://pitchfork.com/reviews/albums/little-simz-grey-area/", "name": ["GREY", "Area"], "description": ["littl", "simz", "seek", "sens", "direct", "wondrou", "new", "album", "grey", "area", "grey", "area", "question", "mid20", "strang", "place", "she", "eager", "navig", "sound", "just", "wrote", "album", "place", "confus", "rapper", "born", "simbi", "ajikawo", "recent", "told", "noisey", "make", "uncertainti", "quarterlif", "crisi", "like", "navig", "fog", "war", "similar", "search", "certainti", "ran", "second", "album", "2017", "still", "wonderland", "lewi", "carrollbas", "introspect", "adventur", "sought", "better", "understand", "self", "arm", "lesson", "stumbl", "rabbit", "hole", "far", "assur", "grey", "area", "comingofag", "marvel", "wonderland", "tangl", "overwrought", "album", "idea", "unsur", "express", "work", "grey", "area", "simz", "uncov", "sourc", "disorient", "take", "outsid", "nois", "lose", "bear", "effort", "solv", "imposs", "young", "indecis", "coupl", "sensori", "overload", "trek", "europ", "improv", "songwrit", "storytel", "ground", "perspect", "examin", "societ", "decay", "feel", "deepli", "person", "buoy", "probe", "look", "heart", "dark", "intim", "glimps", "insid", "life", "motion", "drudgeri", "tour", "struggl", "modern", "relationship", "process", "trauma", "friend", "get", "murder", "handl", "delic", "deft", "touch", "dull", "pierc", "flow", "song", "woman", "respond", "nebul", "time", "make", "way", "forward", "fuckeri", "explain", "therapi", "peopl", "read", "alchemist", "shit", "entir", "album", "produc", "simz", "childhood", "friend", "inflo", "use", "live", "instrument", "place", "samplingguitar", "string", "piano", "drum", "mostlythey", "settl", "space", "song", "grey", "area", "sound", "theyr", "similar", "object", "vari", "probe", "groov", "im", "jayz", "bad", "day", "shakespear", "worst", "day", "snap", "scuzzi", "bass", "string", "offenc", "therapi", "invert", "song", "templat", "downtempo", "cleans", "time", "album", "settl", "gorgeou", "bed", "flower", "reunit", "inflo", "singer", "guitarist", "michael", "kiwanuka", "littl", "simz", "proven", "master", "univers", "turn", "acerb", "unguard", "grey", "area", "feel", "like", "grand", "culmin", "simz", "puzzl", "point", "she", "preternatur", "gift", "lyricist", "prodigi", "record", "rap", "releas", "earliest", "tape", "teen", "simpli", "took", "appli", "acuiti", "songcraft", "deliv", "wont", "precis", "doesnt", "just", "slash", "beat", "ribbon", "sure", "savag", "song", "like", "venom", "find", "dart", "sharp", "fastmov", "bow", "stroke", "claim", "spot", "rap", "hierarchi", "patriarchi", "see", "fit", "deni", "amid", "show", "strength", "see", "idea", "littl", "simz", "learn", "take", "thing", "step", "step", "best", "way", "plot", "cours", "retrac", "step", "easiest", "way", "labyrinth"], "date_published": ["2019-03-07T06:00:00"], "sentiment": 0.11822885719944545, "content": "Little Simz is still seeking a sense of direction on her wondrous new album GREY Area. The “grey area” in question is her mid-20s, a “strange place” she’s eager to navigate through and out of, by the sound of it. “I just wrote the album from a place of confusion,” the rapper born Simbi Ajikawo recently told Noisey, making the uncertainty of a quarter-life crisis seem like navigating the fog of war. A similar search for certainty ran through her second album, 2017’s Stillness in Wonderland, a Lewis Carroll-based introspective adventure throughout which she sought a better understanding of self. Armed with lessons from that stumble down the rabbit hole, she is far more assured on GREY Area. It is a coming-of-age marvel.\nWonderland was tangled and overwrought. The album was full of ideas and unsure how to express them. But working on GREY Area, Simz uncovered the source of her disorientation: she was taking in too much outside noise and losing her bearings. In her effort to solve the impossibility of being young and indecisive (coupled with the sensory overload of trekking across Europe), she has improved as a songwriter and storyteller. She is so grounded in her perspective that even her examinations of societal decay feel deeply personal. She buoys these probing looks into the heart of darkness with intimate glimpses from inside her life in motion. The drudgery of touring, the struggle of modern relationships, processing the trauma of a friend getting murdered, each handled with a delicate and deft touch that never dulls her piercing flows. These are the songs of a woman responding to a nebulous time by making her own way forward. “Sometimes we do not see the fuckery until we’re out of it,” she explains on “Therapy.” “Some people read The Alchemist and still never amount to shit.”\nThe entire album was produced by Simz’s childhood friend, Inflo. Using more live instruments in place of sampling—guitars, strings, pianos, and drums, mostly—they never settle into one space. No two songs on GREY Area sound the same, even when they’re similar the objectives vary, as she probes into their many grooves. “I’m JAY-Z on a bad day, Shakespeare on my worst days,” she snaps through the scuzzy bass and strings on “Offence.” “Therapy” seems to invert that song’s template for something more downtempo and cleansing. By the time the album settles into the gorgeous bed of “Flowers,” which reunites Inflo with singer and guitarist Michael Kiwanuka, Little Simz has already proven herself a master of her universe.\nAt turns both acerbic and unguarded, GREY Area feels like the grand culmination of everything Simz has been puzzling out to this point. She’s a preternaturally gifted lyricist, a prodigy who recorded her first raps at nine and released her earliest tapes in her teens; it simply took a while for her to apply that acuity to her songcraft. She delivers her wonted precision here, but she doesn’t just slash all beats to ribbons. Sure, there are still savage songs like “Venom,” which finds her darting through sharp, fast-moving bow strokes and claiming the spot in the rap hierarchy the patriarchy sees fit to deny her, but even amid those shows of strength, she sees her ideas through. Little Simz is learning that taking things step by step is the best way to plot a course, and retracing those steps is the easiest way out of the labyrinth.\n", "pptitle": ["grey", "area"]}