{"id": "PF_81", "url": "https://pitchfork.com/reviews/albums/nick-waterhouse-nick-waterhouse/", "name": ["Nick", "Waterhouse"], "description": ["theatric", "nick", "waterhous", "say", "recent", "fashion", "video", "men", "fashion", "site", "mr", "porter", "curiou", "statement", "end", "clip", "wander", "setdecor", "hous", "explain", "sartori", "style", "pacif", "coast", "americana", "think", "base", "preppi", "kid", "got", "beaten", "1960", "biker", "flicksth", "cultur", "instead", "countercultur", "insist", "he", "stage", "curiou", "come", "artist", "special", "midcenturymodern", "rocknrol", "studiou", "collis", "1950", "rockabilli", "60", "pop", "oldschool", "rb", "memphi", "new", "orlean", "new", "york", "like", "jd", "mcpherson", "eli", "paperboy", "reed", "waterhous", "revivalist", "insist", "he", "revivalist", "contradict", "extend", "dress", "code", "music", "superfici", "southern", "california", "nativ", "get", "just", "waterhous", "record", "fourth", "album", "exclus", "analog", "cours", "know", "assembl", "song", "sound", "just", "slightli", "uproot", "histor", "scene", "style", "song", "winner", "open", "duan", "eddi", "guitar", "lick", "launch", "swagger", "nugget", "garag", "rocker", "waterhous", "slightli", "sneer", "vocal", "sound", "littl", "bit", "like", "standel", "larri", "tamblyn", "there", "gronki", "sax", "solo", "spysurf", "guitar", "solo", "song", "pannostalg", "cram", "sort", "old", "familiar", "sound", "make", "sens", "assemblag", "waterhous", "scrambl", "expect", "oldschool", "music", "style", "underscor", "pure", "listen", "joy", "element", "nick", "waterhous", "realli", "make", "add", "refer", "remain", "refer", "play", "rock", "instrument", "close", "champ", "biggest", "hit", "reflex", "yell", "tequila", "mayb", "he", "good", "jobor", "sing", "open", "heart", "learn", "heartsoon", "come", "apart", "sound", "precis", "point", "fussi", "fetishist", "tast", "distort", "vocal", "buzzi", "roomi", "product", "selfconsci", "eleg", "slower", "tune", "like", "thought", "act", "wreck", "rod", "back", "vocalist", "shout", "love", "beat", "give", "distinct", "neato", "hook", "distract", "waterhous", "conflict", "ode", "masochist", "love", "heart", "song", "sound", "clever", "clever", "enemi", "soul", "clogger", "groov", "aspect", "music", "diminish", "onstag", "waterhous", "band", "cut", "loos", "shed", "rockhistor", "baggag", "make", "album", "that", "littl", "shirtandp"], "date_published": ["2019-03-11T05:00:00"], "sentiment": 0.1849507263569764, "content": "“What I do has no theatricality in it,” Nick Waterhouse says in a recent fashion video for men’s fashion site Mr. Porter. It’s a curious statement to end a clip in which he wanders around a set-decorated house and explains his sartorial style as “Pacific Coast Americana,” which I think is based on the preppy kids who always got beaten up in 1960s biker flicks—the culture instead of the counterculture. That insistence that he’s not staging anything is even more curious coming from an artist who specializes in midcentury-modern rock’n’roll, a studious collision of 1950s rockabilly, ’60s pop, and old-school R&B from Memphis, New Orleans, and New York. Like JD McPherson and Eli “Paperboy” Reed, Waterhouse is a revivalist who insists he’s not a revivalist, a contradiction that extends beyond his dress code to his music.\nSuperficially, the Southern California native gets everything just so. Waterhouse recorded his fourth album exclusively in analog, of course, and he knows how to assemble a song so that it sounds just slightly uprooted from any one historical scene or style. “Song for Winners” opens with a Duane Eddy guitar lick before launching into a swaggering Nuggets garage rocker, with Waterhouse slightly sneering his vocals to sound a little bit like the Standells’ Larry Tamblyn. There’s a gronky sax solo and a spy-surf guitar solo. The song is pan-nostalgic: crammed with all sorts of old, familiar sounds, yet they all make sense in this assemblage, more or less. Waterhouse scrambles our expectations of old-school musical styles while underscoring how much pure listening joy can be found in these elements.\nYet Nick Waterhouse can’t really make them add up to much beyond themselves. His references remain references. When he plays a rock instrumental, it’s so close to the Champs’ biggest hit that you might find yourself reflexively yelling, “Tequila!” Maybe he’s too good as his job—or, as he sings on opener “By Heart,” “Never learn something you can do by heart/Soon as you do it comes apart.” Most everything here sounds precise to the point of fussy, even fetishistic: the tasteful distortion in his vocals, the buzzy roominess of the production, the self-conscious elegance of slower tunes like “Thought & Act.” On “Wreck the Rod” he has the backing vocalists shout “Love!” at us on the beat, which gives a distinctive, neat-o hook but distracts from Waterhouse’s conflicted ode to masochistic love. At heart these songs sound clever, and clever is the enemy of soul, the clogger of grooves. Perhaps that aspect of the music diminishes onstage, when Waterhouse and his band can cut loose and shed some of that rock-historical baggage, but it makes for an album that’s a little too shirt-and-pants.\n", "pptitle": ["nick", "waterhous"]}