{"id": "PF_41", "url": "https://pitchfork.com/reviews/albums/matmos-plastic-anniversary/", "name": ["Plastic", "Anniversary"], "description": ["matmo", "album", "concept", "kindmus", "pay", "tribut", "queer", "icon", "music", "sound", "oper", "room", "music", "telepathi", "easi", "caught", "audac", "marvel", "formal", "limit", "lead", "emot", "work", "knowledg", "say", "deepli", "move", "piec", "drone", "music", "sourc", "sound", "bow", "drawn", "wire", "rat", "cageempti", "rat", "recent", "diedha", "layer", "poignanc", "enjoy", "shriek", "sound", "enjoy", "concept", "enjoy", "pictur", "contextu", "inform", "like", "titl", "felix", "rat", "put", "head", "matmo", "make", "hearreal", "hearth", "materi", "use", "music", "creation", "transform", "music", "sens", "object", "idea", "sonic", "properti", "distinct", "fingerprint", "new", "album", "plastic", "anniversari", "matmo", "tackl", "ubiquit", "materi", "name", "titl", "know", "plastic", "sound", "hand", "plastic", "mean", "fake", "music", "describ", "thought", "cheap", "artifici", "creativ", "use", "plastic", "sound", "plastic", "make", "think", "familiar", "sound", "citykid", "street", "play", "drum", "bucket", "think", "ornett", "coleman", "play", "plastic", "saxophon", "rise", "1950", "60", "afford", "later", "came", "prefer", "harsher", "tone", "felt", "sound", "closer", "human", "voic", "plastic", "leav", "space", "ingenu", "constantli", "repurpos", "constantli", "repurpos", "goe", "away", "plastic", "object", "retain", "structur", "integr", "long", "bodi", "wither", "dust", "materi", "natur", "fit", "matmo", "album", "plastic", "anniversari", "make", "realiz", "sound", "plastic", "wider", "imagin", "bounci", "percussionheavi", "tune", "group", "play", "rhythmic", "sens", "foreground", "fanfar", "polyethylen", "wast", "contain", "enlist", "drumlin", "montana", "whitefish", "high", "school", "march", "band", "roll", "beat", "garbag", "can", "cast", "musician", "play", "omin", "descend", "theme", "plastic", "horn", "album", "gorgeou", "titl", "track", "includ", "plastic", "wind", "instrument", "goe", "bittersweet", "lament", "rollick", "overtur", "track", "hint", "orchestr", "music", "silicon", "gel", "implant", "extend", "plastispher", "gj237b", "element", "earli", "electro", "percol", "sequenc", "squelchi", "lead", "melodi", "help", "catalonia", "institut", "space", "studi", "version", "track", "beam", "highpow", "radio", "tower", "direct", "name", "star", "liner", "note", "spell", "plastic", "anniversari", "gestur", "rang", "simpli", "play", "sound", "break", "bread", "record", "group", "destroy", "record", "easi", "listen", "group", "point", "thermoplast", "riot", "shield", "sourc", "record", "devic", "use", "albuquerqu", "polic", "depart", "includ", "link", "inform", "make", "riot", "shield", "inoper", "sound", "refer", "pile", "album", "mass", "possibl", "point", "idea", "explor", "later", "there", "risk", "album", "like", "receiv", "novelti", "music", "composit", "integr", "music", "engag", "pure", "level", "sound", "plastic", "anniversari", "ultim", "reson", "come", "everythingidea", "sound", "imag", "link", "album", "cover", "heartbreak", "photograph", "sea", "bird", "decay", "beach", "bodi", "gone", "plastic", "materi", "stomachand", "presum", "caus", "deathremain", "color", "sickeningli", "beauti", "like", "album", "best"], "date_published": ["2019-03-19T05:00:00"], "sentiment": 0.22004632034632035, "content": "Each Matmos album has a concept of some kind—music paying tribute to queer icons, music made from the sounds of an operating room, music made through telepathy. It’s easy to get caught up in the audacity of it all and marvel at how formal limitations can lead to such emotional work. The knowledge that, say, a deeply moving piece of drone music was sourced from the sound of a bow drawn across the wires of a rat’s cage—empty, because the rat had recently died—has several layers of poignancy. You can enjoy the shriek as sound, enjoy it as concept, enjoy it for the pictures the contextual information, like its title “For Felix (And All the Rats),” puts into your head. And on top of that, Matmos make you hear—really hear—the materials used for their music’s creation. Beyond how they are transformed into music, there is a sense that objects and ideas have sonic properties as distinctive as fingerprints. \nFor their new album, Plastic Anniversary, Matmos tackle the ubiquitous material named in the title. We already know that plastic has a sound. On the one hand, “plastic” means “fake,” and music described as such is thought to be cheap, artificial. And yet creative uses of plastic are everywhere. The sound of plastic makes me think of a familiar sound of the city—kids on the street who play drums on buckets. I think of Ornette Coleman, who played a plastic saxophone throughout his rise in the 1950s and ’60s, at first because it was more affordable, and later because he came to prefer its harsher tone, which he felt made it sound closer to the human voice. Plastic leaves space for ingenuity, because it’s constantly being repurposed, and it’s constantly being repurposed because it never goes away. Plastic objects will retain their structural integrity long after our bodies have withered into dust.\nSo the material is a natural fit for a Matmos album, and Plastic Anniversary makes you realize that the sound of plastic is wider than you might have imagined. It is bouncy, percussion-heavy, and tuneful, with the group’s playful rhythmic sense in the foreground. On “Fanfare for Polyethylene Waste Containers,” they enlisted the drumline from Montana’s Whitefish High School Marching Band for a rolling beat on garbage cans, while a cast of musicians plays an ominous descending theme on plastic horns. The album’s gorgeous title track also includes plastic wind instruments but goes from a bittersweet lament to a rollicking overture. These tracks hint at orchestral music, while “Silicone Gel Implant” and “Extending the Plastisphere to GJ237b” both have elements of early electro, with percolating sequencers and squelchy lead melodies.\nWith the help of Catalonia Institute of Space Studies, a version of the latter track was beamed from a high-power radio tower in the direction of the named star system. The liner notes spelling out the how and why of Plastic Anniversary show gestures that range from simply playful (the sounds on “Breaking Bread” were recorded as the group destroyed records made by the easy listening group of the same name) to the pointed (“Thermoplastic Riot Shield” was sourced from recordings of a device used by the Albuquerque Police Department, and includes links to information about how to make riot shields inoperable), and as the sounds and references pile up the album becomes a mass of possibilities, each pointing toward ideas to explore in more detail later.\nThere’s always a risk that an album like this one will be received as novelty music, but the compositional integrity is there, and the music is engaging purely on the level of sound. But Plastic Anniversary’s ultimate resonance comes when you take in everything—ideas, sounds, images, links. On the album’s back cover is a heartbreaking photograph of a sea bird decaying on a beach, its body almost gone while the plastic material that had been in its stomach—and presumably had caused its death—remains. The colors are sickeningly beautiful, like this album at its best.\n", "pptitle": ["plastic", "anniversari"]}