{"id": "PF_29", "url": "https://pitchfork.com/reviews/albums/nilufer-yanya-miss-universe/", "name": ["Miss", "Universe"], "description": ["way", "nilfer", "yanya", "career", "map", "king", "krule", "young", "london", "arriv", "stark", "bruis", "elegi", "led", "electr", "guitar", "urchin", "cri", "quickli", "eclips", "earli", "promis", "archi", "marshal", "swerv", "solitari", "murki", "yanya", "debut", "album", "shock", "desol", "confront", "adventur", "poprock", "crucibl", "mitski", "puberti", "2", "catalyst", "commun", "outpour", "spark", "adrenalin", "anxieti", "mixtur", "raw", "refin", "guitar", "fuzz", "mingl", "tinselli", "synth", "glitter", "bluesi", "disaffect", "startl", "voic", "song", "hear", "yanya", "play", "telephon", "oper", "well", "hotlin", "call", "wway", "health", "concept", "satir", "skit", "eventu", "fizzl", "theyr", "quit", "funni", "time", "break", "fantast", "sequenc", "essenti", "album", "undersel", "bit", "yanya", "lyric", "miss", "univers", "arent", "look", "extern", "forc", "easi", "affirm", "figur", "kind", "intens", "hunger", "allow", "feel", "young", "woman", "got", "learngot", "realiz", "meansgot", "earngot", "decid", "sing", "angel", "waltz", "guitar", "gain", "intens", "pressur", "gaug", "blow", "yanya", "write", "gorgeous", "seduct", "sensat", "matter", "effect", "deep", "underwat", "breathelet", "soakchas", "shade", "love", "love", "broke", "sing", "babi", "blu", "cloudi", "medit", "build", "subtli", "euphor", "gospel", "hous", "tear", "doesnt", "hold", "shell", "lie", "pool", "els", "blood", "she", "get", "high", "just", "heat", "heat", "rise", "sing", "snatch", "gasp", "phrase", "fizz", "drum", "machin", "effect", "decad", "panicridden", "anxieti", "attack", "sauna", "songwrit", "textur", "palac", "wonder", "yanya", "lyric", "portray", "prone", "wallow", "forbidden", "emot", "arrang", "circumspect", "toy", "impecc", "resist", "releas", "head", "lurch", "gimletey", "composur", "cataclysm", "panic", "use", "climax", "music", "surrog", "emot", "track", "end", "echo", "spacious", "yanya", "earli", "materi", "shape", "album", "envelop", "dynam", "like", "safeti", "net", "exud", "simmer", "sad", "built", "nimbl", "drum", "machin", "seamless", "pop", "melodi", "like", "paradis", "buoy", "yanya", "worri", "easygo", "saxophon", "motif", "courtesi", "improb", "name", "sidekick", "jazzi", "bobbi", "control", "mood", "miss", "univers", "like", "yanya", "adept", "wound", "lament", "desper", "falsetto", "whip", "exhilar", "yelp", "yank", "ripcord", "insid", "lung", "power", "moment", "voic", "hunger", "desper", "moment", "hunger", "empti", "im", "wire", "want", "thing", "yanya", "sing", "sullenli", "song", "rel", "unadorn", "heavyweight", "champion", "year", "slash", "choppi", "chord", "teas", "final", "cathart", "payoff", "yanya", "song", "reflect", "woman", "who", "uncertain", "reveal", "world", "allur", "miss", "univers", "augur", "brighter", "thing", "come"], "date_published": ["2019-03-22T05:00:00"], "sentiment": 0.12414918414918413, "content": "In some ways, Nilüfer Yanya’s career maps onto that of King Krule: Both young Londoners arrived with stark, bruised elegies led by their electric guitar and urchin cries; both quickly eclipsed their early promise. But where Archy Marshall swerved towards solitary murkiness, Yanya, on her debut album, has shocked her desolate confrontations into some of the most adventurous pop-rock crucibles since Mitski’s Puberty 2. They are catalysts for communal outpouring that spark with adrenaline and anxiety, a mixture of the raw and the refined, her guitar fuzz mingling with tinselly synth glitter and the bluesy disaffection of her startling voice.\nBetween some songs, you hear Yanya playing the part of a telephone operator for a wellness hotline she has called WWAY Health, the concept of which, across five satirical skits, eventually fizzles out. They’re quite funny the first time, but they break up what is otherwise a fantastically sequenced and always essential album. They undersell it a bit, too: Yanya’s lyrics on Miss Universe aren’t so much about looking to external forces for easy affirmation as they are figuring out the kind of intensity and hunger that she can allow herself to feel as a young woman: “Got to learn/Got to realize what this means/Got to earn/Got to decide who to please,” she sings on “Angels,” her waltzing guitar gaining intensity before the pressure gauge blows.\nYanya writes gorgeously about the seduction of sensation, no matter its side effects: “Deep underwater I breathe/Let me soak/Chasing the shades of the love that we made, of the love that we broke,” she sings on “Baby Blu,” a cloudy meditation that builds into subtly euphoric gospel house. On “Tears,” if someone doesn’t hold her back, she’ll be “lying in a pool of someone else’s blood.” She’s “getting high just from the heat” in “Heat Rises,” singing in snatched, gasped phrases over a fizzing drum machine, the effect as decadent yet panic-ridden as an anxiety attack in a sauna. Her songwriting is a textural palace of wonders.\nWhere Yanya’s lyrics portray her as someone prone to wallowing in forbidden emotions, her arrangements are more circumspect, toying impeccably with resistance and release. “In Your Head” lurches between gimlet-eyed composure and cataclysmic panic. She never uses climaxes as a musical surrogate for emotion. A few tracks towards the end echo the spaciousness of Yanya’s early material and shape the album’s enveloping dynamic as a whole. Others, like “Safety Net,” exude a simmering sadness built from nimble drum machines and seamless pop melody, or, like “Paradise,” buoy Yanya’s worries with easygoing saxophone motifs courtesy of her improbably named sidekick, Jazzi Bobbi.\nNothing controls the mood of Miss Universe like Yanya herself. She is adept with both a wounded lament and a desperate falsetto. Sometimes she whips between the two with exhilarating yelps, as if someone yanked a ripcord inside her lungs. In powerful moments, her voice is full of hunger; in desperate moments, that hunger empties out. “I’m still wired to want these things,” Yanya sings sullenly on the last song, the relatively unadorned “Heavyweight Champion of the Year,” slashing out choppy chords that tease one final cathartic payoff. Yanya’s songs reflect a woman who’s uncertain of how much of herself to reveal to the world. That is both the allure of Miss Universe and what augurs even brighter things to come.\n", "pptitle": ["miss", "univers"]}