{"id": "RS_93", "url": "https://www.rollingstone.com/music/music-album-reviews/review-rapper-mick-jenkins-elevates-his-free-associative-game-on-pieces-of-a-man-749540/", "name": ["Review:", "Rapper", "Mick", "Jenkins", "Elevates", "His", "Free-Associative", "Game", "on", "‘Pieces", "of", "a", "Man’", "–", "Rolling", "Stone"], "description": ["chicago", "mc", "mick", "jenkin", "rap", "hermit", "emerg", "feel", "readi", "drop", "sprawl", "project", "bariton", "philosophi", "freeform", "wordplay", "broke", "2014", "contempl", "mixtap", "water", "s", "jenkin", "exist", "outsid", "gener", "rap", "univers", "collabor", "small", "roster", "underground", "mc", "espous", "time", "sanctimoni", "view", "selfimprov", "ill", "societi", "shallow", "rapper", "jenkin", "voicealtern", "boom", "restrainedsound", "like", "sort", "doomsday", "robot", "aid", "spars", "unconvent", "product", "steep", "jazz", "ambient", "music", "convincingli", "play", "rap", "savior", "chosen", "awaken", "mass", "larg", "hunk", "mass", "idea", "jenkin", "intellig", "commit", "craft", "work", "listen", "fulllength", "project", "singl", "sit", "feel", "labori", "inspir", "like", "favorit", "colleg", "professor", "kept", "lectur", "hour", "class", "suppos", "end", "2016", "album", "heal", "compon", "overlook", "uneven", "stuck", "make", "separ", "artist", "statement", "water", "s", "lose", "fan", "base", "devot", "result", "album", "lack", "ident", "piec", "man", "jenkin", "second", "album", "find", "loosen", "exert", "selfcontrol", "rhyme", "piec", "dexter", "learn", "layer", "clever", "he", "take", "serious", "process", "have", "fun", "there", "proselyt", "sure", "he", "stop", "tri", "convinc", "superior", "knowledg", "talent", "prove", "showandtel", "rap", "barcelona", "subtl", "shift", "nonetheless", "make", "piec", "man", "confid", "listen", "project", "year", "like", "chicago", "peer", "jenkin", "rap", "sound", "like", "spoken", "word", "poem", "fit", "borrow", "titl", "album", "poet", "gil", "scottheron", "1971", "debut", "spirit", "scottheron", "jenkin", "master", "kind", "hiphop", "freeassoci", "breathlessli", "string", "long", "run", "metaphor", "bite", "wordplay", "theyll", "pop", "collar", "long", "play", "roleim", "poppin", "bottl", "starchnigga", "know", "fold", "rap", "soft", "porn", "frame", "commit", "keep", "real", "lyric", "run", "risk", "feel", "overthought", "piec", "man", "except", "talent", "mick", "verg", "dormroom", "thought", "cottonmouth", "soon", "enoughwak", "realiz", "moon", "cringeworthi", "high", "muse", "fuck", "woke", "consciou", "bed", "heart", "right", "place", "elev", "lyric", "aspir", "steer", "right", "interpol", "poem", "gwendolyn", "brook", "rap", "blockchain", "standout", "gwedolynn", "appreci", "vibey", "nocturn", "instrument", "detroit", "legend", "black", "milk", "understood", "ride", "impecc", "kaytranada", "beat", "power", "ive", "drink", "freonim", "corner", "feel", "like", "deionwith", "cowboy", "dont", "speak", "snake", "malfoy", "spit", "giddili", "piec", "man", "lag", "usual", "productionsinc", "water", "s", "jenkin", "voic", "subject", "matter", "lent", "dusti", "headnod", "beat", "work", "isol", "derail", "sens", "projectlength", "momentum", "unless", "your", "stone", "seventeen", "song", "boombap", "drum", "drive", "weather", "old", "head", "crazi", "piec", "man", "switch", "thing", "stay", "interest", "thank", "expert", "live", "instrument", "thempeopl", "definit", "type", "album", "benefit", "execut", "produc", "tighten", "screw", "maintain", "sens", "focu", "doe", "interest", "jenkin", "particularli", "provid", "window", "battl", "desir", "need", "reach", "wider", "audienc", "time", "piec", "man", "rap", "reach", "frenzi", "vocal", "simmer", "choru", "sweep", "like", "high", "tide", "he", "conscious", "censor", "neurosesmostli", "weedin", "attempt", "make", "access", "dont", "trynna", "mostso", "digressi", "downi", "fade", "black", "rap", "ghost", "voic", "liter", "fade", "piec", "man", "engag", "spoken", "sit", "close", "jenkin", "tri", "assembl", "myriad", "perspectivesdrug", "sober", "neurot", "eas", "selfright", "vulnerableinto", "cohes", "like", "rap", "best", "he", "capabl", "spitter", "songwrit", "he", "realli", "tri", "need", "pollin", "valid", "assur", "inevit", "return", "hide", "place", "occasion", "poke", "head", "space", "grow"], "date_published": ["2018-10-31T20:54:31+00:00"], "sentiment": 0.1462625287625287, "content": "Chicago MC Mick Jenkins has always been something of a rap hermit, emerging when he feels ready and dropping sprawling projects of baritone philosophy and freeform wordplay. When he broke out in 2014 with the contemplative mixtape The Water (S), Jenkins seemed to exist outside of the general rap universe: he collaborated with a small roster of underground MCs while espousing at times sanctimonious views on self-improvement, the ills of society and the shallowness of other rappers. Jenkins' voice--alternatively booming and restrained--sounded like some sort of doomsday robot' aided by sparse, unconventional production steeped in jazz and ambient music; he convincingly played the part of rap savior chosen to awaken the masses, even if a large hunk of the masses had no idea who he was. \r\n\r\nBut Jenkins' intelligence and commitment to craft can work against him. Listening to his full-length projects in a single sitting can sometimes feel laborious rather than inspiring, like if your favorite college professor kept lecturing hours after class was supposed to end. His 2016 album The Healing Component was overlooked and uneven; he seemed stuck between making a separate artistic statement from The Water (S) and losing the fan base that devoted themselves to it, which resulted in an album that often lacked an identity. Pieces of a Man, Jenkins' second album, finds him loosening up, or at least exerting more self-control. His rhymes on Pieces, as always, are dexterous and learned, layered and clever, but he’s taking himself less seriously, and in the process having some fun. There’s still proselytizing, to be sure, but he’s stopped trying to convince others of his superior knowledge and talent. “I be on my show and prove, not my show-and-tell,” he raps on “Barcelona.” It’s a subtle shift that nonetheless makes Pieces of a Man his most confident and listenable project in years. \r\n\r\nLike many of his Chicago peers, Jenkins' raps sound like they could be spoken word poems, and it's fitting that he borrowed the title for this album from poet Gil Scott-Heron's 1971 debut. In the spirit of Scott-Heron, Jenkins is a master of a kind of hip-hop free-association, breathlessly stringing together long runs of metaphors and biting wordplay. “They’ll pop your collar as long as you play the role/I’m poppin' bottles of starch/niggas know I can’t fold” he raps on “Soft Porn,” framing his commitment to keeping it real. His lyrics have always run the risk of feeling overthought, and Pieces of a Man is no exception; for all his talent, Mick sometimes verges into dorm-room thoughts (“cottonmouth get you soon enough/wake up and realize the moon is us”) and cringeworthy high musings (“Fuck is woke if you conscious but still in the bed”). But his heart is in the right place, and his elevated lyrical aspirations steer him right more often than not. He interpolates a poem by Gwendolyn Brooks and raps about blockchain on the standout “Gwedolynn’s Appreciation” over a vibey, nocturnal instrumental by Detroit legend Black Milk, while on “Understood,” he rides an impeccable Kaytranada beat to show off his full power. “I see the fire, I’ve been drinking Freon/I’m on the corner, feel like Deion/With these Cowboys, don’t speak snake with these Malfoys,” he spits giddily.   \r\n\r\nWhen Pieces of a Man lags, it’s usually due to its production--since The Water (S), Jenkins' voice and subject matter have lent themselves to dusty, head-nodding beats that work well in isolation but derail any sense of project-length momentum. Unless you’re very stoned, seventeen songs of boom-bap drums will drive even the most weathered old head crazy, and while Pieces of a Man switches things up enough to stay interesting, thanks mostly to the expert live instrumentation of THEMpeople, it's definitely the type of album that could have benefitted from an executive producer tightening screws and maintaining a sense of focus. What does keep us interested is Jenkins himself, particularly when he provides a window into the battles between his desire to be himself and his need to reach a wider audience. Several times on Pieces of a Man, his rapping reaches a frenzy, only for the vocals to simmer and the chorus to sweep in like a high tide. He’s consciously censoring his neuroses--mostly with weed--in an attempt to make himself more accessible. “But I don’t be trynna do the most/so I digress/I take it down/I fade to black…” he raps on “Ghost,” before his voice literally fades out. \r\n\r\nOn Pieces of a Man, we’re being engaged with rather than spoken down to, sitting closely by Jenkins' side as he tries to assemble his myriad perspectives--drugged and sober, neurotic and at ease, self-righteous and vulnerable--into something cohesive. Like some of rap’s best, he’s a more capable spitter than he is a songwriter, but he’s never really tried to be the latter. Rather, he needs “pollination not your validation,” or the assurance that, even when he inevitably returns to whatever hiding place he occasionally pokes his head out from, there will still be space for him to grow.", "pptitle": ["review", "rapper", "mick", "jenkin", "elev", "freeassoci", "game", "piec", "man", "roll", "stone"]}