{"id": "RS_29", "url": "https://www.rollingstone.com/music/music-album-reviews/maren-morris-girl-album-review-803005/", "name": ["Review:", "Maren", "Morris,", "‘Girl’", "–", "Rolling", "Stone"], "description": ["maren", "morri", "bone", "countri", "brightest", "new", "upstart", "year", "ago", "majorlabel", "debut", "hero", "introduc", "texa", "songwrit", "sharp", "eye", "velvet", "voic", "mean", "streak", "especi", "came", "irrever", "attitud", "nashvil", "pieti", "church", "profan", "hymn", "hit", "highway", "roll", "window", "blast", "hank", "william", "car", "radio", "drunk", "girl", "dont", "80", "merced", "morri", "sound", "fresh", "wri", "electr", "hiphop", "rb", "downhom", "kind", "voic", "peopl", "felt", "like", "theyd", "wait", "year", "hear", "titl", "track", "new", "girl", "set", "bar", "high", "right", "away", "ambiti", "eccentr", "song", "she", "emot", "powerhous", "driven", "jag", "rock", "guitar", "man", "shit", "unflatt", "begin", "launch", "sisterli", "pep", "talk", "girl", "dont", "hang", "head", "lowdont", "lose", "halo", "sing", "case", "miss", "beyonc", "refer", "drop", "explicit", "echo", "halo", "bridg", "girl", "ventur", "far", "countri", "chug", "guitar", "riff", "come", "earli", "new", "wave", "record", "car", "motel", "just", "add", "song", "bigheart", "appeal", "girl", "suggest", "album", "morri", "make", "pop", "she", "stretch", "music", "go", "selena", "gomezcamila", "cabello", "vibe", "got", "tast", "10", "year", "middl", "surpris", "edm", "hit", "zedd", "grey", "clearli", "whet", "pop", "appetit", "high", "point", "girl", "major", "emot", "reach", "song", "follow", "style", "church", "sing", "music", "memori", "what", "time", "machinei", "springsteen", "teenag", "dream", "weird", "footnot", "morri", "yearn", "good", "old", "day", "coldplay", "play", "club", "favorit", "peopl", "countryrock", "hellrais", "brother", "osborn", "lift", "cup", "blow", "paycheck", "weed", "booz", "everybodi", "drink", "tuesday", "nightmix", "liquor", "crystal", "light", "favorit", "peopl", "flavor", "unexpect", "nod", "zz", "top", "eighti", "synthrock", "phase", "tough", "talk", "speak", "piec", "dont", "im", "toldshut", "sing", "hell", "wont", "despit", "flavor", "there", "lot", "salt", "vocal", "time", "song", "call", "shade", "shadefre", "piano", "ballad", "see", "color", "love", "she", "write", "happi", "midtempo", "love", "song", "feel", "love", "scrappi", "attitud", "hero", "chang", "hard", "especi", "bland", "homili", "clog", "album", "second", "half", "morri", "come", "winner", "like", "make", "send", "lusti", "voicemail", "flame", "plane", "know", "phone", "beg", "come", "soon", "touch", "best", "behavior", "lp", "liveliest", "moment", "come", "get", "line"], "date_published": ["2019-03-05T17:40:55+00:00"], "sentiment": 0.14811367644700976, "content": "Maren Morris made her bones as one of country’s brightest new upstarts three years ago with her major-label debut, Hero. She introduced herself as a Texas songwriter with a sharp eye, a velvet voice and a mean streak, especially when it came to her irreverent attitude toward Nashville pieties. “My Church” was her profane hymn about hitting the highway, rolling down the windows and blasting Hank Williams on the car radio. From “Drunk Girls Don’t Cry” to “80s Mercedes,” Morris sounded fresh, wry, electric, full of hip-hop and R&B, yet down-home — the kind of voice people felt like they’d been waiting years to hear.\r\n\r\nThe title track from her new one, Girl, sets the bar high right away. It’s the most ambitious and eccentric song she’s done yet, an emotional powerhouse driven by jagged rock guitar. “Man, that shit’s unflattering,” she begins, before launching into a sisterly pep talk. “Girl, don’t you hang your head low/Don’t you lose your halo,” she sings — and in case anyone misses the Beyoncé reference, she drops an explicit echo of “Halo” into the bridge. “Girl” ventures far from country: That chugging guitar riff could come from early New Wave records by the Cars or the Motels. But that just adds to the song’s bighearted appeal.\r\n\r\nAs “Girl” suggests, this album is where Morris makes her pop move. She’s stretching out musically, going for more of a Selena Gomez-Camila Cabello vibe. She got a taste of the Top 10 last year with “The Middle,” her surprise EDM hit with Zedd and Grey, which clearly whetted her pop appetite. The high points on Girl have major emotional reach. “A Song for Everything” follows in the style of “My Church,” as she sings about music memories: “What’s your time machine?/Is it Springsteen or ‘Teenage Dream’?” (Weird footnote: Morris yearns for the good old days “back when Coldplay still played clubs.”)\r\n\r\n“All My Favorite People” is a country-rock hell-raiser with the Brothers Osborne, lifting a cup to everyone out there who blows their paycheck on weed and booze. “Not everybody drinks on a Tuesday night/Mixes their liquor with Crystal Light” — but all her favorite people do. “Flavor” is an unexpected nod to ZZ Top’s Eighties synth-rock phase, with some tough talk: “I speak my piece, don’t do what I’m told/‘Shut up and sing’? Well, hell no, I won’t.”\r\n\r\nDespite “Flavor,” there’s a lot less salt in her vocals this time. Even the song called “Shade” is shade-free. (It’s a piano ballad about seeing all the colors of love.) For the most part, she’s writing happy midtempo love songs about “The Feels.” If you loved her scrappy attitude on Hero, the change can be hard to take — especially the bland homilies that clog the album’s second half. But when Morris is on, she can come up with a winner like “Make Out With Me,” where she sends a lusty voicemail while her flame is on the plane, knowing his phone is off, but begging him to come over as soon as he touches down. She might be on her best behavior on this LP, but the liveliest moments come when she gets out of line.", "pptitle": ["review", "maren", "morri", "girl", "roll", "stone"]}