{"id": "RS_89", "url": "https://www.rollingstone.com/music/music-album-reviews/lil-peep-come-over-when-youre-sober-pt-2-754140/", "name": ["Lil", "Peep’s", "‘COWYS,", "Pt.", "2’", "Is", "A", "Glimpse", "of", "a", "Rockstar", "–", "Rolling", "Stone"], "description": ["artist", "sens", "death", "gnaw", "presenc", "percol", "novemb", "16", "year", "lil", "peep", "die", "overdos", "age", "21", "halfsing", "halfrap", "musician", "ascend", "presenc", "soundcloud", "right", "platform", "crest", "hit", "mainstream", "gain", "pseudofam", "infami", "detail", "drugfuel", "exist", "emot", "wall", "tattoo", "color", "hair", "moment", "potenti", "move", "past", "pass", "lil", "peep", "start", "chafe", "confin", "launch", "popular", "conscious", "longer", "adequ", "held", "grow", "ambit", "lil", "peep", "posthum", "fulllength", "releas", "requiem", "gustav", "gu", "elijah", "hr", "examin", "musician", "couldv", "come", "your", "sober", "pt", "2", "rap", "album", "pastich", "2000", "pop", "punk", "emo", "rock", "think", "biggi", "life", "death", "grew", "worship", "good", "charlott", "chemic", "romanc", "ultim", "reward", "tragedi", "cowi", "pt", "2", "posit", "nascent", "star", "sing", "impend", "unknown", "fate", "artist", "come", "peep", "variou", "collabor", "manag", "lioniz", "young", "figur", "past", "grow", "influenc", "sketch", "compel", "vision", "focus", "pop", "sheen", "soundcloud", "rapper", "grow", "distinct", "death", "mainli", "peep", "envis", "themat", "center", "album", "long", "beach", "rapper", "obsess", "document", "thought", "like", "pass", "specter", "escap", "lyric", "like", "die", "dont", "wanna", "die", "right", "tri", "suicid", "stop", "mere", "snapshot", "peep", "larger", "frame", "mind", "grant", "peep", "drew", "morbid", "inspir", "especi", "debut", "lp", "2017", "come", "your", "sober", "releas", "use", "surg", "guitar", "trap", "drum", "build", "album", "bombast", "sequel", "lean", "somber", "repriev", "dark", "essenti", "dark", "form", "reflect", "addict", "heartbreak", "trio", "runaway", "sex", "ex", "album", "high", "point", "voic", "travel", "gamut", "long", "loss", "sing", "need", "urgenc", "energi", "rockstar", "boil", "surfac", "peep", "croon", "fuck", "like", "lyin", "deathb", "feel", "sudden", "empti", "major", "weak", "obviou", "peep", "isnt", "mightv", "grown", "music", "themat", "monotoni", "subject", "matter", "grate", "second", "half", "album", "monoton", "deliveri", "limit", "vocal", "rang", "dont", "switch", "gear", "cours", "album", "entir", "project", "concern", "suicid", "thought", "self", "loath", "insular", "prison", "captiv", "vari", "thank", "lp", "architect", "smokeasac", "georg", "astasio", "admir", "job", "creat", "sonic", "palett", "compens", "hole", "wasnt", "peep", "vocal", "sound", "dynam", "clear", "dont", "sacrific", "natur", "raw", "product", "hint", "arenarock", "futur", "fan", "sore", "wit", "accomplish", "especi", "impress", "consid", "theyv", "success", "evolv", "peep", "sound", "work", "record", "time", "period", "come", "your", "sober", "pt", "1", "experi", "dont", "work", "white", "girl", "xxxtentacion", "featur", "fall", "come", "your", "sober", "pt", "2", "touch", "monument", "love", "death", "lil", "peep", "mark", "end", "era", "cowi", "pt", "2", "type", "record", "moment", "deserv", "peep", "estat", "collabor", "friend", "way", "transmut", "love", "loss"], "date_published": ["2018-11-09T19:48:54+00:00"], "sentiment": 0.13906684027777777, "content": "Some artists seem to sense death. Sometimes they see it in others, but more often that gnawing presence percolates within themselves. On November 16 of last year, Lil Peep died of an overdose at the age of 21.\r\n\r\nThe half-singing, half-rapping musician was an ascendant presence on SoundCloud right as the platform crested before hitting the mainstream. He was gaining pseudo-fame and infamy for detailing his drug-fueled existence and emotions from behind a wall of tattoos and colored hair. He was of the moment, but potentially moving past it. Before he passed, Lil Peep was already starting to chafe. The confines of what had launched him into the popular consciousness no longer adequately held his growing ambition.\r\n\r\nLil Peep’s first posthumous full-length release is a requiem for who Gustav \"Gus\" Elijah Åhr was and an examination of the musician he could've been, and was becoming. Come Over When You’re Sober, Pt. 2 is less a rap album and more a pastiche of 2000s pop punk and emo rock, think Biggie’s Life After Death if he grew up worshipping Good Charlotte and My Chemical Romance.\r\n\r\nThe ultimate reward and tragedy of COWYS, Pt. 2 is how it positions a nascent star singing about his impending and unknown fate even as he was artistically coming into his own. Peep’s various collaborators manage to lionize the young figure’s past and growing influence, while sketching a compelling vision of what a more focused, pop sheen could do for a SoundCloud rapper growing out of that distinction.\r\n\r\nDeath, mainly the one Peep envisioned for himself, is the thematic center of the album. The Long Beach rapper obsessively documents his thoughts like passing is a specter he can’t escape. Lyrics like, “I was dying and nobody was there,” “I don't wanna die alone right now,” and “If I try suicide, would you stop me,” are mere snapshots of Peep’s larger frame of mind. Granted Peep often drew on the morbid for inspiration, especially on his debut LP, 2017's Come Over When You’re Sober. But where that release used surging guitars and trap drums to build an album of bombast, its sequel leans on the somber side. The only reprieve from the darkness is, essentially, more darkness in the form reflections on addiction and heartbreak.\r\n\r\nThe trio of “Runaway,” “Sex With My Ex,” and “Cry Alone” is the album’s high point. His voice travels the gamut between longing and loss; the singing has a needed urgency and energy. There is a rockstar boiling to the surface as Peep croons, “Fuck me like we're lyin' on our deathbed, I can feel that sudden emptiness.”\r\n\r\nThe major weaknesses here are obvious. Since Peep isn't here we can't find out how he might've grown, musically and thematically. The monotony of the subject matter grates by the second half of the album. His monotone delivery and limited vocal range don’t ever switch gears over the course of the album. An entire project concerned with suicidal thoughts and self loathing becomes an insular prison, captivating, but not varied.\r\n\r\nThankfully, the LP's architects — Smokeasac, George Astasio — do an admirable job of creating a sonic palette that compensates for the holes he wasn’t here to fill. Peep's vocals sound dynamic, clear, but don't sacrifice his natural rawness. The production hints at an arena-rock future fans will sorely never get to witness. Their accomplishment is especially impressive, considering they've successfully evolved Peep's sound while working with recordings made during the same time period as Come Over When You’re Sober, Pt. 1. Some of the experiments don't work, namely \"White Girl\" and the XXXTentacion featuring \"Falling Down,\" but on the whole Come Over When You’re Sober, Pt. 2 is a touching monument made with love.\r\n\r\nThe death of Lil Peep marks an end of an era and COWYS, Pt. 2 is the type of record that moment deserved. Somehow, Peep's estate, collaborators, and friends found a way to transmute love through the loss.", "pptitle": ["lil", "peep", "cowi", "pt", "2", "glimps", "rockstar", "roll", "stone"]}