{"id": "RS_81", "url": "https://www.rollingstone.com/music/music-album-reviews/pistol-annies-interstate-gospel-album-review-751117/", "name": ["Review:", "Pistol", "Annies’", "‘Interstate", "Gospel’", "–", "Rolling", "Stone"], "description": ["pistol", "anni", "trio", "singersongwrit", "miranda", "lambert", "angaleena", "presley", "ashley", "monro", "won", "huge", "critic", "prais", "2013", "lp", "anni", "wri", "collect", "song", "drink", "divorc", "album", "releas", "critic", "shift", "countri", "jumpstart", "recordbreak", "success", "florida", "georgia", "line", "nelli", "cruis", "hit", "radio", "just", "week", "anni", "ensu", "year", "mainstream", "countri", "embrac", "templat", "cruis", "offer", "male", "voic", "sing", "parti", "women", "slick", "popsavvi", "product", "etho", "pistol", "anni", "steep", "classicist", "countri", "rife", "despair", "misfortun", "rootsi", "arrang", "welcom", "mainstream", "confin", "genr", "time", "solut", "doubl", "root", "blend", "theyv", "hone", "better", "past", "decad", "merg", "monro", "east", "tennesse", "bluegrass", "root", "presley", "hardscrabbl", "kentucki", "countryrock", "lambert", "texa", "honkytonk", "paper", "anni", "latest", "like", "predecessor", "focus", "type", "smalltown", "domest", "drama", "group", "known", "song", "popul", "men", "women", "struggl", "prescript", "medic", "marriag", "midlif", "crise", "malais", "medic", "marijuana", "unlik", "past", "effort", "narr", "reli", "heavi", "dose", "dark", "humor", "song", "interst", "gospel", "convey", "intim", "person", "urgenc", "result", "housewif", "harmoni", "blue", "best", "year", "life", "lambert", "haunt", "postdivorc", "balladri", "masterpiec", "sharplyrend", "sketch", "bruis", "heart", "shaken", "soul", "amount", "group", "move", "work", "date", "success", "lp", "3", "chalk", "songwrit", "sharper", "deeper", "funnier", "song", "like", "wife", "commissari", "follow", "cryingwhilelaugh", "patho", "john", "prine", "tell", "stori", "bleak", "misfortun", "shrug", "smirk", "spit", "trademark", "onelin", "old", "mose", "basket", "case", "sparingli", "precis", "moment", "sadsack", "narr", "use", "pickmeup", "group", "doe", "write", "person", "like", "cheyenn", "ode", "woman", "unencumb", "menial", "job", "eager", "men", "end", "show", "charact", "past", "year", "monro", "presley", "lambert", "live", "earthshak", "lifechang", "marriag", "divorc", "give", "birth", "theyv", "spent", "career", "deftli", "document", "song", "interst", "anni", "sing", "write", "heartbreak", "etern", "love", "freshli", "form", "famili", "recent", "broken", "one", "album", "reflect", "stir", "close", "materi", "newlysingl", "manifesto", "got", "chang", "newlysingl", "lament", "leaver", "lullabi", "there", "thing", "leav", "monro", "sing", "devast", "clariti", "just", "love", "somebodi", "affect", "element", "interst", "gospel", "group", "sharpen", "focu", "ancestri", "lineag", "way", "famili", "tradit", "trauma", "patriarch", "practic", "pass", "gener", "milkman", "move", "sketch", "motherdaught", "relationship", "deliv", "profound", "empathi", "album", "centerpiec", "5", "acr", "turnip", "bluegrass", "blue", "steep", "sixti", "girlgroup", "pop", "employ", "famili", "ambigu", "troubl", "past", "subtl", "metaphor", "haunt", "legaci", "american", "south", "song", "presley", "lambert", "conjur", "bobbi", "gentri", "ode", "billi", "joe", "band", "king", "harvest", "sure", "come", "kacey", "musgrav", "merri", "round", "sketch", "rough", "detail", "famili", "long", "plagu", "buri", "histori", "gener", "shame", "lambert", "sing", "grandaddi", "14", "song", "interst", "gospel", "tell", "tightlywoven", "stori", "adult", "restless", "bittersweet", "farewel", "hardwon", "independ", "album", "individu", "collect", "career", "pistol", "anni", "interest", "sing", "burn", "exhusband", "hous", "burn", "dull", "live", "order", "start", "anew", "live", "wild", "exhaust", "pistol", "anni", "pay", "cost", "feel", "free"], "date_published": ["2018-11-02T21:35:57+00:00"], "sentiment": 0.08114478114478112, "content": "Pistol Annies — the trio of singer-songwriters Miranda Lambert, Angaleena Presley and Ashley Monroe — won huge critical praise for their 2013 LP Annie Up, a wry collection of songs about drinking and divorce.\r\n\r\nBut the album was released during a critical shift in country jump-started by the record-breaking success of Florida Georgia Line and Nelly’s “Cruise,” which hit radio just a few weeks before Annie Up. In the ensuing five years, mainstream country has mostly embraced the template that “Cruise” offered: male voices singing about partying and women over slick, pop-savvy production. The ethos of the Pistol Annies, who steep their classicist country — rife with despair and misfortune — in rootsy arrangements, has not been welcomed within the mainstream confines of the genre in some time.\r\n\r\nTheir solution? Doubling down on the roots blend they’ve honed over the better part of the past decade, merging Monroe’s East Tennessee bluegrass roots, Presley’s hardscrabble Kentucky country-rock and Lambert’s Texas honky-tonk. On paper, the Annies’ latest, like its predecessors, focuses on the type of small-town domestic drama for which the group has become known. Their songs are populated by men and women struggling with prescription medication, marriage, mid-life crises and malaise (and medicating with marijuana).\r\n\r\nBut unlike past efforts, where their narratives relied on a heavy dose of dark humor, the songs on Interstate Gospel convey a much more intimate personal urgency. The result, from the housewife harmony blues on “Best Years of My Life” to Lambert’s haunting post-divorce balladry on “Masterpiece,” is a sharply-rendered sketch of bruised hearts and shaken souls that amounts to the group’s most moving work to date.\r\n\r\nMuch of the success of LP 3 can be chalked up to the songwriting, which is sharper, deeper and funnier than ever. Songs like \"When I Was His Wife\" and \"Commissary\" follow the crying-while-laughing pathos of John Prine, telling stories of bleak misfortune with a shrugging smirk. When they spit out a trademark one-liner (\"even old Moses was a basket case\"), they do so sparingly, often in the precise moment when their otherwise sad-sack narratives could use a pick-me-up. And when the group does write in the third person, like \"Cheyenne,\" an ode to a woman unencumbered by menial jobs and eager men, they end up showing more of themselves in their characters than ever before.\r\n\r\nOver the past five years, Monroe, Presley and Lambert have each lived out some of the earth-shaking life-changes — marriage, divorce, giving birth — that they’ve spent their careers deftly documenting in song, and on Interstate, the Annies are singing and writing from the other side of heartbreak and eternal love, freshly formed families and recently broken ones. This album reflects a stirring closeness to their material, from the newly-single manifesto “Got My Name Changed Back” to the newly-single lament “Leavers Lullaby.” “There’d be no such thing as leaving,” Monroe sings with devastating clarity on the latter, “if just loving somebody was enough.”\r\n\r\nBut the most affecting element of Interstate Gospel may be the group’s more sharpened focus on ancestry and lineage, the ways in which familial traditions, traumas and patriarchal practices get passed on from generation to the next. “Milkman” is a moving sketch of a mother-daughter relationship delivered with profound empathy, and the album’s centerpiece is “5 Acres of Turnips,” a bluegrass blues steeped in Sixties girl-group pop that employs one family’s ambiguously troubled past as a subtle metaphor, perhaps, for the haunted legacy of the American South. In the song, Presley and Lambert conjure Bobbie Gentry’s “Ode to Billie Joe,” the Band’s “King Harvest (Will Surely Come) and Kacey Musgraves’ “Merry Go Round” as they sketch out the rough details of a family long plagued by its own buried history. “Generations of shame,” Lambert sings, “in my grandaddy’s name.”\r\n\r\nThe 14 songs on Interstate Gospel tell a tightly-woven story about adult restlessness, bittersweet farewells and hard-won independence. Several albums into their own individual and collective career, the Pistol Annies are less interested in singing about burning down their ex-husbands' houses than in burning up their own dull lives in order to start anew. \"Living wild and exhausted,\" as the Pistol Annies put it. \"Paying what it cost to feel so free.\"", "pptitle": ["review", "pistol", "anni", "interst", "gospel", "roll", "stone"]}