{"id": "RS_25", "url": "https://www.rollingstone.com/music/music-album-reviews/offset-father-of-4-review-799031/", "name": ["Offset", "Opens", "Up", "on", "‘Father", "of", "4’", "–", "Rolling", "Stone"], "description": ["month", "movi", "star", "reveal", "thought", "commit", "hate", "crime", "long", "soap", "opera", "star", "allegedli", "fabric", "shouldnt", "come", "kiari", "kendrel", "cephu", "tri", "save", "black", "histori", "month", "solo", "album", "offset", "unenvi", "task", "answer", "daunt", "list", "accus", "transgress", "allegedli", "cheat", "wife", "cardi", "b", "announc", "split", "decemb", "offset", "respond", "resign", "comment", "instagram", "yall", "won", "stumbl", "social", "media", "apolog", "onstag", "stunt", "win", "wife", "critic", "fan", "call", "toxic", "walk", "cardi", "onstag", "accept", "best", "rap", "album", "grammi", "internet", "groan", "careerdefin", "turn", "2016", "bad", "bouje", "2019", "offset", "went", "second", "popular", "migo", "arguabl", "talent", "trio", "hate", "quavo", "takeoff", "releas", "solo", "album", "low", "stake", "luxuri", "longer", "avail", "offset", "solo", "album", "need", "work", "multipl", "level", "split", "time", "apolog", "tour", "infidel", "explain", "make", "case", "didnt", "need", "partner", "crime", "carri", "album", "father", "4", "migo", "project", "group", "shed", "bombast", "introspect", "raw", "person", "record", "broken", "man", "broken", "famili", "struggl", "avoid", "condemn", "children", "wife", "similar", "fate", "far", "reckon", "mistak", "offset", "tri", "scope", "father", "4", "small", "album", "effect", "focu", "offset", "sift", "regret", "narr", "stylist", "offset", "man", "speed", "rap", "fill", "cascad", "syllabl", "triplet", "rare", "given", "second", "develop", "death", "lean", "addict", "abandon", "issu", "crevic", "album", "moment", "introspect", "outweigh", "album", "primari", "goal", "inspir", "dad", "late", "offset", "wrote", "twitter", "selftitl", "album", "open", "autobiograph", "tale", "explain", "variou", "way", "fail", "children", "jordan", "kodi", "kalea", "kultur", "rang", "age", "year", "old", "just", "seven", "month", "17", "year", "old", "youtryna", "soul", "offset", "sing", "digit", "distort", "warbl", "stori", "panick", "lick", "song", "share", "titl", "2017", "cardi", "b", "song", "he", "featur", "beat", "rise", "energi", "rest", "project", "choru", "remain", "deathli", "took", "coupl", "dawg", "licki", "broke", "sick", "muse", "center", "father", "4", "predict", "cardi", "b", "peel", "layer", "admir", "horni", "offset", "describ", "wife", "hellbent", "posit", "forc", "husband", "life", "north", "star", "offset", "rap", "addict", "lean", "sip", "mama", "sleep", "song", "later", "unnam", "woman", "dont", "lose", "tell", "styrofoam", "he", "allow", "home", "song", "place", "offset", "rumor", "infidel", "harsher", "light", "new", "person", "detail", "uncomfort", "sit", "savvi", "cardi", "allow", "add", "perspect", "clout", "brutal", "swift", "nimbl", "cardi", "perform", "best", "album", "featur", "dismantl", "varieti", "unnam", "detractor", "rapper", "blog", "troll", "middl", "rap", "bitch", "mad", "bitch", "trash", "oscar", "grouch", "cardi", "adlib", "growl", "far", "better", "come", "predict", "father", "4", "fall", "prey", "bloat", "character", "migo", "project", "offset", "lose", "focu", "tracklist", "featur", "balloon", "fleek", "featur", "quavo", "quarter", "milli", "featur", "gucci", "mane", "worst", "offend", "add", "narr", "offset", "spent", "long", "build", "track", "like", "atlanta", "rapper", "qualiti", "control", "hedg", "bet", "case", "person", "album", "gambl", "fail", "pay", "current", "iter", "trap", "primari", "mode", "commun", "hyperbol", "genr", "kingpin", "chain", "heavi", "weigh", "neck", "trap", "corner", "father", "4", "decidedli", "trap", "album", "buck", "current", "convent", "genr", "offset", "attempt", "success", "showcas", "human", "frequent", "misguid", "choic", "piec", "art", "like", "wouldnt", "exist", "didnt", "know", "transgress", "goal", "isnt", "make", "excus", "success", "rapper", "crimin", "mastermind", "detail", "like", "scare", "child", "child", "accord", "song", "he", "readi", "adolesc", "he", "suspend", "famou", "musician", "earli", "twenti", "father", "4", "built", "trauma", "that", "clearli", "difficult", "navig", "offset", "open", "lack", "father", "figur", "record", "im", "bando", "daddi", "abandon", "interview", "dont", "care", "gangster", "your", "suppos", "trap", "nigga", "pop", "break", "told", "esquir", "recent", "profil", "offset", "spent", "year", "let", "past", "haunt", "life", "instead", "music", "unsurprisingli", "took", "confront", "demon", "moment", "vulner", "away", "groupmat", "make", "best", "solo", "album"], "date_published": ["2019-02-25T17:37:45+00:00"], "sentiment": 0.043102480852480834, "content": "After a month that found one movie star revealing thoughts about committing a hate crime and, not long after, a soap opera star allegedly fabricating another, it shouldn’t come down to Kiari Kendrell Cephus to try to save Black History Month. But here we are.\r\n\r\nFor his first solo album, Offset had the unenviable task of answering for a daunting list of accused transgressions. He allegedly cheated on his wife, Cardi B, before she announced their split in December. Offset responded with a resigned comment on Instagram: “Y’all won.” From there, he stumbled through social media apologies and onstage stunts to win his wife back. Critics and fans called it toxic. As he walked Cardi onstage to accept her Best Rap Album Grammy, the internet groaned.\r\n\r\nSomewhere between his career-defining turn on 2016’s “Bad and Boujee” and 2019, Offset went from being the second most popular Migos and, arguably, the most talented, to the trio's most hated. While Quavo and Takeoff have both released solo albums with low stakes, that luxury is no longer available to Offset. His solo album needed to work on multiple levels, splitting time between an apology tour with an infidelity explainer while also making the case that he didn't need his partners in crime to carry an album.\r\n\r\nFather of 4 is the first Migos project — group or otherwise — that sheds bombast for introspection. Raw and personal, the record is about a broken man from a broken family, struggling to avoid condemning his children and wife to a similar fate. As far as reckoning with your mistakes go, Offset is trying to do it here.\r\n\r\nThe scope of Father of 4 is small, and the album is at its most effective when the focus is on Offset, alone, sifting through his regrets. Narratively and stylistically, Offset is a man of speed. His raps are filled with cascades of syllables and triplets that are rarely given more than a few seconds to develop. Death, lean addiction and abandonment issues fill every crevice of this album, but those moments of introspection never outweigh the album’s primary goal: \"Inspiration for the dads it’s never too late,\" Offset wrote on Twitter.\r\n\r\nThe self-titled album opener is an autobiographical tale that explains the various ways he failed his children — Jordan, Kody, Kalea and Kulture — who range in age from nine years old to just seven months. \"I was 17 years old when I had you/Tryna find my soul when I had you,\" Offset sings in a digitally distorted warble. From there, his story becomes more panicked. On \"Lick\" — a song that shares the same title as a 2017 Cardi B song he's featured on — the beat rises in energy from the rest of the project, but the chorus remains deathly serious: \"I took a couple of my dawgs on a lick...I was so broke that I could cry. I was sick.\"\r\n\r\nThe muse at the center of Father of 4 is, predictably, Cardi B. Once you peel back the (many) layers of admiration and horniness, Offset describes a wife hellbent on being a positive force in her husband’s life. On “North Star,” Offset raps about an addiction to lean — \"If I can't sip it then mama I can't even sleep\" — and, a few songs later, the unnamed woman on \"Don’t Lose Me\" tells him to \"put down the styrofoam\" before he’s allowed back home. These songs place Offset’s rumored infidelity in a harsher light, and the new, personal details within them are uncomfortable to sit with. In a savvy move, Cardi is allowed to add her perspective on \"Clout.\" Brutal, swift and nimble, Cardi's performance is among the best on the album and features her dismantling a variety of unnamed detractors: rappers, blogs, trolls. In the middle of rapping, \"Bitches is mad, bitches is trash, Oscar the grouch\" Cardi adlibs in a growl that is far better than almost anything that comes after it.\r\n\r\nPredictably, Father of 4 falls prey to the bloat that characterizes most Migos' projects. Offset loses focus as the tracklist and features balloon. \"On Fleek\" featuring Quavo and \"Quarter Milli\" featuring Gucci Mane are the worst offenders and add nothing to the narrative that Offset has spent so long building. Both tracks seem like the Atlanta rapper and Quality Control hedging their bets, in case the personal album gamble fails to pay off.\r\n\r\nIn its current iteration, trap's primary mode of communication is hyperbole. In this genre everyone is a kingpin, every chain is so heavy it weighs on your neck, everyone is trapping but no one is still on the corner. Father of 4 is decidedly still a trap album, but it bucks the current conventions of the genre. Offset is attempting, often successfully, to showcase the humanity behind his frequently misguided choices — it's a piece of art that likely wouldn't exist if we didn't already know about some of his transgressions. The goal here isn't to make excuses but to show someone who is a successful rapper (not a criminal mastermind) detailing what it's like to be a scared child who is about to have a child of his own. Now, according to the songs here, he's ready to move beyond the adolescence he's been suspended in since becoming a famous musician in his early twenties.\r\n\r\nFather of 4 is built upon trauma that's clearly difficult to navigate. Offset is open about his lack of a father figure, both on record (\"I'm from the bando, my daddy had abandoned me\") and in interviews (\"I don't care how gangster you are, who you're supposed to be, or how trapped out you are, to see a nigga with their pop breaks you down” he told Esquire in a recent profile).\r\n\r\nOffset spent years letting the past haunt his life, instead of his music. Unsurprisingly, all it took was a confrontation with his demons and a few moments of vulnerability away from his groupmates to make their best solo album.", "pptitle": ["offset", "open", "father", "4", "roll", "stone"]}