{"id": "UN_73", "url": "https://www.uncut.co.uk/news/crass-suddenly-courted-kgb-108937", "name": ["Crass:", "\"Suddenly", "we", "were", "being", "courted", "by", "the", "KGB\"", "-", "Uncut"], "description": ["new", "issu", "uncut", "shop", "avail", "buy", "onlin", "click", "featur", "fascin", "histori", "influenti", "diy", "punk", "band", "crassth", "tale", "begin", "anonym", "waterloo", "caf", "die", "day", "cold", "war", "penni", "rimbaud", "cofound", "drummer", "crass", "meet", "sailor", "just", "return", "falkland", "sailor", "skinhead", "written", "crass", "attack", "band", "anarch", "antiauthoritarian", "polit", "steve", "ignor", "crasss", "vocalist", "written", "band", "spirit", "engag", "unlik", "penfriend", "alli", "came", "falkland", "told", "knew", "say", "rimbaud", "today", "told", "mutini", "hm", "sheffield", "navi", "allow", "destroy", "took", "inform", "tape", "order", "latest", "issu", "uncut", "onlin", "sent", "homebut", "wasnt", "like", "crasss", "feroci", "antiwar", "song", "sheep", "farm", "falkland", "doe", "feel", "instead", "crasss", "bassist", "pete", "wright", "cut", "speech", "ronald", "reagan", "margaret", "thatcher", "shape", "fictiti", "telephon", "convers", "leader", "sent", "copi", "newspap", "europ", "wait", "wait", "wait", "month", "later", "stori", "appear", "sunday", "time", "hoax", "pentagon", "claim", "kgb", "respons", "share", "ep", "forest", "hous", "crass", "stifl", "giggl", "week", "later", "expos", "januari", "1984", "observ", "declar", "work", "anarchist", "rock", "band", "crass", "day", "rimbaud", "doesnt", "know", "observ", "discov", "truthth", "tape", "initi", "joke", "say", "rimbaud", "want", "undermin", "thatcher", "tape", "got", "classifi", "inform", "sheffield", "publish", "page", "observ", "suddenli", "court", "peopl", "sort", "unpleas", "organis", "want", "know", "offer", "kgb", "particularli", "paus", "honest", "shitscar", "wasnt", "joke", "moresubsequ", "crass", "invit", "meet", "russian", "literari", "magazin", "cromwel", "street", "suspect", "kgb", "band", "invit", "cb", "news", "crew", "want", "interview", "have", "liber", "enjoy", "vodka", "offer", "band", "scarper", "leav", "russian", "american", "ran", "road", "like", "hard", "day", "night", "jump", "air", "click", "heel", "say", "rimbaud", "naughti", "littl", "boy", "ars", "round", "hellish", "wed", "shot", "lock", "nownot", "band", "involv", "page", "exposs", "episod", "intern", "espionag", "band", "like", "crass", "band", "product", "uniqu", "confluenc", "peopl", "place", "time", "punk", "live", "like", "hippi", "wrote", "aggress", "song", "polit", "record", "album", "1978", "1983", "relat", "bodi", "film", "public", "artwork", "time", "band", "inform", "bureau", "say", "steve", "ignor", "heavi", "went", "felt", "say", "itbi", "time", "band", "came", "apart", "1984", "crass", "inspir", "loyal", "motiv", "openmind", "fanbas", "wear", "crass", "logo", "badg", "tattoo", "went", "campaign", "anim", "right", "anarchofemin", "antiroad", "group", "crass", "touch", "peopl", "deepli", "peopl", "want", "live", "live", "crass", "way", "say", "ignor", "crass", "rid", "conscienc", "sens", "injustic", "live", "life", "accord", "99", "cent", "crass", "abouty", "read", "crass", "new", "issu", "uncut", "leonard", "cohen", "coversubscrib", "uncut", "make", "huge", "save", "cover", "price", "click", "herelik", "facebook", "date", "latest", "news", "uncutth", "march", "2019", "issu", "uncut", "sale", "uk", "leonard", "cohen", "cover", "insid", "youll", "david", "bowi", "bob", "marley", "yardbird", "lambchop", "jessica", "pratt", "crass", "neu", "sean", "ono", "lennon", "15track", "cd", "showcas", "best", "month", "new", "music", "includ", "cass", "mccomb", "sleaford", "mod", "julia", "jacklin", "royal", "truxuncut", "past", "present", "futur", "great", "music"], "date_published": ["2019-01-18T15:48:42+00:00", "2019-01-18T15:48:42+00:00"], "sentiment": 0.042606146207841124, "content": "The new issue of Uncut – in shops now or available to buy online by clicking here – features a fascinating history of influential DIY punk band Crass.The tale begins in an anonymous Waterloo café during the dying days of the Cold War. Penny Rimbaud, co-founder and drummer with Crass, was meeting a sailor who had just returned from the Falklands. The sailor, a former skinhead, had written to Crass attacking the band’s anarchic, anti-authoritarian politics. Steve Ignorant, Crass’s vocalist, had written back in the band’s spirit of engagement; they had become unlikely penfriends and allies. “He came back from the Falklands and told us everything he knew,” says Rimbaud today. “He told us there \u2028had almost been a mutiny and about the HMS Sheffield, which the Navy had allowed to be destroyed. We took all that information and put \u2028it in the tape.” Order the latest issue of Uncut online and have it sent to your home!But this wasn’t like Crass’s ferocious anti-war songs “Sheep Farming In The Falklands” or “How Does It Feel?”. Instead, Crass’s bassist Pete Wright cut together speeches by Ronald Reagan and Margaret Thatcher to shape a fictitious telephone conversation between the two leaders. They sent copies to newspapers all over Europe and waited. And waited. And waited. Months later, a story appeared in The Sunday Times about the hoax in which the Pentagon claimed the KGB was responsible. Back in their shared Epping Forest house, Crass stifled giggles. But weeks later they were exposed. In January 1984, The Observer declared it was the work of “anarchist rock band” Crass. To this day, Rimbaud still doesn’t know how The Observer discovered \u2028the truth.“The tape was initially a joke,” says Rimbaud. “We wanted to do anything we could to undermine Thatcher. Because of the tape, we got all this classified information about the Sheffield published on the front pages of The Observer. Suddenly we were being courted by people from all sorts of unpleasant organisations who wanted to know what else we had to offer, the KGB particularly.” He pauses. “To be honest, we were shit-scared. It wasn’t a joke any more.”Subsequently Crass were invited to a meeting with “a Russian literary magazine” in Cromwell Street. Suspecting this was a KGB front, the band invited along a CBS news crew who wanted to interview them. Then, having liberally enjoyed the vodka on offer, the band scarpered, leaving Russians and Americans together. “We ran down the road like A Hard Day’s Night jumping in the air and clicking our heels,” says Rimbaud. “Naughty little boys arsing round. But it was hellish serious. We’d be shot or locked up for that now.”Not many bands are involved in front page exposés over episodes of international espionage, but not many bands were like Crass. The band were the product of a unique confluence of people, place and time, punks who lived like hippies and wrote aggressive songs about politics. They recorded five albums between 1978 and 1983 as well as a related body of films, publications and artworks and at times were less a band than “an information bureau”, says Steve Ignorant. “Everything serious or heavy that went on, we felt we had to be saying something about it.”By the time the band came apart in 1984, Crass had inspired a loyal, motivated and open-minded fanbase, many of whom wear the Crass logo as badge or tattoo and went on to campaign for animal rights, anarcho-feminism and anti-road groups. “Crass touched people very deeply and people want to live their lives the Crass way,” says Ignorant. “And Crass put something in me that I can’t get rid of – a conscience, a sense of injustice. I still live my life according to 99 per cent of what Crass was about.”You can read much more about Crass in the new issue of Uncut, out now with Leonard Cohen on the cover.Subscribe to Uncut and make huge savings on the cover price – find out by clicking here!Like us on Facebook to keep up to date with the latest news from Uncut.The March 2019 issue of Uncut is now on sale in the UK – with Leonard Cohen on the cover. Inside, you’ll find David Bowie, Bob Marley, The Yardbirds, Lambchop, Jessica Pratt, Crass, Neu!, Sean Ono Lennon and much more. Our 15-track CD also showcases the best of the month’s new music, including Cass McCombs, Sleaford Mods, Julia Jacklin and Royal Trux.Uncut: the past, present and future of great music.", "pptitle": ["crass", "suddenli", "court", "kgb", "uncut"]}