{"id": "UN_89", "url": "https://www.uncut.co.uk/news/paul-simonon-vetoed-clash-reunion-108703", "name": ["Paul", "Simonon:", "Why", "I", "vetoed", "The", "Clash", "reunion", "-", "Uncut"], "description": ["latest", "issu", "uncut", "shop", "avail", "buy", "onlin", "click", "featur", "audienc", "paul", "simonon", "bassist", "clash", "good", "bad", "queenin", "interview", "simonon", "reveal", "joe", "strummer", "aliv", "idea", "clash", "reunion", "serious", "consid", "simonon", "person", "reluct", "revisit", "past", "meant", "happenedord", "latest", "issu", "uncut", "onlin", "sent", "homeeverybodi", "quit", "interest", "idea", "wasnt", "say", "id", "joe", "work", "project", "easi", "rout", "reform", "quit", "special", "uniqu", "time", "realli", "work", "dont", "thinkask", "plan", "commemor", "upcom", "40th", "anniversari", "clash", "london", "call", "simonon", "say", "im", "interest", "did", "boxset", "mick", "work", "2013", "sound", "far", "concern", "end", "that", "dont", "think", "better", "cours", "record", "compani", "thing", "oh", "anniversari", "like", "im", "interest", "celebr", "yesterday", "ive", "got", "thing", "im", "interest", "your", "do", "tomorrow", "did", "yesterday", "that", "keep", "go", "anywayin", "widerang", "interview", "simonon", "talk", "encount", "david", "bowi", "backstag", "shea", "stadium", "1982", "reveal", "like", "record", "bob", "dylan", "80", "bob", "dylan", "use", "come", "lot", "clash", "show", "say", "simonon", "use", "bring", "famili", "record", "interest", "turn", "bob", "said", "ive", "got", "idea", "play", "guitar", "song", "like", "ok", "d", "e", "g", "f", "go", "round", "went", "there", "song", "there", "song", "seven", "song", "say", "right", "let", "point", "hardli", "rememb", "weve", "just", "let", "disast", "dont", "know", "point", "mayb", "certain", "energi", "outlook", "want", "explainedy", "read", "paul", "simonon", "latest", "issu", "uncut", "shop", "new", "order", "coversubscrib", "uncut", "make", "huge", "save", "cover", "price", "click", "herelik", "facebook", "date", "latest", "news", "uncutth", "march", "2019", "issu", "uncut", "sale", "uk", "new", "order", "cover", "insid", "youll", "pete", "shelley", "rip", "massiv", "2019", "album", "preview", "sharon", "van", "etten", "mark", "knopfler", "paul", "simonon", "john", "martyn", "steve", "gunn", "15track", "cd", "showcas", "best", "month", "new", "music", "includ", "bruce", "springsteen", "william", "tyler", "dream", "syndicateuncut", "past", "present", "futur", "great", "music"], "date_published": ["2018-12-21T13:44:17+00:00", "2018-12-21T13:44:17+00:00"], "sentiment": 0.13449134199134202, "content": "The latest issue of Uncut – in shops now and available to buy online by clicking here – features An Audience With Paul Simonon, bassist for The Clash and The Good, The Bad & The Queen.In the interview, Simonon reveals that while Joe Strummer was still alive, the idea of a Clash reunion was seriously considered. However, Simonon’s personal reluctance to revisit the past meant that it never happened.Order the latest issue of Uncut online and have it sent to your home!“Everybody seemed quite interested in the idea, but I wasn’t,” he says. “I’d rather me and Joe worked together again in another project, rather than go the easy route and reform something that was quite special and unique to that time. It never really works, I don’t think.”Asked if he has any plans to commemorate the upcoming 40th anniversary of The Clash’s London Calling, Simonon says: “No. I’m not interested in any of that. We did do a boxset that me and Mick worked on [2013’s Sound System] and as far as I was concerned that was the be all and end all, that’s done. I don’t think you could get any better than that. But of course the record company has this thing, ‘Oh, it’s the anniversary of this…’ It’s like, so what? I’m not interested in celebrating yesterday. I’ve got other things to do. I’m more interested in what you’re doing tomorrow rather than what you did yesterday. That’s what keeps me going, anyway.”In the wide-ranging interview, Simonon also talks about his encounter with David Bowie backstage at Shea Stadium in 1982, and reveals what it was like to record with Bob Dylan in the 80s. “Bob Dylan used to come to a lot of Clash shows,” says Simonon. “He used to bring his family. Recording with him was… interesting. We turned up and Bob said, “I’ve got these ideas” and he played the guitar for this song, and we’re like, “OK – D, E, G, F,” going round it, and then he went, “Now there’s this other song,” and then there’s another song, and after about six or seven songs he says, “Right, let’s do the first one again.” At that point, I can hardly remember the one we’ve just done, let alone the first one. It’s a disaster. I don’t know what the point was. Maybe there was a certain energy or outlook he wanted. Nothing was explained.”You can read much more from Paul Simonon in the latest issue of Uncut, in shops now with New Order on the cover.Subscribe to Uncut and make huge savings on the cover price – find out by clicking here!Like us on Facebook to keep up to date with the latest news from Uncut.The March 2019 issue of Uncut is now on sale in the UK – with New Order on the cover. Inside, you’ll find Pete Shelley (RIP), our massive 2019 albums preview, Sharon Van Etten, Mark Knopfler, Paul Simonon, John Martyn, Steve Gunn and much more. Our 15-track CD also showcases the best of the month’s new music, including Bruce Springsteen, William Tyler and the Dream Syndicate.Uncut: the past, present and future of great music.", "pptitle": ["paul", "simonon", "veto", "clash", "reunion", "uncut"]}