{"id": "NME_18", "url": "https://www.nme.com/news/music/liverpool-band-hers-died-tour-us-2468466", "name": ["Liverpool", "band", "Her’s", "have", "died", "while", "on", "tour", "in", "the", "US"], "description": ["duo", "travel", "gig", "santa", "ana", "californiath", "liverpool", "band", "die", "tour", "label", "confirm", "duo", "compris", "stephen", "fitzpatrick", "audun", "laad", "travel", "arizona", "gig", "santa", "ana", "california", "earlier", "week", "march", "27", "involv", "road", "accid", "member", "tour", "manag", "trevor", "engelbrektson", "die", "incid", "statement", "post", "facebook", "band", "label", "heist", "hit", "wrote", "heartbrokentheir", "energi", "vibranc", "talent", "came", "defin", "label", "human", "warm", "gentl", "hilari", "time", "stop", "offic", "uplift", "experi", "say", "close", "underestim", "friendship", "genuin", "beauti", "wit", "love", "like", "brothersmus", "astonish", "statement", "continu", "aptitud", "melodi", "fun", "entertain", "combin", "complex", "sophist", "stylish", "america", "play", "thousand", "ador", "fan", "fan", "point", "meet", "spend", "time", "passion", "humbl", "world", "feet", "label", "overwhelm", "distraught", "lost", "friend", "world", "deni", "talentth", "statement", "call", "peopl", "respect", "privaci", "famili", "fitzpatrick", "laad", "engelbrektson", "extrem", "difficult", "time", "releas", "debut", "album", "invit", "august", "2018", "follow", "2017", "compil", "song", "write", "band", "2017", "nme", "said", "group", "stand", "song", "produc", "lofi", "bedroom", "pop", "power", "debut", "track", "dorothi", "duo", "equal", "melod", "slackerrock", "marcel", "see", "liverpoolbas", "duo", "shift", "float", "sound", "realli", "fit", "genr", "nail", "end", "doingtribut", "pour", "social", "media", "fellow", "artist", "fan", "tragic", "news", "confirm", "select"], "date_published": ["2019-03-28T22:19:47+00:00"], "sentiment": 0.17063492063492064, "content": "The duo were travelling to a gig in Santa Ana, CaliforniaThe Liverpool band Her’s have died while on tour in the US, their label have confirmed. The duo, comprised of Stephen Fitzpatrick and Audun Laading, were travelling from Arizona to a gig in Santa Ana, California earlier this week (March 27) when they were involved in a road accident. Both members and their tour manager, Trevor Engelbrektson, died in the incident. In a statement posted on Facebook, the band’s label Heist Or Hit wrote: “We are all heartbroken.“Their energy, vibrancy and talent came to define our label. As humans, they were warm, gentle and hilarious. Each time they stopped by the office made for an uplifting experience. To say they were close would be an underestimation of a friendship that was genuinely beautiful to witness; they loved one another like brothers.“Musically, Her’s were astonishing,” the statement continues. “An aptitude for melody, fun, and entertainment combined with a complexity that was as sophisticated as it was stylish. They were in America playing to thousands of adoring fans. Fans they made a point of meeting and spending time with, such was their passion and humbleness. The world was at their feet. “Everyone here at the label is overwhelmed and distraught. We have lost our friends and the world has been denied their talent.”The statement also called for people to respect the privacy of the families of Fitzpatrick, Laading, and Engelbrektson “at this extremely difficult time.”\nHer’s released their debut album ‘Invitation To Her’s’ in August 2018, which followed on from their 2017 compilation ‘Songs Of Her’s’. Writing about the band in 2017, NME said: “Her’s are not a group to stand still. Each song they produce, from the lo-fi bedroom pop power of debut track to ‘Dorothy’ to the duo’s equally melodic take on slacker-rock on ‘Marcel’, sees the Liverpool-based duo shift and float between sounds, never really fitting into one genre, but somehow nailing whatever they end up doing.Tributes to Her’s have been pouring in on social media from fellow artists and fans since the tragic news was confirmed – see a selection of those below.", "pptitle": ["liverpool", "band", "die", "tour"]}