{"id": "PF_82", "url": "https://pitchfork.com/reviews/albums/meat-puppets-dusty-notes/", "name": ["Dusty", "Notes"], "description": ["distinct", "advantag", "meat", "puppet", "80", "90svintag", "peer", "make", "decad", "kind", "sound", "like", "55", "collect", "imprint", "youth", "risk", "fail", "recaptur", "1984", "immort", "meat", "puppet", "ii", "perfectli", "weather", "weird", "anathema", "punk", "orthodoxi", "find", "bridg", "dead", "dead", "kennedi", "long", "fashion", "band", "easi", "classifi", "psychedelicnot", "indulg", "dayglo", "way", "way", "suggest", "guzzl", "bucket", "homemad", "drug", "happen", "music", "instrument", "play", "speed", "volum", "felt", "sustain", "moment", "zeitgeist", "moment", "guest", "honor", "1994", "nirvana", "mtv", "unplug", "new", "york", "deliv", "curt", "cri", "kirkwood", "mass", "old", "soul", "song", "earn", "pride", "place", "alongsid", "bowi", "leadbelli", "meat", "puppet", "15th", "album", "37", "yearstheir", "origin", "drummer", "derrick", "bostrum", "1995", "fifth", "bassist", "cri", "rejoin", "follow", "fraught", "year", "addict", "legal", "troubl", "curt", "son", "elmo", "play", "guitarserv", "defens", "thesi", "twentyf", "long", "year", "later", "kirkwood", "brother", "grown", "grizzled", "look", "like", "sunstrok", "prospector", "channel", "dusti", "note", "doe", "say", "tin", "earthi", "time", "casual", "familiar", "wholli", "eas", "arent", "tri", "make", "argument", "punk", "countri", "coexist", "share", "dna", "outlaw", "spirit", "arent", "tri", "argu", "loud", "rawk", "guitar", "domin", "previou", "album", "2013", "rat", "farm", "larg", "confin", "background", "10", "track", "progmet", "miniopu", "vampyr", "wing", "fantasi", "attempt", "broach", "raucous", "racket", "includ", "spirit", "cover", "don", "gibson", "sea", "heartbreak", "best", "known", "johnni", "cash", "1996", "americanrecord", "version", "come", "think", "kind", "wild", "rick", "rubin", "fed", "cash", "lake", "tri", "session", "perfect", "rest", "comfort", "reserv", "honkytonk", "spectrum", "distanc", "youth", "shred", "shriek", "high", "dieera", "120", "minut", "fame", "open", "track", "warranti", "posit", "bounc", "thank", "octavejump", "basslin", "banjo", "mariachi", "horn", "anchor", "pin", "titl", "track", "respect", "great", "awaken", "midtempo", "pianobas", "ballad", "aggreg", "feel", "like", "departureit", "step", "backward", "forward", "time", "mine", "root", "way", "age", "grace"], "date_published": ["2019-03-11T05:00:00"], "sentiment": 0.19237116058544632, "content": "One distinct advantage Meat Puppets have over many of their ‘80s and ‘90s-vintage peers still making a go of it after more three decades is that they always kind of sounded like they were 55. There is no collectively imprinted youth to risk failing to recapture. By 1984’s immortal Meat Puppets II, they were already perfectly weathered and weird and an anathema to punk orthodoxy, finding the bridge between the Dead and the Dead Kennedys long before it was fashionable. The band was easy enough to classify as psychedelic—not in an indulgent or Day-Glo way, but in a way that suggested guzzling buckets of homemade drugs and happening upon musical instruments which they then played at whatever speed and volume felt sustainable in the moment. Their zeitgeist moment as guests of honor on 1994’s Nirvana’s MTV Unplugged in New York delivered Curt and Cris Kirkwood to the masses as old souls whose songs had earned pride of place alongside Bowie and Leadbelly.\nThe Meat Puppets’ 15th album in 37 years—their first with original drummer Derrick Bostrum since 1995, fifth since bassist Cris rejoined following fraught years of addiction and legal troubles, and third with Curt’s son Elmo playing guitar—serves as a defense of that thesis. Twenty-five long years later, the Kirkwood brothers have grown into their grizzledness. They now look like the sun-stroked prospectors they have always channeled, and Dusty Notes does what it says on the tin: It’s earthy and out of time, casual and familiar, and wholly at ease with itself. They aren’t trying to make an argument that punk and country can coexist or share DNA or an outlaw spirit; they aren’t trying to argue about anything much at all.\nThe loud rawk guitars that were still dominant as of their previous album, 2013’s Rat Farm, are largely confined to the background here. Of the 10 tracks, only one, the prog-metal mini-opus “Vampyr’s Winged Fantasy,” even attempts to broach raucousness or racket. The other nine, including a spirited cover of Don Gibson’s “Sea of Heartbreak” (perhaps best known via Johnny Cash’s 1996 American-recorded version and come to think of it, it’s kind of wild that Rick Rubin never fed Cash “Lake of Fire” to try out during any of those sessions, that would have been perfect, but anyway), rest comfortably on the reserved, honky-tonk side of the spectrum, some distance from their youthful shredding and shrieking or their Too High To Die-era 120 minutes of fame.\nOpening track “Warranty” positively bounces thanks to its octave-jumping bassline, while banjo and mariachi horns anchor “Nine Pins” and the title track, respectively; “On” and “The Great Awakening” are mid-tempo piano-based ballads. In aggregate, none of this feels like a departure—it’s somehow a step backward and forward at the same time, mining roots as a way to age gracefully.\n", "pptitle": ["dusti", "note"]}