{"id": "PF_14", "url": "https://pitchfork.com/reviews/albums/jayda-g-significant-changes/", "name": ["Significant", "Changes"], "description": ["jayda", "guy", "academ", "work", "music", "output", "common", "goal", "design", "make", "peopl", "think", "interact", "environ", "canadian", "musician", "present", "master", "thesi", "effect", "certain", "chemic", "endang", "west", "coast", "orca", "speci", "year", "recent", "start", "talk", "seri", "featur", "young", "scientist", "jayda", "g", "she", "respons", "raptur", "disco", "hous", "come", "canadian", "riviera", "scene", "captiv", "crowd", "worldwid", "uninhibit", "dj", "style", "let", "selector", "squabbl", "share", "track", "id", "unwarr", "wheelupssh", "concentr", "provid", "soundtrack", "cathart", "electron", "devicefre", "boogi", "follow", "string", "excel", "ep", "singl", "label", "includ", "1080p", "geographi", "record", "jmg", "record", "signific", "chang", "berlinbas", "produc", "debut", "album", "like", "guy", "previou", "work", "track", "draw", "influenc", "includ", "chicago", "hous", "soul", "disco", "1990", "rb", "refer", "natur", "world", "time", "overt", "record", "finish", "studi", "bookend", "intro", "unifi", "center", "abstract", "outro", "conclus", "read", "like", "part", "scientif", "paper", "surpris", "there", "sens", "ecolog", "urgenc", "underpin", "song", "interview", "guy", "frequent", "express", "desir", "bridg", "passion", "way", "achiev", "turn", "field", "record", "unexpectedli", "poignant", "melodi", "instrument", "centerpiec", "orca", "repris", "built", "marin", "mammal", "cri", "produc", "smartli", "avoid", "newag", "chintzi", "missi", "know", "what", "take", "concept", "step", "sampl", "omin", "word", "canadian", "biologist", "misti", "macduffe", "whale", "threaten", "go", "set", "thump", "backbon", "doom", "gloom", "guy", "expertli", "balanc", "record", "somber", "offer", "hand", "fouronthefloor", "heatseek", "anthem", "youv", "seen", "play", "festiv", "listen", "decadehop", "radio", "mix", "know", "dj", "priorit", "song", "exud", "certain", "timeless", "tri", "score", "cool", "point", "obscur", "war", "1971", "funk", "hit", "slippin", "dark", "tlc", "creep", "she", "constantli", "think", "elicit", "biggest", "headbob", "limbpump", "respons", "audienc", "frequent", "collabor", "alexa", "dash", "appear", "euphor", "track", "sunshin", "valley", "leav", "room", "2", "breath", "soul", "huski", "croon", "perfectli", "complement", "guy", "shuffl", "groov", "vintag", "drummachin", "sound", "rollerrink", "cowbel", "album", "that", "human", "anim", "voic", "alik", "promin", "guy", "arrest", "spokenword", "vocal", "center", "stage", "stanley", "park", "df", "disco", "mix", "address", "dancefloor", "etiquett", "propuls", "basslin", "warm", "string", "phone", "look", "instagram", "play", "admonish", "rous", "arm", "ladi", "way", "see", "produc", "do", "best", "bodi", "break", "host", "impress", "remind", "listen", "punctuat", "instruct", "gleeful", "whoop", "accord", "guy", "album", "titl", "twofold", "mean", "mostus", "phrase", "thesi", "refer", "person", "artist", "chang", "she", "experienc", "recent", "year", "she", "move", "halfway", "world", "play", "show", "afield", "evergrow", "platform", "reach", "peopl", "say", "bring", "certain", "respons", "reduc", "carbon", "footprint", "help", "creat", "divers", "inclus", "learn", "danc", "space", "like", "best", "teacher", "she", "lead", "exampl"], "date_published": ["2019-03-25T05:00:00"], "sentiment": 0.21074263038548752, "content": "Jayda Guy’s academic work and musical output have a common goal: Both are designed to make people to think about how they interact with their environments. The Canadian musician presented her master’s thesis about the effects of certain chemicals on an endangered West Coast orca species last year, and she recently started a talk series featuring young scientists. As Jayda G, she’s been responsible for some of the most rapturous disco house to come out of the “Canadian Riviera” scene, and she has captivated crowds worldwide with her uninhibited DJ style. Let other selectors squabble about sharing track IDs and unwarranted wheel-ups—she’d rather concentrate on providing the soundtrack for cathartic, electronic device-free boogieing.\nFollowing a string of excellent EPs and singles on labels including 1080p, Geography Records, and her own JMG Recordings, Significant Changes is the Berlin-based producer’s debut album. Like much of Guy’s previous work, the nine tracks here draw on influences including Chicago house, soul, disco, and 1990s R&B, but her references to the natural world this time around are more overt. Recorded while she was finishing her studies, its bookending intro (“Unifying the Center (Abstract)”) and outro (“Conclusion”) read like parts of a scientific paper; it’s not surprising that there’s a sense of ecological urgency underpinning many of these songs.\nIn interviews, Guy has frequently expressed her desire to bridge her two passions, and one way she achieves this is by turning field recordings into unexpectedly poignant melodies. The instrumental centerpiece “Orca’s Reprise” is built around the marine mammals’ cries, but the producer smartly avoids new-age chintziness. “Missy Knows What’s Up” takes the concept one step further, sampling the ominous words of Canadian biologist Misty MacDuffee (“Why are these whales threatened and what are we going to do about it?”), and setting them to a thumping backbone.\nIt’s not all doom and gloom, however, and Guy expertly balances the record’s more somber offerings with a handful of four-on-the-floor, heat-seeking anthems. If you’ve seen her play at a festival or listened to one of her decade-hopping radio mixes, then you know that, as a DJ, she prioritizes songs that exude a certain timelessness, rather than trying to score cool points for obscurity. From War’s 1971 funk hit “Slippin’ Into Darkness” to TLC’s “Creep,” she’s constantly thinking about what will elicit the biggest head-bobbing, limb-pumping responses from her audiences. Frequent collaborator Alexa Dash appears on two euphoric tracks, “Sunshine in the Valley” and “Leave Room 2 Breathe,” and her soulful, husky croon perfectly complements Guy’s shuffling grooves, vintage drum-machine sounds, and, on the latter, roller-rink cowbell.\nYet on an album that’s full of human and animal voices alike, the most prominent one is her own. Guy’s arresting spoken-word vocals take center stage on “Stanley’s Get Down (No Parking on the DF)” and “Move to the Front (Disco Mix),” both of which address dancefloor etiquette over propulsive basslines and warm strings. “I see you with your phone looking at Instagram,” she playfully admonishes on the former, while the latter is a rousing call to arms to ladies “all the way in the back,” which sees the producer doing her best Body Break host impression. As if to remind listeners that it’s not so serious, she punctuates these instructions with gleeful whoops.\nAccording to Guy, the album’s title has a twofold meaning. Not only was it the most-used phrase in her thesis, but it also refers to the personal and artistic changes she’s experienced in recent years, as she’s moved halfway across the world and played shows even further afield. Her ever-growing platform to reach people, she says, brings certain responsibilities, whether it’s reducing her carbon footprint or helping create more diverse and inclusive learning and dancing spaces. Like all the best teachers, she’s leading by example.\n", "pptitle": ["signific", "chang"]}