{"id": "PF_30", "url": "https://pitchfork.com/reviews/albums/tamaryn-dreaming-the-dark/", "name": ["Dreaming", "the", "Dark"], "description": ["album", "releas", "tamaryn", "brown", "adopt", "shoegaz", "approach", "voic", "cast", "just", "instrument", "bleed", "sing", "differ", "tamaryn", "new", "record", "dream", "dark", "retain", "penchant", "nostalg", "brood", "spike", "voic", "mix", "wield", "command", "feroc", "previou", "tamaryn", "album", "drew", "abund", "comparison", "thatcherera", "goth", "like", "cocteau", "twin", "cure", "dream", "dark", "align", "tear", "fear", "english", "duo", "1985", "album", "song", "big", "chair", "broke", "market", "cite", "tear", "fear", "interview", "posit", "kany", "west", "interlop", "80", "know", "listen", "808", "heartbreak", "sic", "listen", "record", "unabashedli", "blatant", "worship", "tear", "fear", "said", "recent", "feel", "like", "album", "kind", "like", "tri", "captur", "relationship", "tri", "mayb", "end", "tamaryn", "sound", "worship", "tear", "fear", "kany", "did", "808", "heartbreak", "clean", "weepi", "80", "synthpop", "digit", "age", "ditch", "reverb", "keep", "melodrama", "dream", "dark", "plung", "right", "origin", "murk", "reverb", "coat", "just", "sound", "track", "synthes", "patch", "drum", "machin", "beat", "sound", "like", "issu", "equip", "lie", "storag", "reagan", "era", "result", "album", "feel", "littl", "staid", "trap", "amber", "tempo", "hit", "regular", "puls", "melodi", "round", "base", "fanfar", "fit", "ragei", "select", "pain", "tamaryn", "bellow", "fit", "rage", "like", "pain", "item", "dropdown", "menu", "church", "bell", "facsimil", "toll", "begin", "your", "ador", "envis", "graveyard", "open", "track", "terrif", "fun", "angel", "sweat", "doe", "tamaryn", "cut", "loos", "swing", "rafter", "song", "offer", "plummi", "thatcherera", "goth", "classicth", "vampir", "love", "song", "embrac", "desir", "impel", "launch", "voic", "rang", "elong", "syllabl", "extend", "gasp", "live", "livesit", "nightfeel", "hard", "bite", "matter", "incarn", "take", "matter", "decad", "stalk", "vampir", "sex", "get", "old", "offer", "strang", "kind", "power", "evil", "want", "fuck", "construct", "vampir", "posit", "death", "terror", "object", "desir", "revuls", "great", "time", "close", "jaw", "fear", "camp", "goth", "doesnt", "present", "lucidli", "song", "doe", "angel", "sweat", "shame", "tamaryn", "voic", "delight", "dark", "sens", "triumph", "ail", "album", "tend", "bleach", "velveti", "black", "matt", "beig", "chrome", "spike", "sand", "meet", "public", "school", "safeti", "regul"], "date_published": ["2019-03-23T05:00:00"], "sentiment": 0.10958362344725976, "content": "On the first three albums she released under her first name, Tamaryn Brown adopted a shoegazer's approach to her own voice, casting it as just another instrument in the bleed. She sings differently now. Tamaryn's new record Dreaming the Dark retains her penchant for nostalgic brooding, but it spikes her voice up to the top of the mix, where she wields it with commanding ferocity.\nIf previous Tamaryn albums drew abundant comparisons to Thatcher-era goths like Cocteau Twins and The Cure, Dreaming the Dark is more aligned with Tears for Fears, the English duo whose 1985 album Songs from the Big Chair broke over to the U.S. market. She has cited Tears For Fears in interviews, while positioning Kanye West as an interloper between herself and the '80s. \"You know when you listen to 808s & Heartbreaks [sic]? If you listen to that record you see that he has this unabashedly, blatant worship of Tears for Fears,\" she said recently. \"I feel like my album is kind of like trying to capture that relationship.\"\nTrying, maybe, but in the end Tamaryn sounds more worshipful of Tears for Fears than Kanye ever did. If 808s and Heartbreak cleaned up weepy '80s synth-pop for the digital age, ditching the reverb but keeping the melodrama, Dreaming the Dark plunges it right back into its original murk. Reverb coats just about every sound on every track. Most of the synthesizer patches and drum machine beats sound like they could have issued from equipment that was lying in storage since the Reagan era.\nAs a result, the album feels a little staid and trapped in amber. Tempos hit at a regular pulse and melodies round their bases without fanfare.  \"In a fit of rage/I will select the pain,\" Tamaryn bellows on \"Fits of Rage,\" like pain were an item in a drop-down menu. A church bell, or a facsimile of one, tolls at the beginning of \"You're Adored\" and I can't even envision the graveyard.\nOnly in the opening track, the terrifically fun \"Angels of Sweat,\" does Tamaryn cut loose and swing for the rafters. The song offers a plummy take on a Thatcher-era goth classic—the vampire love song. \"Embrace your desire,\" she impels, launching her voice up to the top of her range and elongating the last syllable to an extended gasp. \"Lived so many lives/It's already night/Feel as hard as I bite.\" No matter how many incarnations it takes, no matter how many decades it stalks through, vampire sex, it seems, never gets old. It offers a strange kind of power, this evil you want to fuck and then become. The construct of the vampire positions death and terror as objects of desire, not revulsion, and it's a great time to close your jaws around what you fear.\nThe camp of goth doesn't present itself as lucidly on other songs as it does on \"Angels of Sweat,\" which is a shame: Tamaryn has the voice for it. Without that delight at the darkness, the sense of triumph over what ails you, the album tends to get bleached from velvety black to matte beige, all its chrome spikes sanded down to meet public school safety regulations.\n", "pptitle": ["dream", "dark"]}