{"id": "PF_94", "url": "https://pitchfork.com/reviews/albums/pissgrave-posthumous-humiliation/", "name": ["Posthumous", "Humiliation"], "description": ["pissgrav", "option", "extrem", "2015", "philadelphia", "band", "releas", "disgust", "death", "metal", "album", "recent", "histori", "suicid", "euphoria", "frenzi", "version", "reveng", "blast", "war", "metal", "album", "led", "cover", "art", "bone", "float", "what", "polit", "call", "brown", "death", "goop", "posthum", "humili", "make", "gore", "clear", "sport", "rippedopen", "face", "jaw", "promin", "split", "your", "familiar", "goregrind", "frequent", "exploit", "voyeurist", "tradit", "new", "goregrind", "band", "wouldnt", "pass", "muster", "tastemak", "subgenreagnost", "label", "like", "profound", "lore", "potenti", "pissgrav", "fan", "actual", "turn", "blatantli", "malevol", "imag", "music", "match", "posthum", "humili", "gratuit", "violent", "get", "vulgar", "great", "death", "metal", "album", "2019", "spite", "reprehens", "pissgrav", "chiefli", "driven", "war", "metal", "savageryaboveal", "approach", "crucial", "differ", "come", "time", "intens", "despit", "furi", "war", "metalblack", "metal", "concentr", "speed", "nearendless", "blast", "elsei", "tight", "control", "pissgrav", "sloppi", "understand", "carnag", "messi", "music", "reflect", "realiti", "humili", "louder", "noisier", "euphoria", "demian", "fenton", "tim", "mellon", "render", "endless", "sheet", "mangl", "guitar", "nois", "screamingli", "incoher", "cohes", "blownout", "riff", "torrenti", "blastbeat", "vocal", "low", "subterranean", "crowd", "space", "insepar", "pain", "emaci", "loos", "guitar", "solo", "damag", "make", "kerri", "king", "reign", "blood", "squabbl", "sound", "like", "disciplin", "work", "youtub", "shredder", "lead", "suggest", "familiar", "like", "swell", "carnivor", "bird", "peck", "deceas", "feel", "wonder", "senseless", "cover", "guitar", "sound", "suggest", "pissgrav", "provid", "denimandleath", "version", "shock", "awe", "there", "chao", "ultim", "lead", "import", "blister", "tumultu", "cours", "akin", "cecil", "taylor", "percuss", "jar", "piano", "flight", "australian", "extremist", "impetu", "ritual", "howl", "tower", "nois", "free", "unplan", "deliber", "track", "new", "trial", "chanc", "live", "cycl", "miseri", "pain", "open", "blast", "canticl", "rip", "flesh", "celebratori", "defil", "open", "euthanasia", "quiteit", "just", "feel", "cyclic", "ultim", "sourc", "pissgrav", "bloodlust", "catacomb", "putrid", "chamber", "like", "offer", "differ", "path", "incantationlik", "dirg", "ultim", "tortur", "despit", "frenzi", "blur", "gori", "pissgrav", "charg", "horizon", "approach", "euphoria", "thrashi", "power", "tripviaabsu", "tune", "second", "sorrow", "mysteri", "close", "moment", "rust", "wind", "draw", "dissect", "melod", "mourn", "passag", "melod", "ye", "record", "realli", "fuck", "wind", "funer", "process", "follow", "humili", "wave", "violenc", "theyr", "griev", "exactli", "remors", "tempt", "dismiss", "humili", "mere", "edgelord", "monument", "propaganda", "core", "your", "miss", "point", "your", "incap", "uninterest", "hurt", "intern", "life", "feel", "ravag", "violent", "chaotic", "pissgrav", "utter", "deprav", "proudli", "map", "feel", "posthum", "humili", "day", "mess", "thing", "make", "sens"], "date_published": ["2019-03-08T06:00:00"], "sentiment": 0.056850201080970345, "content": "Pissgrave had only one option: to get more extreme. In 2015, the Philadelphia band released one of the most disgusting death metal albums in recent history, Suicide Euphoria. A more frenzied version of Revenge’s blasting war metal, the album led with cover art where bones floated in what’s most politely called brown death goop. Posthumous Humiliation makes the gore even more clear, sporting a ripped-open face with its jaw prominently split in two. If you’re familiar with goregrind’s frequently exploitative, voyeuristic tradition, it’s nothing new, though most goregrind bands wouldn’t pass the muster of a tastemaking, subgenre-agnostic label like Profound Lore. As such, some potential Pissgrave fans may actually be turned off by such a blatantly malevolent image. But the music matches it: Posthumous Humiliation is gratuitously violent, getting off on its own vulgarity. It is not the first great death metal album of 2019 in spite of being reprehensible but because of it.\nPissgrave are again chiefly driven by war metal’s savagery-above-all approach, but the crucial difference comes this time with intensity. Despite its fury, war metal—black metal concentrated on speed and near-endless blasting, nothing else—is tight and controlled. Pissgrave are not sloppy, but they understand that carnage is messy, and their music should reflect that reality. Humiliation is louder and noisier than Euphoria, as Demian Fenton and Tim Mellon render endless sheets of mangled guitar noise, screamingly incoherent but cohesive. Blown-out riffs, torrential blastbeats, and vocals so low they seem subterranean crowd the same space, inseparable in their pain. “Emaciated” has what you could loosely call guitar solos, so damaged they make Kerry King’s Reign in Blood squabbles sound like the disciplined work of some YouTube shredder. Even when these leads suggest something familiar, like the swells and carnivorous bird pecks of “Into the Deceased,” they feel wonderfully senseless.\nAs with the cover, those guitar sounds may suggest that Pissgrave only provide denim-and-leather’s version of shock and awe. But there’s more here. Where their chaos ultimately leads is not as important as its blistering, tumultuous course, akin to Cecil Taylor’s percussive, jarring piano flights or Australian extremists Impetuous Ritual’s howling towers of noise. They seem free and unplanned, not deliberate. Each track is a new trial, a chance to live again through a cycle of misery and pain. Are the opening blasts in “Canticle of Ripping Flesh” and “Celebratory Defilement” the same as opener “Euthanasia?” Not quite—it just feels that cyclical, the ultimate source of Pissgrave’s bloodlust. “Catacombs of Putrid Chambers” seems like it offers a different path through Incantation-like dirges, yet it’s ultimately the same torture.\nDespite how frenzied, blurred, and gory Pissgrave can become, they sometimes charge toward a horizon of approachability. For Euphoria, it was the thrashy, Power Trip-via-Absu tune, “The Second Sorrowful Mystery.” Here, the closing moments of “Rusted Wind” draw upon Dissection’s melodic mournful passages. Melodic? Yes, this record really is that fucked up. “Wind” is the funeral procession that follows Humiliation’s wave of violence. It’s as though they’re grieving, if not exactly remorseful.\nIt’s tempting to dismiss Humiliation as a mere edgelord monument, propaganda with no core. But you’re missing the point: Even if you’re incapable or uninterested in hurting anything, your internal life can feel ravaged and violent and chaotic. Pissgrave’s utter depravity proudly maps those feelings on Posthumous Humiliation; some days, this mess may be the only thing that makes sense.\n", "pptitle": ["posthum", "humili"]}