{"id": "PF_54", "url": "https://pitchfork.com/reviews/albums/low-life-downer-edn/", "name": ["Downer", "Edn"], "description": ["sydney", "mitch", "tolman", "fan", "meathead", "bro", "grew", "theyr", "clearli", "muse", "evid", "low", "life", "debut", "2014", "album", "doggingth", "lyric", "band", "burli", "brood", "postpunk", "song", "owe", "quit", "bit", "australian", "lad", "cultur", "tolman", "got", "gift", "turn", "entitl", "toxic", "masculin", "bullshit", "absurdist", "satir", "tryin", "good", "man", "good", "blokebut", "love", "gettin", "im", "fuckin", "stoke", "deadpan", "dog", "ripper", "dna", "field", "recent", "postpunk", "band", "low", "life", "occupi", "deepli", "specif", "zone", "make", "muscular", "pit", "music", "glisten", "new", "wave", "synthes", "dispassion", "australian", "voic", "take", "piss", "sexist", "homophob", "dingus", "rivet", "mixtur", "second", "album", "downer", "edn", "pronounc", "downer", "edit", "low", "life", "continu", "comb", "societi", "sludg", "tolman", "put", "elabor", "depict", "dirtbag", "like", "portrait", "titular", "warriora", "golden", "orang", "tan", "dude", "eat", "kfc", "watch", "ufc", "kind", "detail", "good", "laugh", "tolman", "stiff", "deliveri", "bandmat", "brusqu", "gang", "vocal", "highlight", "dark", "caricatur", "strongman", "polit", "domest", "violenc", "song", "92", "allud", "child", "abus", "peer", "void", "small", "boy", "grow", "bad", "men", "batter", "boy", "bad", "men", "song", "horrif", "mantra", "downer", "edn", "burst", "punk", "vitalityfuzz", "volum", "speed", "bunch", "dude", "shout", "unisonit", "work", "feedback", "textur", "make", "special", "clip", "churn", "power", "chord", "lad", "life", "shimmer", "gauzi", "guitar", "tone", "presid", "sweetandsalti", "combin", "that", "place", "dog", "new", "album", "find", "band", "sound", "streamlin", "sophist", "tempt", "credit", "new", "collabor", "upgrad", "coproduc", "mickey", "grossman", "new", "guitarist", "synth", "player", "dizzi", "daldal", "daldal", "member", "orion", "sydney", "band", "overlook", "selftitl", "2017", "album", "sparkl", "document", "factori", "recordsindebt", "postpunk", "just", "dreami", "guitar", "bleak", "humor", "elev", "downer", "edn", "theyv", "got", "bona", "fide", "anthem", "rbb", "titl", "abbrevi", "red", "black", "bloc", "offici", "fan", "group", "western", "sydney", "wander", "footbal", "club", "tolman", "outspoken", "soccer", "fan", "drummer", "greg", "alfaro", "build", "momentum", "mission", "statement", "know", "fuck", "arew", "western", "sydney", "chant", "doesnt", "matter", "world", "areif", "low", "life", "town", "your", "probabl", "go", "scream", "band", "sydney", "soccer", "anthem", "hell", "happen", "recent", "melbourn", "interview", "low", "life", "discuss", "guid", "question", "creativ", "process", "easiest", "work", "best", "downer", "edn", "albumlength", "express", "philosophi", "emphasi", "repetit", "subdu", "vocal", "work", "pull", "major", "coup", "rbb", "song", "prone", "go", "stale", "peter", "rave", "slave", "theyv", "record", "that", "consist", "captiv", "there", "dark", "laugh", "screamalong", "anthem", "shove", "dreami", "nearballad", "song", "album", "variat", "melodi", "album", "closer", "crash", "end", "feel", "effortless", "flip", "record", "revisit", "pitt", "tongueincheek", "song", "essenti", "declar", "listen", "discipl", "selfawar", "joke", "mayb", "wait", "laugh", "youv", "stop", "run", "album"], "date_published": ["2019-03-16T05:00:00"], "sentiment": 0.05831833371307055, "content": "Sydney’s Mitch Tolman might not be a fan of the meathead bros he grew up around, but they’re clearly his muse. It was evident on Low Life’s debut 2014 album Dogging—the lyrics from the band’s burly and brooding post-punk songs owe quite a bit to Australian lad culture. Tolman’s got a gift for turning entitled toxic masculine bullshit into absurdist satire. “Tryin’ to be a good man, to be a good bloke/But I love gettin’ off and I’m fuckin’ stoked,” he deadpanned on Dogging ripper “DNA.” In the field of recent post-punk bands, Low Life occupy a deeply specific zone. They make muscular pit music that glistens with new wave synthesizers, and meanwhile, a dispassionate Australian voice is up front taking the piss out of sexist and homophobic dinguses. It’s a riveting mixture.\nOn their second album Downer Edn (pronounced “Downer Edition”), Low Life continue to comb through society’s sludge. Tolman still puts together elaborate depictions of dirtbags, like his portrait of the titular “Warrior”—a “golden orange tan” dude who eats KFC while watching UFC. Those kinds of details are good for a laugh or two, but Tolman’s stiff delivery and his bandmates’ brusque gang vocals highlight the darkness behind this caricature of strongman politics and domestic violence. Their song “92,” which alludes to child abuse, peers even further into the void. “Small boys grow into bad men, battered boys become very bad men” is the song’s horrific mantra.\nWhile Downer Edn bursts with punk vitality—fuzz, volume, speed, a bunch of dudes shouting in unison—it’s their work with feedback and texture that makes it special. Beyond the clipped churn of power chords on “Lad Life,” a shimmering, gauzy guitar tone presides. It’s a sweet-and-salty combination that’s been in place since Dogging, but the new album finds the band sounding more streamlined and sophisticated than ever. It’s tempting to credit their new collaborators for the upgrade, namely co-producer Mickey Grossman and new guitarist and synth player Dizzy Daldal. Daldal is also a member of Orion, a Sydney band whose overlooked self-titled 2017 album was a sparkling document of Factory Records-indebted post-punk.\nIt’s not just dreamy guitars or bleak humor that elevate Downer Edn: They’ve also got a bona fide anthem in “RBB.” The title is an abbreviation for the Red and Black Bloc, the official fan group for the Western Sydney Wanderers Football Club. (Tolman is an outspoken soccer fan.) Drummer Greg Alfaro builds momentum for their mission statement: “You know who the fuck we are/We are Western Sydney,” they chant. It doesn’t matter where in the world you are—if Low Life are in your town, you’re probably going to scream the band’s Sydney soccer anthem back at them. Hell, it even happened at a recent Melbourne show.\nIn an interview, Low Life discussed the guiding question behind their creative process: “What can we do easiest that can work the best?” Downer Edn is an album-length expression of that philosophy,  with an emphasis on repetition and subdued vocals. Sometimes it works and they pull off a major coup (“RBB”), and elsewhere, songs are prone to going stale or petering out (“Rave Slave”). They’ve put together a record that’s consistently captivating. There’s darkness and there are laughs, scream-along anthems for shoving and dreamy near-ballads. The first and last song on the album are variations on the same melody, so as album closer “Crash” ends, it feels effortless to flip the record and revisit “The Pitts.” It’s a tongue-in-cheek song where they essentially declare that you, the listener, are now their disciple. It’s a self-aware joke, but maybe wait to laugh until you’ve stopped running the album back.\n", "pptitle": ["downer", "edn"]}