{"id": "PF_50", "url": "https://pitchfork.com/reviews/albums/sigrid-sucker-punch/", "name": ["Sucker", "Punch"], "description": ["year", "arriv", "difficult", "feel", "cynic", "sigrid", "freshfac", "imag", "resist", "singl", "dont", "kill", "vibe", "releas", "februari", "2017", "establish", "pop", "iconoclast", "young", "woman", "accord", "ofttold", "stori", "left", "session", "patron", "older", "male", "writer", "write", "song", "touch", "vibe", "go", "singl", "mix", "earthinessth", "rasp", "vocal", "shown", "rel", "nake", "versesand", "machinehon", "scandinavian", "pop", "bombast", "kill", "flog", "stream", "spotifi", "bait", "cut", "cloth", "island", "thrown", "singl", "wall", "year", "arent", "sucker", "punch", "assidu", "campaign", "contemporari", "pop", "pr", "push", "insist", "sigrid", "like", "pop", "star", "doesnt", "wear", "makeup", "doesnt", "featur", "shelet", "check", "notesgot", "favorit", "tshirt", "free", "dutch", "airlin", "just", "want", "free", "sens", "22yearold", "norwegian", "exactli", "like", "pop", "star", "sell", "version", "authent", "just", "construct", "63foot", "inflat", "snake", "dude", "wear", "giant", "marshmallow", "head", "real", "shortcut", "relat", "twodimension", "affect", "slick", "debut", "album", "doe", "littl", "flesh", "sigrid", "includ", "song", "sucker", "punch", "directli", "address", "music", "industri", "attempt", "manipul", "alongsid", "dont", "kill", "vibe", "set", "album", "tone", "synthbattalion", "sweet", "busi", "dinner", "slightest", "appeal", "song", "fade", "tropic", "postcard", "decor", "geometr", "memphi", "group", "squiggl", "sophi", "kick", "sip", "pia", "colada", "lilt", "offkilt", "extract", "essenc", "sigrid", "messag", "iv", "drip", "industri", "want", "sweeter", "better", "angel", "pictur", "number", "figuresyeah", "deeper", "smarter", "astut", "summari", "contradict", "face", "young", "femal", "artist", "kiss", "impecc", "stand", "shorelinei", "just", "wanna", "swim", "float", "sing", "idli", "second", "your", "watch", "long", "brown", "hair", "rippl", "wave", "fate", "word", "reemerg", "im", "just", "tri", "sucker", "punch", "contain", "song", "endearingli", "weird", "casual", "incis", "case", "sigrid", "individu", "stranger", "improv", "dont", "kill", "vibe", "templat", "use", "tini", "percuss", "snag", "ici", "synth", "glow", "vers", "creat", "air", "genuin", "desol", "ramp", "smartli", "deploy", "edm", "riser", "belt", "choru", "invert", "came", "feverish", "synth", "arpeggi", "pack", "tight", "optim", "poetic", "attract", "stranger", "flip", "cold", "hard", "realism", "fall", "head", "heel", "aint", "real", "nearli", "song", "repeat", "formula", "effect", "save", "piano", "ballad", "feel", "like", "writer", "dark", "write", "writer", "dark", "stranger", "best", "bit", "write", "amid", "underdevelop", "concept", "basica", "wanna", "basiccaus", "make", "complicatedi", "shameless", "startfromthehashtag", "songwrit", "realli", "doe", "sound", "focusgroup", "old", "men", "sucker", "punch", "attempt", "set", "scenea", "hallway", "rendezv", "coffe", "stair", "match", "red", "hoodieswhich", "quickli", "forget", "heav", "triumphant", "majorkey", "choru", "eerili", "reminisc", "natasha", "bedingfield", "unwritten", "equal", "chipper", "right", "sound", "thing", "like", "billi", "ocean", "go", "get", "tough", "tough", "go", "dont", "feel", "like", "cri", "sight", "start", "kind", "jaunti", "slash", "string", "section", "introduc", "eurovis", "competitor", "potenti", "sigrid", "optimist", "sound", "dont", "feel", "like", "cri", "obscen", "chipper", "wasnt", "odd", "swear", "word", "easili", "pass", "kidz", "bop", "bright", "blind", "pain", "suggest", "sheer", "effort", "requir", "avoid", "wallow", "postbreakup", "sigrid", "cowrit", "credit", "sucker", "punch", "remain", "dedic", "primarycolor", "product", "scheme", "dazzl", "contrast", "contemporari", "pop", "nihilist", "grey", "formula", "song", "lack", "freespirit", "person", "telegraph", "earli", "promis", "stori", "young", "femal", "songwrit", "push", "sexist", "songwrit", "major", "label", "modern", "pop", "oppress", "beauti", "standard", "impress", "cautiou", "sucker", "punch", "insurrectionist", "spirit"], "date_published": ["2019-03-15T05:00:00"], "sentiment": 0.06651404151404151, "content": "Two years since she first arrived, it is difficult not to feel cynical about Sigrid, much as her fresh-faced image resists it. Her first single, “Don’t Kill My Vibe,” was released in February 2017, and established her as a pop iconoclast: the young woman who (at least according to her oft-told story) left a session with patronizing older male writers to write her own song about how out of touch they were. Her vibe, going by her first single, was a mix of earthiness—the rasped vocals shown off in the relatively naked verses—and machine-honed Scandinavian pop bombast. Since then, it has not been killed so much as flogged by a stream of Spotify bait cut from the same cloth: Island have thrown so many singles at the wall that three from last year aren’t even on Sucker Punch.\nHers is one of the most assiduous campaigns in contemporary pop, and yet everything about the PR push insists that Sigrid is not like the other pop stars. She doesn’t wear make-up. She doesn’t do features. She—let me check the notes—got her favorite T-shirt free from a Dutch airline, and she just wants to be free to be herself. In this sense, the 22-year-old Norwegian is exactly like the other pop stars, selling a version of authenticity that is just as constructed as a 63-foot inflatable snake or a dude wearing a giant marshmallow head. It’s “realness” as a shortcut to relatability, a two-dimensional affect that her slick debut album does little to flesh out.\nSigrid includes two songs on Sucker Punch that directly address the music industry’s attempts to manipulate her. Alongside “Don’t Kill My Vibe,” which sets the album’s tone of synth-battalion sweetness, there is “Business Dinners,” its slightest and most appealing song. It's a faded tropical postcard decorated with geometric Memphis Group squiggles; SOPHIE kicking back and sipping a piña colada. Lilting and off-kilter, it extracts the essence of Sigrid’s message as if by IV drip: The industry wants her to be “sweeter, better, angel,” “pictures, numbers, figures/Yeah, deeper, smarter,” an astute summary of the contradictions facing young female artists that she kisses off impeccably. “Standing on the shoreline/I just wanna swim and float,” she sings idly, and for a second you’re there with her, watching her long brown hair ripple in the waves. Then those fateful words re-emerge: “And I’m just trying to be me.”\nIf Sucker Punch contained more songs this endearingly weird and casually incisive, there would be a case for Sigrid’s individuality. “Strangers” improves on the “Don’t Kill My Vibe” template, using tiny percussive snags and an icy synth glow in the verses to create an air of genuine desolation. Then it ramps up, via a smartly deployed EDM riser, into a belting chorus that inverts everything that came before: the feverish synth arpeggiations packed tight, her optimism about her poetic attraction to a stranger flipped to cold, hard realism (“We’re falling head over heels for something that ain’t real”). Nearly every other song repeats the formula less effectively, save the piano ballads, which feel more like “Writer in the Dark About How to Write ‘Writer in the Dark.’”\n“Strangers” is the best bit of writing amid some underdeveloped concepts: “Basic”—as in, “I wanna be basic/‘Cause you make me so complicated”—is shameless start-from-the-hashtag songwriting that really does sound focus-grouped by old men. “Sucker Punch” attempts to set a scene—a hallway rendezvous, coffee by the stairs, matching red hoodies—which it quickly forgets as it heaves into a triumphant major-key chorus eerily reminiscent of Natasha Bedingfield’s “Unwritten.” Equally chipper is “Mine Right Now,” which sounds, of all things, like Billy Ocean’s “When the Going Gets Tough, the Tough Get Going.” “Don’t Feel Like Crying” and “Sight of You” start with the kind of jaunty, slashing string sections that introduce Eurovision competitors.\nThere is potential in Sigrid’s optimistic sound. “Don’t Feel Like Crying” is almost obscenely chipper: If it wasn’t for the odd swear word, it could easily pass for Kidz Bop. But its brightness is blinding, almost painful, suggesting the sheer effort required to avoid wallowing post-breakup. To Sigrid and her cowriters’ credit, Sucker Punch remains dedicated to this primary-color production scheme, which dazzles in contrast to contemporary pop's nihilistic grey. But its formulaic songs lack the free-spirited personality that telegraphed her early promise. The story of a young female songwriter  pushing back against the sexist songwriters on her major label and modern pop’s oppressive beauty standards is an impressive one. The cautious Sucker Punch could do with more of that insurrectionist spirit.\n", "pptitle": ["sucker", "punch"]}