{"id": "PF_26", "url": "https://pitchfork.com/reviews/albums/various-artists-electric-on-the-eel/", "name": ["Electric", "on", "the", "Eel"], "description": ["way", "jerri", "garcia", "weekend", "august", "1987", "open", "issu", "billboard", "garcia", "grate", "dead", "linger", "singl", "album", "chart", "mtvassist", "hit", "touch", "grey", "peak", "no9", "parent", "album", "dark", "climb", "6the", "10", "hit", "dead", "career", "way", "garcia", "weekend", "pack", "car", "drive", "threeandahalf", "hour", "north", "san", "francisco", "deep", "emerald", "triangl", "northern", "california", "muchcontest", "cannabisgrow", "region", "rout", "101", "ran", "eel", "river", "seclud", "spot", "known", "french", "camp", "jerri", "garcia", "longrun", "jerri", "garcia", "band", "jam", "simpl", "tapestrydrap", "stage", "nake", "hippi", "frolick", "water", "benefit", "wavi", "gravi", "camp", "winnarainbow", "new", "box", "set", "electr", "eel", "captur", "jerri", "garcia", "band", "visit", "idyl", "french", "camp", "1987", "1989", "1991", "jerri", "garcia", "height", "fame", "simultan", "escap", "notsosecret", "ident", "1970", "garcia", "play", "outsid", "dead", "variou", "music", "guis", "hide", "plain", "sight", "regular", "nonam", "jam", "session", "bay", "area", "club", "thatwith", "bassist", "john", "kahnconsolid", "jerri", "garcia", "band", "1975", "garcia", "band", "remain", "home", "play", "dark", "bar", "outlet", "kind", "laidback", "music", "opportun", "dead", "longer", "accommod", "like", "play", "thousand", "hippi", "summer", "sunshin", "wavi", "gravi", "mced", "way", "jerri", "garcia", "band", "function", "escap", "hatch", "creativ", "financi", "chao", "grate", "deadkahn", "garcia", "frequent", "music", "secondincommand", "outsid", "dead", "serv", "garcia", "longtim", "drug", "buddi", "summer", "1986", "garcia", "fell", "diabet", "coma", "nearli", "die", "year", "addict", "ill", "health", "taken", "toll", "came", "relearn", "play", "guitar", "took", "stage", "decent", "health", "time", "nearli", "decad", "new", "sens", "agenc", "purpos", "hear", "ravag", "clariti", "lowkey", "session", "electr", "eel", "document", "jerri", "garcia", "band", "unpretenti", "grate", "dead", "convolut", "repertoir", "deep", "bar", "act", "platform", "garcia", "endless", "guitar", "variat", "straightforward", "rhythm", "section", "plu", "backup", "singer", "support", "garcia", "scar", "voic", "uncompl", "sweet", "lie", "blurri", "intersect", "rock", "rb", "motown", "gospel", "cushion", "envelop", "warmth", "melvin", "seal", "hammond", "organ", "gloria", "jone", "jacklyn", "labranch", "back", "vocal", "music", "intend", "danc", "feel", "good", "box", "set", "dip", "garcia", "bag", "trust", "extradead", "origin", "includ", "1982", "charg", "run", "rose", "1976", "redempt", "mission", "rain", "1977", "apocalypt", "gomorrah", "electr", "eel", "devot", "songbook", "cover", "emerg", "jamband", "vernacular", "garcia", "help", "defin", "31", "differ", "song", "electr", "eel", "dozen", "new", "songbook", "garcia", "coma", "includ", "bruce", "cockburn", "wait", "miracl", "latecar", "stapl", "twilight", "pine", "lonesom", "deep", "cut", "band", "garcia", "voic", "especi", "strong", "confid", "crisp", "version", "lo", "loboss", "evangelin", "1987", "1989", "version", "crack", "minut", "bounc", "like", "streamlin", "earli", "70", "dead", "garcia", "vocal", "despit", "ampl", "wear", "tear", "arguabl", "best", "shape", "later", "year", "nearli", "track", "sterl", "exampl", "damag", "voic", "incred", "singer", "scratch", "year", "cigarett", "freebas", "persian", "heroin", "garcia", "voic", "flutter", "shake", "doesnt", "sustain", "note", "land", "right", "pitch", "transpos", "vers", "forget", "lyric", "sing", "reason", "listen", "electr", "eel", "guitar", "play", "fill", "rejuven", "bright", "mirror", "melvin", "seal", "buoyant", "organ", "capabl", "clariti", "articul", "power", "garcia", "sing", "spiritu", "folki", "day", "earli", "60", "butin", "postcoma", "returnhi", "voic", "find", "grace", "cours", "track", "make", "way", "inevit", "guitar", "solo", "ill", "simpl", "c", "g", "feel", "brand", "new", "garcia", "sing", "cover", "allen", "toussaint", "ill", "melodi", "rare", "bit", "boast", "garcia", "stapl", "solo", "show", "earli", "70", "song", "brilliant", "variat", "tune", "garcia", "guitar", "unlock", "languag", "cosmo", "gener", "bar", "fodder", "like", "eric", "clapton", "lay", "salli", "garcia", "tune", "earli", "80", "sound", "closer", "music", "screensav", "1987", "garcia", "play", "sing", "regain", "urgenc", "cosmo", "reach", "compar", "languid", "garcia", "band", "extravaganza", "70", "electr", "eel", "show", "fairli", "concis", "excel", "exploratori", "jama", "14minut", "dont", "let", "1989but", "perform", "fall", "10minut", "mark", "anchor", "drummer", "david", "kemper", "describ", "band", "particular", "groov", "simultan", "have", "foot", "ga", "pedal", "foot", "brake", "band", "flexibl", "easi", "slide", "garcia", "improvis", "stretch", "music", "electr", "eel", "circul", "fanmad", "audienc", "tape", "record", "provid", "upgrad", "deeper", "head", "scope", "set", "fine", "way", "jerrycuri", "deeper", "dive", "consid", "garcia", "band", "golden", "period", "deadhead", "jerri", "garcia", "jerri", "garcia", "band", "escap", "dead", "electr", "eel", "show", "move", "light", "dead", "long", "lost", "disc", "comprehens", "document", "group", "penultim", "lineup", "fine", "introduct", "jerri", "garcia", "band", "best", "music", "make", "hassl", "disappear"], "date_published": ["2019-03-22T05:00:00"], "sentiment": 0.16562370522766562, "content": "One way to find Jerry Garcia the last weekend of August 1987 was to open an issue of Billboard, where Garcia and the Grateful Dead lingered on both the singles and albums charts. The MTV-assisted hit “Touch of Grey” peaked at No.9, while parent album In the Dark climbed to No. 6—the only two Top 10 hits of the Dead’s career. Another way to find Garcia that same weekend was to pack the car and drive three-and-a-half hours north of San Francisco, deep into the Emerald Triangle, northern California’s much-contested cannabis-growing region, until Route 101 ran along the Eel River. There, at a secluded spot known as French’s Camp, Jerry Garcia and his long-running Jerry Garcia Band jammed on a simple tapestry-draped stage while naked hippies frolicked in the water, a benefit for Wavy Gravy’s Camp Winnarainbow.\nA new box set, Electric on the Eel, captures the Jerry Garcia Band on their three visits to the idyllic French’s Camp in 1987, 1989, and 1991. They show Jerry Garcia at both the height of his fame and simultaneously escaping into his not-so-secret identity: himself. Since 1970, Garcia had played outside the Dead in various musical guises, hiding in plain sight at regular no-name jam sessions in Bay Area clubs that—with bassist John Kahn—consolidated into the Jerry Garcia Band by 1975. Though the Garcia Band would remain most at home playing in dark bars, they also became an outlet for the kind of laid-back musical opportunities the Dead could no longer accommodate, like playing for a few thousand hippies in the summer sunshine while Wavy Gravy MCed.\nIn more ways than one, The Jerry Garcia Band functioned as an escape hatch from the creative and financial chaos of the Grateful Dead—Kahn, Garcia’s frequent musical second-in-command outside the Dead, also served as Garcia’s longtime drug buddy. In the summer of 1986, Garcia fell into a diabetic coma and nearly died. Years of addiction and ill health had taken their toll, and when he came to, he had to relearn how to play guitar. When he took the stage again, in decent health for the first time in nearly a decade, he had a new sense of agency and purpose. You can hear that ravaged clarity even in these low-key sessions.\nAs Electric on the Eel documents, the Jerry Garcia Band was as unpretentious as the Grateful Dead were convoluted. With the repertoire of a deep bar act, they were a platform for Garcia’s endless guitar variations over a more straightforward rhythm section, plus backup singers to support Garcia’s scarred voice. It is uncomplicated and often sweet, lying at the blurry intersection of rock, R&B, Motown, and gospel, cushioned by the enveloping warmth of Melvin Seals’ Hammond organ and Gloria Jones and Jacklyn LaBranch’s backing vocals. It is music intended for dancing or, at least, feeling good.\nThe box set dips into Garcia’s bag of trusted extra-Dead originals, including 1982’s charging “Run For the Roses,” 1976’s redemptive “Mission in the Rain,” and 1977’s apocalyptic “Gomorrah.” But most of Electric on the Eel is devoted to a songbook of covers in the emerging jam-band vernacular that Garcia was helping to define. Among the 31 different songs on Electric on the Eel, more than a dozen were new to the songbook since Garcia’s coma, including Bruce Cockburn’s “Waiting For A Miracle,” which became a late-career staple, and “Twilight,” a pining and lonesome deep cut by The Band. Garcia’s voice is especially strong and confident on crisp versions of Los Lobos’s “Evangeline” from 1987 and 1989, neither version cracking four minutes, both bouncing like the streamlined early ‘70s Dead.\nGarcia’s vocals, despite ample wear and tear, are in arguably the best shape of his later years. Nearly every track is a sterling example of how someone with a damaged voice can also be an incredible singer. Scratched from years of cigarettes and freebasing Persian heroin, Garcia’s voice flutters and shakes. He doesn’t always sustain notes or land on the right pitch. Sometimes, he transposes verses or forgets lyrics. And yet, his singing is as much a reason to listen to Electric on the Eel as his guitar playing, both filled with a rejuvenating brightness mirrored in Melvin Seals’ buoyant organ, and capable of clarity, articulation, and even power. Garcia had been singing spirituals since his folkie days in the early ‘60s, but—in its post-coma return—his voice finds more grace than ever.\nOf course, every track makes its way to the inevitable guitar solo. “I’ll take a simple C to G and feel brand new about it,” Garcia sings on a cover of Allen Toussaint’s “I’ll Take a Melody,” perhaps a rare bit of boasting on Garcia’s part. A staple of his solo shows since the early ’70s, it’s also a song that became his own, in part through his brilliant variations on it. To those tuned in, Garcia’s guitar could unlock the language of the cosmos even on generic bar fodder like Eric Clapton’s “Lay Down Sally.”  When Garcia was tuned out, though, as he was for much of the early ‘80s, it could also sound closer to a musical screensaver. By 1987, Garcia’s playing and singing had both regained their former urgency, the cosmos once again within reach.\nCompared to the languid Garcia Band extravaganzas of the ’70s, the Electric on the Eel shows are fairly concise. There is one excellent exploratory jam—a 14-minute “Don’t Let Go” from 1989—but most performances fall under the 10-minute mark. Anchored by drummer David Kemper, who once described the band’s particular groove as simultaneously “having the foot on the gas pedal and foot on the brakes,” the band is flexible and easy, sliding with Garcia as his improvisations stretch.\nMost of the music on Electric on the Eel has only circulated as fan-made audience tapes, so these recordings will provide upgrades for deeper heads. But the scope of the set is also a fine way for the Jerry-curious to take a deeper dive into what many consider to be the Garcia Band’s golden period. For some Deadheads, as for Jerry Garcia himself, the Jerry Garcia Band became their own escape from the Dead, and Electric on the Eel shows why, moving with a lightness the Dead had long since lost. Its six discs are both a comprehensive document of the group’s penultimate lineup and a fine introduction to the Jerry Garcia Band at their best, music to make the hassles disappear.\n", "pptitle": ["electr", "eel"]}