{"id": "PF_38", "url": "https://pitchfork.com/reviews/albums/meitei-komachi/", "name": ["Komachi"], "description": ["storytel", "build", "world", "set", "boundari", "shapeless", "void", "writer", "set", "vast", "empti", "natur", "law", "intric", "system", "interact", "organ", "stori", "inhabit", "world", "root", "fantasi", "ground", "annal", "histori", "komachi", "new", "album", "hiroshimabas", "produc", "meitei", "draw", "heavili", "notion", "result", "sonic", "landscap", "indebt", "j", "dilla", "steve", "reich", "east", "asian", "instrument", "note", "japanes", "produc", "like", "susumu", "yokota", "craft", "state", "mission", "recaptur", "describ", "lost", "japanes", "mood", "track", "meitei", "latest", "releas", "inspir", "recent", "loss", "99yearold", "grandmoth", "album", "deriv", "titl", "ono", "komachi", "eighth", "centuri", "waka", "poet", "mythic", "beauti", "profoundli", "wist", "write", "earn", "countless", "suitor", "elev", "stuff", "legend", "japanes", "komachi", "use", "shorthand", "great", "feminin", "beauti", "beauti", "manifest", "form", "komachi", "gone", "ghost", "stori", "meitei", "2018", "releas", "kwaidan", "convey", "raspi", "spokenword", "fragment", "gloam", "ambienc", "stead", "brighter", "peal", "intric", "woven", "tradit", "japanes", "percuss", "field", "record", "familiar", "warmth", "tape", "hiss", "present", "rare", "oppress", "provid", "naturalist", "undercurr", "song", "chouchin", "sound", "meitei", "lift", "fragment", "ancient", "dream", "laid", "16", "pad", "modernday", "mpc", "beat", "machin", "track", "like", "ike", "sento", "pti", "babbl", "brook", "peek", "underneath", "layer", "pluck", "nois", "twopart", "kawanab", "kyosai", "name", "demon", "paint", "prodigi", "visual", "artist", "scholar", "consid", "father", "modernday", "manga", "kyosai", "pti", "longest", "track", "minut", "revolv", "cascad", "melod", "interplay", "eventu", "give", "way", "pitchshift", "oblivion", "shinkai", "deep", "sea", "album", "contemporarysound", "track", "echo", "tail", "lone", "piano", "note", "anchor", "unwav", "lowfrequ", "heartbeat", "evok", "perspect", "diver", "plung", "pacif", "fortuit", "youtub", "algorithm", "lofi", "beat", "longawait", "reissu", "recent", "reignit", "20th", "centuri", "japanes", "ambient", "work", "modern", "practition", "like", "meitei", "best", "observ", "evolut", "distinct", "lineag", "music", "product", "style", "constant", "flux", "motif", "fade", "focu", "subtl", "filter", "low", "bit", "depth", "sampler", "technolog", "color", "pastor", "element", "composit", "represent", "style", "allow", "meitei", "conjur", "uniqu", "interpret", "mono", "awar", "japanes", "concept", "melancholia", "invok", "inevit", "imperman", "new", "school", "reinterpret", "old", "way", "discov", "lesson", "embrac", "transienc", "ancestor", "sought", "realiz", "art"], "date_published": ["2019-03-19T05:00:00"], "sentiment": 0.15049407114624505, "content": "In storytelling, to build a world is to set the boundaries of a shapeless void. Writers set out to fill that vast emptiness with natural laws, intricate systems that interact with one another and organize the stories of their inhabitants. Some worlds are rooted in fantasy, while others are more grounded in the annals of history. Komachi, the new album from Hiroshima-based producer Meitei, draws heavily from both of these notions, resulting in sonic landscapes that are as indebted to J. Dilla and Steve Reich as they are to East Asian instrumentation and noted Japanese producers like Susumu Yokota.\nCrafted with the stated mission of recapturing what he describes as a “lost Japanese mood,” the tracks on Meitei’s latest release were inspired by the recent loss of his 99-year-old grandmother. The album derives its title from Ono no Komachi, the eighth century waka poet whose mythical beauty and profoundly wistful writing earned her countless suitors and elevated her to the stuff of legend. (In Japanese, komachi is often used as shorthand for a great feminine beauty.)\nBeauty manifests in many forms throughout Komachi. Gone are the ghost stories of Meitei’s 2018 release Kwaidan, which were conveyed via raspy spoken-word fragments and gloaming ambience. In their stead are brighter peals, intricately woven with traditional Japanese percussion. Field recordings and the familiar warmth of tape hiss are still present but rarely oppressive, providing a naturalistic undercurrent throughout. Some songs, such as “Chouchin,” sound as if Meitei lifted fragments from an ancient dream and laid them out across the 16 pads of a modern-day MPC beat machine. On other tracks, like “Ike” and “Sento [Pt.I],” babbling brooks peek out from underneath layers of plucks and noise.\nThe two-part “Kawanabe Kyosai” is named for the “demon of painting” himself, the prodigious visual artist who many scholars consider to be the father of modern-day manga. “Kyosai [Pt.I],” the longest track at almost nine minutes, revolves around cascading melodic interplay that eventually gives way to pitch-shifted oblivion. Meanwhile, “Shinkai” (“deep sea”) is perhaps the album’s most contemporary-sounding track: Echo tails of lonely piano notes are anchored by an unwavering low-frequency heartbeat, evoking the perspective of a diver plunged into the Pacific.\nFortuitous YouTube algorithms, “lo-fi beats,” and long-awaited reissues have recently reignited interest in 20th century Japanese ambient, but it’s through the work of modern practitioners like Meitei that one can best observe the evolution of this distinctive lineage of music. His production style is one of constant flux; motifs fade in and out of focus via subtle filtering, and the low bit depth of sampler technology colors even the most pastoral elements of his compositions. It’s this representational style that allows Meitei to conjure a unique interpretation of mono no aware, the Japanese concept of melancholia invoked by the inevitability of impermanence. The new school reinterprets the old, and along the way discovers the same lessons in embracing transience that the ancestors sought to realize in their own art.\n", "pptitle": ["komachi"]}