{"id": "PF_90", "url": "https://pitchfork.com/reviews/albums/westkust-westkust/", "name": ["Westkust"], "description": ["sweden", "westkust", "exist", "brink", "annihil", "immedi", "form", "decad", "ago", "endur", "seri", "tumultu", "lineup", "chang", "solidifi", "2011", "fivepiec", "includ", "member", "fellow", "gothenburg", "rocker", "makthaverskan", "releas", "junk", "ep", "grungeting", "surfrock", "record", "fuzzi", "postpunklac", "debut", "lp", "forev", "just", "record", "earn", "intern", "attent", "westkust", "fade", "background", "makthaverskan", "member", "depart", "leav", "rest", "band", "struggl", "finish", "westkust", "record", "start", "2016", "tragic", "comedi", "error", "westkust", "releas", "coincid", "dissolut", "label", "heartbeat", "gothenburg", "indi", "commun", "luxuri", "born", "sisyphean", "struggl", "westkust", "testament", "resili", "built", "year", "restraint", "frustrat", "burst", "bright", "haziest", "moment", "fulllength", "westkust", "cast", "shoegaz", "revivalist", "broad", "signifi", "like", "co", "vocalist", "gauzi", "reverb", "actual", "song", "tune", "featur", "propuls", "basslin", "skyhigh", "chord", "progress", "drum", "pattern", "owe", "ramon", "ride", "westkust", "band", "aim", "break", "prematur", "categor", "swebeach", "open", "record", "massiv", "guitar", "riff", "cut", "air", "like", "garagerock", "alarm", "crash", "headlong", "punk", "rhythm", "anchor", "song", "guitar", "return", "add", "brief", "shini", "solo", "speedi", "tendenc", "drum", "bass", "win", "immedi", "dispatch", "shoegaz", "notion", "song", "feel", "selfcontain", "particularli", "feedbackheavi", "note", "doe", "hold", "soon", "give", "way", "neat", "pop", "structuremelodi", "resolut", "song", "end", "mirror", "begin", "textur", "borrow", "shoegaz", "like", "twinkl", "guitar", "tambourin", "hit", "rush", "cohabit", "echo", "postpunk", "basslin", "uptempo", "beat", "westkust", "play", "palpabl", "enthusiasm", "manag", "evok", "adolesc", "excit", "music", "discoveri", "feel", "owe", "larg", "singer", "julia", "bjernelind", "voic", "melt", "song", "guid", "melodi", "previou", "record", "gustav", "andersson", "share", "vocal", "duti", "song", "split", "brash", "offkilt", "speaksing", "bjernelind", "honey", "croon", "use", "voic", "layer", "stretch", "harmon", "instrument", "fight", "ador", "sunni", "pop", "track", "inflect", "shift", "match", "reverbwash", "guitar", "know", "ive", "toldyour", "kiss", "sun", "sing", "andersson", "fight", "melodi", "track", "easi", "want", "make", "song", "just", "feel", "good", "listen", "bjernelind", "confirm", "time", "westkust", "feel", "good", "threaten", "dissolv", "background", "daylight", "start", "strum", "pattern", "reminisc", "sixpenc", "richer", "kiss", "establish", "slow", "swirl", "rhythm", "unlik", "rest", "record", "stay", "path", "add", "bjernelind", "lilt", "downtrodden", "vocal", "song", "hypnot", "dull", "familiar", "warmth", "kick", "drum", "shake", "fog", "cotton", "sky", "soon", "westkust", "fade", "theyv", "return", "ebulli"], "date_published": ["2019-03-07T06:00:00"], "sentiment": 0.10456969246031747, "content": "Sweden’s Westkust have always existed at the brink of annihilation. Almost immediately after forming a decade ago, they endured a series of tumultuous lineup changes before solidifying in 2011 as a five-piece, including two members of fellow Gothenburg rockers Makthaverskan. Together, they released the Junk EP, a grunge-tinged surf-rock record, and their fuzzy, post-punk-laced debut LP, Last Forever. But just as that record earned international attention, Westkust faded into the background. Both Makthaverskan members departed, leaving the rest of the band to struggle to finish Westkust, the record they started in 2016.\nIn an almost tragic comedy of errors, Westkust’s release also coincides with the dissolution of the label that was the heartbeat of Gothenburg’s indie community, Luxury. Born of this Sisyphean struggle, Westkust is a testament to resilience built from years of restraint and frustration. It bursts with brightness, even in its haziest moments.\nWith their first full-length, Westkust were cast as shoegaze revivalists, due more to broad signifiers like co-ed vocalists and gauzy reverb than to the actual songs. The tunes, after all, featured propulsive basslines, sky-high chord progressions, and drumming patterns that owed more to the Ramones than Ride. On Westkust, the band aims to break out of this premature categorization. “Swebeach” opens the record with a massive guitar riff that cuts through the air like a garage-rock fire alarm before crashing headlong into the punk rhythm that anchors the song. The guitar returns to add a brief, shiny solo, but the speedy tendencies of the drum and bass win out, immediately dispatching those shoegaze notions.\nThese songs feel self-contained. When a particularly feedback-heavy note does take hold, it soon gives way to a neat pop structure—melodies find their resolution, and songs often end by mirroring their beginning. Even textures borrowed from shoegaze, like the twinkling guitars and tambourine hits of “Rush,” cohabitate with echoing post-punk basslines and uptempo beats. Westkust play with such palpable enthusiasm that they manage to evoke the adolescent excitement of musical discovery.\nThis feeling owes in large part to singer Julia Bjernelind, whose voice melts into the songs while guiding their melodies. On previous records, where Gustav Andersson shared vocal duties, their songs were split between his brash, off-kilter speak-singing and Bjernelind’s honeyed crooning. But here, she uses her voice as yet another layer, stretching out to harmonize with the instruments rather than fight them. On “Adore,” a sunny pop track, her inflection shifts to match the reverb-washed guitar: “You know that I’ve been told/You’re kissed by the sun,” she sings. Without Andersson to fight against the melody, these tracks go down easy. “We wanted to make songs that just feel good to listen to,” Bjernelind has confirmed.\nAt times, Westkust feels so good it threatens to dissolve into the background. “Daylight,” which starts with a strumming pattern reminiscent of Sixpence None the Richer’s “Kiss Me,” establishes a slow, swirling rhythm and, unlike the rest of the record, stays the path. Add in Bjernelind’s lilting, downtrodden vocal, and the song becomes hypnotically dull and familiar. But the warmth of a kick drum shakes off the fog on “Cotton Skies.” As soon as Westkust faded, they’ve returned in full ebullience.\n", "pptitle": ["westkust"]}