{"id": "PF_58", "url": "https://pitchfork.com/reviews/albums/oozing-wound-high-anxiety/", "name": ["High", "Anxiety"], "description": ["chicago", "trio", "ooz", "wound", "plant", "flag", "spot", "metal", "punk", "experiment", "meet", "album", "firmli", "devot", "keep", "space", "weird", "uncomfort", "high", "anxieti", "doesnt", "stray", "aesthet", "thrashi", "entir", "thrash", "dirti", "smear", "edg", "remain", "sick", "shit", "definit", "shit", "exponenti", "expand", "spite", "blob", "chang", "theyr", "freak", "underground", "metal", "need", "understand", "zack", "weil", "shriek", "open", "surround", "fuck", "idiot", "bile", "guitar", "easili", "understand", "theyr", "interest", "metaphor", "dress", "hatr", "latin", "sigil", "second", "half", "idiot", "lurch", "swampi", "rif", "mutat", "thrash", "breakdown", "throw", "bunch", "aforement", "idiot", "cliff", "stagediv", "offer", "releas", "annihil", "tween", "shitbag", "equal", "incendiari", "weil", "sarcast", "yell", "oh", "man", "realli", "love", "band", "antiindustri", "screed", "new", "york", "band", "debut", "retrash", "high", "anxieti", "recal", "voivod", "die", "mar", "ride", "univers", "just", "space", "theme", "punki", "thrash", "prog", "goofi", "chop", "mar", "throw", "death", "metal", "mix", "intro", "guitar", "lead", "sound", "like", "bolt", "thrower", "solo", "drift", "trashfil", "outer", "space", "song", "hous", "show", "terrarium", "popul", "metal", "dude", "strang", "paytoplay", "club", "punk", "punish", "phd", "program", "ooz", "wound", "make", "chao", "coalesc", "theyr", "ooz", "wound", "indebt", "midwestern", "nois", "rock", "like", "wolf", "eye", "destroy", "monster", "weird", "thrash", "slogan", "world", "fastest", "nois", "rock", "band", "pass", "muster", "nois", "rock", "moment", "high", "anxieti", "actual", "longest", "slowest", "song", "birth", "flat", "earther", "plod", "drag", "like", "amrep", "highgain", "highstrung", "blast", "beat", "energ", "grim", "proceed", "earther", "hint", "weari", "loom", "high", "anxieti", "theyr", "dish", "hate", "start", "record", "call", "know", "rock", "roll", "im", "tire", "longer", "opaqu", "titl", "surround", "fuck", "idiot", "day", "exhaust"], "date_published": ["2019-03-18T05:00:00"], "sentiment": -0.14726338055883512, "content": "The Chicago trio Oozing Wound have planted their flag in the spot where metal, punk, and experimental meet. Four albums in, they are firmly devoted to keeping that space both weird and uncomfortable. High Anxiety doesn’t stray from their aesthetic: it’s thrashy if not entirely thrash, it’s dirty and smeared at the edges, and they remain sick of your shit, with their definition of “your shit” an exponentially expanding, spiteful blob. Even without changing much, they’re still the freaks underground metal needs.\nWhether or not you can understand any of Zack Weil’s shrieks in the opener “Surrounded by Fucking Idiots,” the bile in his guitar is easily understandable. They’re not interested in metaphors or dressing up their hatred in Latin and sigils. The second half of “Idiots” lurches into swampy riffing, a mutated take on a thrash breakdown. It’s more for throwing a bunch of aforementioned idiots off a cliff than for stage-diving, offering no release but annihilation. “Tween Shitbag” is equally incendiary, with Weil sarcastically yelling “Oh man I really love your band!”, a call back to the anti-industry screed “New York Bands” from their debut Retrash.\nHigh Anxiety also recalls Voivod on “Die on Mars” and “Riding the Universe,” not just for their space themes but also how punky thrash and prog goofiness chop it up with one another. “Mars” throws some death metal in the mix, the intro guitar leads sounding like Bolt Thrower solos drifting into a trash-filled outer space. These songs are house shows as terrariums populated by metal dudes too strange for the pay-to-play clubs and punks who punish themselves in Ph.D. programs, and Oozing Wound makes the chaos coalesce. They’re serious, but not serious.\nOozing Wound have always been indebted to Midwestern noise rock like Wolf Eyes and Destroy All Monsters as much as weird thrash — their slogan “the world’s fastest noise rock band” passes muster. The most noise rock moment on High Anxiety is actually the longest and slowest song: “Birth of Flat Earther” plods and drags like AmRep at its most high-gain and high-strung, with no blast beats to energize the grim proceedings. “Earther” also hints at weariness that looms over High Anxiety: they’re still dishing out hate, but it’s starting to get to them. The record was almost called I Know It’s Only Rock and Roll but I’m Tired of It, a longer yet less opaque title. If you were surrounded by fucking idiots all day, you would be exhausted, too.\n", "pptitle": ["high", "anxieti"]}