{"id": "PF_2", "url": "https://pitchfork.com/reviews/albums/nav-bad-habits/", "name": ["Bad", "Habits"], "description": ["nav", "announc", "retir", "month", "ago", "hiphop", "fan", "care", "punjabicanadian", "mc", "decis", "solidar", "buddi", "lil", "uzi", "vert", "far", "superior", "talent", "recent", "declar", "music", "hindsight", "predict", "nav", "creatur", "imit", "crib", "style", "variou", "peer", "far", "interest", "result", "travi", "scott", "autotun", "croon", "fellow", "torontonian", "drake", "minim", "product", "he", "artist", "equival", "meme", "sketch", "charact", "throw", "invent", "slide", "ruin", "special", "place", "bad", "habit", "socal", "comeback", "album", "hollow", "magicfre", "entri", "traprap", "canon", "best", "song", "servic", "banger", "nod", "club", "worst", "collect", "strang", "admiss", "thank", "nav", "affin", "take", "serious", "come", "cringeworthi", "lone", "highlight", "project", "come", "earli", "choru", "im", "readi", "nav", "find", "melod", "pocket", "hum", "congest", "chest", "smoke", "backwood", "leav", "facedown", "plate", "spaghetti", "pull", "mobstyl", "hit", "ridicul", "visual", "show", "nav", "make", "limit", "vocal", "rang", "nasal", "thrum", "come", "endear", "frailti", "thing", "straight", "downhil", "track", "take", "chanc", "nav", "drop", "clunker", "boast", "like", "rockin", "closet", "tell", "favorit", "got", "plenti", "cloth", "choru", "wors", "dont", "like", "take", "chancesi", "like", "fuck", "hoe", "know", "declar", "paranoia", "show", "constantli", "bad", "habit", "nav", "tell", "constantli", "doesnt", "trust", "outsid", "circl", "leav", "home", "weapon", "imposs", "kiddiepool", "scarfac", "routin", "serious", "paranoid", "delus", "follow", "giggl", "admiss", "like", "got", "littl", "bad", "bitchgot", "work", "butt", "butt", "meek", "who", "featur", "track", "take", "nav", "cue", "oneup", "rap", "thumb", "ahol", "contrast", "dynam", "tax", "fact", "nav", "doesnt", "lean", "weird", "nearli", "learn", "thing", "atlanta", "odditi", "young", "thug", "appear", "song", "tussin", "highlight", "eccentr", "nav", "songwrit", "base", "sinist", "tough", "talk", "doesnt", "suit", "bore", "boot", "time", "weeknd", "appear", "price", "head", "sing", "price", "peopl", "head", "your", "complet", "burn", "combin", "pain", "repetit", "productionth", "drum", "pattern", "consecut", "track", "dior", "runner", "vicodin", "virtual", "identicaland", "bad", "habit", "includ", "blatant", "misogyni", "homophobia", "project", "recent", "memori", "said", "your", "fuckboy", "turn", "dyke", "particularli", "memor", "blurt", "ignor", "start", "pine", "simpler", "time", "week", "ago", "nav", "supposedli", "mic", "good"], "date_published": ["2019-03-28T05:00:00"], "sentiment": -0.008898957592987436, "content": "When Nav announced his retirement two months ago, hip-hop fans, for the most part, could care less. The Punjabi-Canadian MC made the decision out of solidarity with his buddy Lil Uzi Vert, a far superior talent who had recently declared that he was “done with music.” In hindsight the move was predictable; Nav has always been a creature of imitation, cribbing the styles of his various peers to far less interesting results, whether it’s Travis Scott’s Auto-Tuned croons or fellow Torontonian Drake’s minimal production. He’s the artistic equivalent of the “I Made This” meme, only the sketched character throws up on the invention in the third slide, ruining what made it special in the first place. Bad Habits, his so-called comeback album, is more of the same, a hollow and magic-free entry into the trap-rap canon. At its best, its songs are serviceable bangers to nod off in the club to; at its worst, it’s a collection of strange admissions that, thanks to Nav’s affinity for taking himself too seriously, come off cringe-worthy.\nThe lone highlight of the project comes early on the chorus for “I’m Ready,” where Nav for once finds himself in the melodic pocket, humming about his congested chest from smoking too many Backwoods and leaving someone facedown in a plate of spaghetti after pulling a mob-style hit. It’s a ridiculous visual, but shows Nav making the most out of his limited vocal range, his nasally thrum coming off almost endearing in its frailty. Things go straight downhill from there, though. On the very next track, “Taking Chances,” Nav is back to dropping clunker boasts like, “Rockin' my closet, I can't tell you my favorite, I got plenty of clothes.” The chorus is even worse: “I don’t like taking chances/I like fucking hoes I already know,” he declares.\nThis paranoia shows up constantly on Bad Habits. Nav tells us constantly that he doesn’t trust anyone outside his circle, that he never leaves home without a weapon. It’s impossible to take this kiddie-pool Scarface routine seriously when his paranoid delusions are followed up by giggling admissions like “Got a little bad bitch/Got some work done on her butt (On her butt).” (Meek Mill, who’s featured on the track, takes Nav’s cue and one-ups him by rapping, “Put my thumb all in her A-hole.”)\nIt’s a contrasting dynamic made more taxing by the fact that Nav doesn’t lean into his weirdness nearly enough, something he could learn a thing or two about from Atlanta oddity Young Thug, who appears here on the song “Tussin.” Rather than highlight his own eccentricities, Nav’s songwriting is based in sinister tough talk, which doesn’t suit him and is boring to boot. By the time The Weeknd appears on “Price On My Head,” singing about, well, prices on people’s heads, you’re completely burned out. Combine this with painfully repetitive production—the drum patterns on two consecutive tracks, “Dior Runners” and “Vicodin,” are virtually identical—and that Bad Habits includes more blatant misogyny and homophobia than any project in recent memory (“She said you're such a fuckboy that you made her turn dyke,” is one particularly memorable blurt of ignorance) and you start to pine for a simpler time, only a few weeks ago, when Nav had supposedly put down the mic for good.\n", "pptitle": ["bad", "habit"]}