{"id": "PF_66", "url": "https://pitchfork.com/reviews/albums/dido-still-on-my-mind/", "name": ["Still", "on", "My", "Mind"], "description": ["year", "album", "girl", "got", "away", "20", "year", "ubiquit", "debut", "angel", "dido", "version", "pop", "distinguish", "lack", "drama", "london", "singer", "uk", "bestsel", "artist", "time", "keen", "pop", "mantra", "thank", "white", "flag", "reliabl", "soundtrack", "tesco", "nation", "evenkeel", "approach", "feel", "remov", "volatil", "acrobat", "catharsi", "adel", "ami", "winehous", "elli", "gould", "peer", "past", "decad", "song", "feel", "like", "exhal", "action", "happen", "dido", "song", "tumult", "resolv", "time", "record", "breakup", "ballad", "simmer", "loss", "melancholi", "regret", "indecis", "sweep", "love", "anthem", "runway", "left", "chase", "snug", "content", "bright", "promis", "live", "anoth", "faith", "music", "lack", "heat", "make", "reliabl", "serenityth", "sens", "she", "emot", "heavylift", "offstag", "song", "offer", "coda", "conduit", "extrem", "matur", "wordsnot", "sexiest", "bait", "pop", "music", "balm", "dido", "fifth", "album", "mind", "guid", "path", "seren", "easi", "listen", "electron", "ode", "marriag", "motherhood", "bask", "comfort", "stun", "asset", "voicea", "glossi", "palati", "purr", "fray", "edg", "nod", "clearli", "enya", "dolor", "oriordan", "cranberri", "sing", "hurrican", "frighten", "upend", "sourc", "power", "realli", "ask", "stand", "partner", "forev", "face", "delic", "late90", "synth", "beat", "brother", "regular", "collabor", "rollo", "armstrong", "offer", "light", "gale", "forc", "titl", "conjur", "soon", "dido", "sing", "harshest", "jar", "lyric", "ive", "way", "let", "goit", "gonna", "rip", "heart", "offer", "tranquilli", "malic", "kitten", "gif", "skip", "falsetto", "dash", "whimsi", "imagin", "eminem", "sampl", "stan", "ubiquit", "bray", "line", "marvel", "convers", "let", "share", "hit", "song", "let", "heart", "swell", "embrac", "gorgeou", "absurd", "potenti", "world", "cap", "knowledg", "dido", "name", "son", "stan", "danc", "floor", "beckon", "home", "ride", "featheri", "disco", "puls", "undercurr", "rakish", "eleg", "surfac", "sing", "song", "homebut", "dido", "sing", "unboth", "neutral", "middl", "regist", "doesnt", "jump", "octav", "arpeggi", "usual", "disco", "convent", "notabl", "danc", "track", "style", "usual", "suggest", "momentum", "dido", "sing", "twist", "wind", "passiv", "houselit", "back", "emphas", "lack", "vocal", "heat", "friend", "danc", "track", "confid", "brushoff", "ex", "simmer", "gentl", "prototrl", "amiabl", "sound", "date", "angel", "winsom", "mix", "plenti", "career", "pop", "singer", "second", "live", "hous", "edm", "track", "amp", "voic", "fresh", "relev", "kelli", "rowland", "lenni", "kravitz", "leona", "lewi", "mind", "dip", "danc", "realm", "suggest", "dido", "shed", "need", "dynam", "back", "mayb", "danc", "track", "dont", "land", "simpli", "club", "dido", "want", "mind", "close", "track", "stay", "sound", "enamor", "nearli", "capella", "open", "just", "puff", "echo", "sing", "delic", "love", "ode", "son", "promis", "shell", "stick", "endur", "young", "histrion", "troubl", "leav", "he", "truli", "readi", "caus", "that", "love", "darl", "preternatur", "certainti", "dido", "show", "realli", "warm", "song", "mind", "present", "convict", "fulli", "form", "confid", "feel", "infecti", "cours", "marriag", "face", "storm", "come", "intact", "cours", "shell", "continu", "shun", "ghost", "past", "guid", "son", "bright", "futur", "declar", "shall"], "date_published": ["2019-03-13T05:00:00"], "sentiment": 0.16441589811155022, "content": "Six years after her last album, Girl Who Got Away, and 20 years after her ubiquitous debut, No Angel, Dido’s version of pop is still most distinguishable for what it lacks: drama. The London singer may be one of the UK’s best-selling artists of all time, with her keening pop mantras “Thank You” and “White Flag” still reliable soundtracks in Tescos the nation over, but her even-keel approach feels removed from the volatile acrobatics and catharsis of Adele, Amy Winehouse, Ellie Goulding, and her other peers of the past two decades. Her songs still feel like the exhalation after all the action happens; in Dido songs, the tumult has been resolved by the time she records. Her breakup ballads simmer with loss and melancholy, but no regret or indecision; sweeping love anthems have no runway left for the chase, only snug contentment and bright promises to live up to another’s faith. What her music lacks in heat, it makes up for in reliable serenity—the sense that she’s already done her emotional heavy-lifting offstage, and the song she offers is the coda, not the conduit.\nIt’s extremely mature, in other words—not always the sexiest bait in pop music, but a balm all its own. Dido’s fifth album, Still on My Mind, guides her even more into the path of serenity and easy listening electronics, with odes to marriage and motherhood that bask in their comforts. Her most stunning asset is still her voice—a glossy, palatial purr, fraying at the edges, nodding clearly to Enya and Dolores O’Riordan of the Cranberries. When she sings of “Hurricanes,” those frightening and upending sources of power, she is really asking to stand by her partner forever, so they might face them together; a delicate, late-’90s synth beat (from her brother and regular collaborator, Rollo Armstrong) offers up a few light gales, but nothing so forceful as the title could conjure.\nSoon after, Dido sings her harshest and most jarring lyric: “I’ve found a way to let you go/It’s gonna rip your heart out,” she offers tranquilly, with all the malice of a kitten gif, skipping up into falsetto for a dash of whimsy. (Imagine Eminem, whose sampling of her on “Stan” made her ubiquitous, braying that same line. Marvel that they ever had a conversation, let alone shared a hit song. Let your heart swell to embrace all the gorgeous, absurd potential in this world, and then cap it with the knowledge that Dido named her son Stan.)\nElsewhere, the dance floor beckons: “Take You Home” rides a feathery disco pulse and an undercurrent of rakishness, below the elegant surface: “I can sing you a song, take you home/But I can’t seem to find my own,” Dido sings, unbothered, in a neutral middle register that doesn’t jump octaves or arpeggiate in any of the usual disco conventions. It’s notable that in a dance track, a style that would usually suggest more momentum, Dido’s singing twists in the wind; the passive house-lite backing emphasizes the lack of vocal heat. “Friends,” the other dance track and a confident brush-off to an ex, also simmers with a gentle, proto-“TRL” amiability that sounds more dated than No Angel’s winsome mixes. Plenty of career pop singers have found second lives in house and EDM tracks that amped up their voices with fresh relevance, from Kelly Rowland to Lenny Kravitz and Leona Lewis; when Still on My Mind dips into the dance realm, it suggests Dido could do the same, but she’d need more dynamic backing.\nOr maybe the dance tracks don’t land simply because the club is not where Dido wants to be. In Still on My Mind’s closing track, “Have to Stay,” she sounds her most enamored; nearly a capella to open, with just a puff of echo, she sings a delicate, lovely ode to her son, promising that she’ll stick by his side, enduring all his young histrionics and troubles, and leave him only when he’s truly ready, “’cause that’s what love is, darling.” It’s the preternatural certainty Dido shows that really warms the song; on Still on My Mind, more than ever, she presents her convictions fully formed, with a confidence that can feel infectious. Of course her marriage will face storms and come out intact; of course she’ll continue to shun the ghosts of her past, and guide her son towards a bright future. Here she declares it, and so shall it be.\n", "pptitle": ["mind"]}