{"id": "PF_6", "url": "https://pitchfork.com/reviews/albums/rich-the-kid-the-world-is-yours-2/", "name": ["The", "World", "Is", "Yours", "2"], "description": ["atlanta", "transplant", "queen", "unoffici", "fourth", "migo", "rich", "kid", "built", "career", "perpetu", "barnacl", "underbelli", "better", "artist", "music", "best", "enjoy", "item", "kendrick", "lamarl", "singl", "new", "freezer", "seri", "mixtap", "migo", "label", "compil", "cogniz", "album", "world", "2", "boast", "14", "featur", "16", "song", "rich", "kid", "think", "he", "gener", "voic", "album", "go", "stream", "album", "told", "billboard", "presum", "straight", "face", "know", "sure", "hottest", "artist", "fuck", "world", "clear", "isnt", "he", "probabl", "right", "stream", "algorithm", "love", "song", "gener", "autoplay", "just", "popular", "rap", "song", "moment", "ton", "money", "imagin", "lil", "boat", "2", "rapper", "flex", "sound", "bore", "know", "got", "cash", "aint", "gotta", "brag", "rap", "4", "phone", "despit", "fact", "he", "brag", "nearli", "30", "minut", "rare", "glimps", "halfinterest", "thought", "usual", "indebt", "rapper", "pinki", "look", "like", "waterslid", "rack", "taller", "yao", "ming", "plug", "beij", "idea", "repurpos", "artist", "he", "work", "album", "best", "moment", "come", "courtesi", "guest", "jay", "critch", "hook", "like", "mike", "gunna", "flow", "fall", "threw", "vori", "song", "rich", "basic", "guest", "end", "album", "ring", "ring", "clunker", "king", "big", "sean", "peopl", "upstag", "host", "vers", "album", "backi", "know", "leagu", "bitch", "im", "problackjust", "hit", "lick", "grandson", "dont", "sonsbut", "that", "far", "im", "think", "ahead", "bitch", "rap", "cup", "clever", "sens", "ident", "vers", "rest", "album", "desper", "miss", "product", "great", "equal", "world", "2", "redeem", "beatmak", "frank", "duke", "wheezi", "beat", "tminu", "sevn", "thoma", "nard", "b", "da", "doman", "frequent", "produc", "lab", "cook", "patch", "obviou", "crack", "songcraft", "haunt", "whistl", "intro", "pierc", "squeal", "save", "boom", "drum", "splashin", "help", "lacquer", "platitudin", "rap", "thing", "engross", "rich", "product", "imagin", "rich", "kid", "busili", "squander", "goodwil", "engross", "rapper"], "date_published": ["2019-03-29T05:00:00"], "sentiment": 0.26338719420114765, "content": "An Atlanta transplant from Queens and the (unofficial) fourth Migo, Rich the Kid has built a career as the perpetual barnacle on the underbelly of better artists. Even in his own music, he is best enjoyed as a side item: on his Kendrick Lamar-led single “New Freezer,” on a series of mixtapes with Migos, on label compilations. As if cognizant of this, his album, The World is Yours 2, boasts 14 features across 16 songs.\nAnd yet, somehow, Rich the Kid thinks he’s a generational voice. “The album is going to be the most streamed album,” he told Billboard, presumably with a straight face. “I know for sure. I am the hottest artist in the fucking world.” To be clear: He isn’t. But he’s probably right that the streaming algorithms will love him: His songs are so generic they could could auto-play after just about any popular rap song of the moment.\nHe has a ton of money and no imagination; not since Lil Boat 2 has a rapper made flexing sound so boring. “They know I got cash, I ain’t gotta brag no more,” he raps on “4 Phones,” despite the fact that he’s already been bragging for nearly 30 minutes. The rare glimpse of even a half-interesting thought is usually indebted to another rapper. His pinky looks like a waterslide. His racks taller than Yao Ming. His plug’s in Beijing. All ideas repurposed from artists he’s worked with, most of them on this very album.\nThe best moments all come courtesy of his guests: the Jay Critch hook on “Like Mike,” the Gunna flow on “Fall Threw,” the Vory song Rich basically guests on toward the end of the album (“Ring Ring”). The clunker king Big Sean, of all people, upstages his host with the verse of the album: “I go off, go in, go up, but never go back/I know we in a league of our own, bitch, I’m pro-black/Just hit a lick for my grandsons and I don’t have sons/But that’s how far I’m thinking ahead, bitch, and some,” he raps on “Two Cups.” There is a cleverness, a sense of identity, to his verse that the rest of the album is desperately missing.\nProduction can be the great equalizer, and The World is Yours 2 is often redeemed by its beatmakers: Frank Dukes, Wheezy Beats, T-Minus, Sevn Thomas, Nard & B, D.A. Doman, and frequent producer Lab Cook. Together, they patch the obvious cracks in his songcraft. The haunted whistling of the intro, the piercing squeal of “Save That,” and the booming drums of “Splashin” all help lacquer over the platitudinous raps. The only thing more engrossing than all this rich production is imagining, while Rich the Kid busily squanders goodwill, what a more engrossing rapper might have made of it.\n", "pptitle": ["world", "2"]}