{"id": "PF_22", "url": "https://pitchfork.com/reviews/albums/avey-tare-cows-on-hourglass-pond/", "name": ["Cows", "on", "Hourglass", "Pond"], "description": ["dave", "portner", "music", "swing", "extrem", "hand", "there", "kinet", "overload", "anim", "collect", "record", "like", "strawberri", "jam", "merriweath", "post", "pavilion", "centiped", "hzfast", "color", "car", "curvi", "road", "windshield", "bugspatt", "rorschach", "blot", "array", "murkier", "mysteri", "sound", "mood", "like", "rever", "hush", "campfir", "song", "rumin", "narcosi", "portner", "solo", "album", "avey", "tare", "work", "privat", "border", "indecipher", "earli", "album", "meant", "play", "backward", "fundament", "opposit", "translat", "tension", "extrovert", "tendenc", "resolut", "interior", "mode", "avey", "tare", "solo", "album", "2017", "eucalyptu", "key", "natur", "felt", "claustrophob", "world", "away", "sunbak", "hillsid", "inspir", "hike", "mountain", "path", "dusk", "trail", "marker", "begin", "disappear", "dark", "year", "anim", "collect", "tangerin", "reef", "audiovisu", "album", "coral", "ecosystem", "amorph", "cow", "hourglass", "pond", "portner", "come", "air", "stake", "middl", "posit", "album", "begin", "unexpect", "note", "what", "goodsid", "built", "honesttogood", "dubtechno", "beat", "kind", "thing", "expect", "hear", "portner", "bandmat", "noah", "lennox", "aka", "panda", "bear", "talk", "fond", "kompakt", "basic", "channel", "anim", "collect", "song", "came", "close", "actual", "sound", "german", "inspir", "synthheavi", "shuffl", "what", "goodsid", "sure", "doe", "moodi", "subbass", "wallop", "that", "dead", "ringer", "puls", "berlin", "basement", "club", "circa", "1993", "what", "goodsid", "isnt", "dub", "techno", "song", "muddi", "electron", "loop", "overlaid", "multitrack", "guitar", "lilt", "vocal", "melodi", "yield", "strang", "amalgam", "ambient", "folk", "get", "old", "portner", "sing", "voic", "garbl", "effect", "despit", "subdu", "pace", "opposit", "slow", "middl", "age", "arrang", "bushwhack", "way", "shadowi", "thicket", "startl", "clariti", "what", "goodsid", "feel", "like", "statement", "purpos", "way", "announc", "new", "terrain", "explor", "rest", "album", "larg", "follow", "templat", "establish", "open", "song", "strummi", "jangli", "guitar", "wreath", "soft", "synth", "electron", "effect", "far", "avey", "tare", "outgo", "melodi", "direct", "eucalyptu", "underli", "chord", "scrape", "obliqu", "angl", "disson", "guitar", "eye", "eye", "surf", "music", "transpos", "unfamiliar", "tonal", "portner", "risingandfal", "vocal", "melodi", "bewitch", "immediaci", "electricacoust", "mixtur", "kc", "evok", "hazi", "tone", "vintag", "fli", "saucer", "attack", "straightup", "catchiest", "song", "portner", "written", "age", "rel", "tune", "song", "give", "portner", "plenti", "work", "singer", "whisper", "bellow", "broadli", "explor", "wide", "rang", "timbr", "nuanc", "regist", "yelp", "mumbl", "avey", "tare", "occasion", "get", "stuck", "autopilot", "sound", "like", "he", "tri", "new", "thing", "crucial", "have", "fun", "album", "sag", "littl", "end", "slow", "rel", "beatless", "littl", "chapter", "taken", "boy", "dont", "drift", "simpli", "hang", "like", "fog", "stubbornli", "refus", "burn", "rememb", "mayan", "follow", "sprightli", "adhoc", "spiritu", "rememb", "mayanfutur", "right", "nowangel", "came", "pour", "feel", "hokey", "lyric", "laps", "dog", "album", "gestur", "profund", "quit", "get", "convers", "toy", "nonsens", "fulli", "commit", "portner", "better", "zero", "specif", "imageri", "saturday", "hooki", "song", "nostalgia", "ritual", "rattl", "token", "domest", "like", "norman", "rockwel", "fever", "dream", "kc", "scifi", "premonit", "premis", "yeari", "slept", "robotand", "thought", "worst", "wed", "seen", "practic", "beg", "netflix", "seri", "kc", "point", "cow", "hourglass", "pond", "best", "qualiti", "sens", "humor", "portner", "doesnt", "lot", "credit", "wit", "ampl", "suppli", "just", "close", "hor", "equinethem", "song", "titl", "ostens", "inspir", "twoperson", "basketbal", "game", "portner", "strum", "acoust", "reel", "freeassoci", "lyric", "fourleg", "beast", "he", "accompani", "unmistak", "clipclop", "rhythm", "classicrock", "chestnut", "novelti", "song", "reach", "ambigu", "climaxi", "old", "stori", "mayb", "hors", "stori", "mayb", "bothth", "song", "steadili", "break", "apart", "falsetto", "vocal", "harmoni", "rhythmic", "loop", "dissolv", "spray", "white", "nois", "evenespeciallyon", "album", "portner", "pursu", "middl", "path", "oppos", "instinct", "disappear", "act", "feel", "perfectli", "charact"], "date_published": ["2019-03-27T05:00:00"], "sentiment": 0.10612996158770807, "content": "Dave Portner’s music swings between extremes. On the one hand, there’s the kinetic overload of Animal Collective records like Strawberry Jam, Merriweather Post Pavilion, and Centipede Hz—fast, colorful cars on a curvy road, their windshields bug-spattered Rorschach blots. On the other, an array of murkier, more mysterious sounds and moods, like the reverent hush of Campfire Songs or the ruminant narcosis of Down There, Portner’s first solo album as Avey Tare. His work can sometimes be so private that it borders on the indecipherable: One early album was meant to be played backward.\nThis fundamental opposition translates to a tension between his extroverted tendencies and more resolutely interior modes. Avey Tare’s last solo album, 2017’s Eucalyptus, was keyed to nature yet felt claustrophobic, a world away from the sun-baked hillsides that inspired it: If it was a hike, it was a mountain path at dusk, when the trail markers begin disappearing into darkness. Last year, Animal Collective’s Tangerine Reef, an audiovisual album about coral ecosystems, was even more amorphous. But with Cows on Hourglass Pond, Portner comes back up for air and stakes out a middle position.\nThe album begins on an unexpected note: “What’s the Goodside?” is built around an honest-to-goodness dub-techno beat, the kind of thing you might have expected to hear back when Portner and his bandmate Noah Lennox, aka Panda Bear, were talking up their fondness for Kompakt and Basic Channel. Nothing in Animal Collective’s songs ever came all that close to the actual sound of their German inspirations, but the synth-heavy shuffle of “What’s the Goodside?” sure does, with a moody sub-bass wallop that’s a dead ringer for the pulse of Berlin basement clubs circa 1993. But “What’s the Goodside?” isn’t only dub techno; the song’s muddy electronic loops are overlaid with multitracked guitars and lilting vocal melodies, yielding a strange amalgam of ambient and folk. “We’re getting old now,” Portner sings, his voice garbled with effects, but, despite the subdued pace, this is the opposite of slowing down in middle age. With an arrangement that bushwhacks its way from shadowy thickets to startling clarity, “What’s the Goodside?” feels like a statement of purpose, a way of announcing that he still has new terrain to explore.\nThe rest of the album largely follows the template established on the opening song, with strummy, jangly guitars wreathed in soft synths and electronic effects. This is far from Avey Tare at his most outgoing, but the melodies are more direct than they were on Eucalyptus, even when the underlying chords scrape at oblique angles. The dissonant guitars of “Eyes on Eyes” might be surf music transposed for an unfamiliar tonal system, yet Portner’s rising-and-falling vocal melody has a bewitching immediacy. The electric/acoustic mixture of “K.C. Yours” evokes the hazy tones of vintage Flying Saucer Attack, but it’s one of the straight-up catchiest songs that Portner has written in ages. The relative tunefulness of these songs gives Portner plenty to work with as a singer, too: He whispers more often than he bellows, and he broadly explores a wide range of timbres along with the nuances of his registers. Whether yelping or mumbling, Avey Tare occasionally gets stuck on autopilot, but here he sounds like he’s trying out new things and, crucially, having fun.\nThe album sags a little toward the end. Slow and relatively beatless, “Our Little Chapter” and “Taken Boy” don’t so much drift as simply hang there, like fog that stubbornly refuses to burn off; “Remember Mayan,” which follows, is more sprightly, but its ad-hoc spiritualism (“Remember Mayan?/Future is being right now/Angels came pouring down”) feels hokey. These lyrical lapses dog the album when it gestures at profundity without quite getting there (or, conversely, toys with the nonsensical without fully committing). Portner is better when he zeroes in on more specific imagery. “Saturdays (Again),” a hooky song about nostalgia and ritual, rattles off tokens of domesticity like a Norman Rockwell fever dream, while “K.C. Yours” is a sci-fi premonition whose premise (“That was the year/I slept with the robot/And so I thought that was the worst we’d seen yet”) it’s practically begging for its own Netflix series.\n“K.C. Yours” points up one of Cows on Hourglass Pond’s best qualities: its sense of humor. Portner doesn’t always get a lot of credit for his wit, but it’s in ample supply here. Just take the closing “HORS_,” an equine-themed song whose title is ostensibly inspired by the two-person basketball game. As Portner strums his acoustic and reels off free-associative lyrics about four-legged beasts, he’s accompanied by an unmistakable clip-clop rhythm. It’s part classic-rock chestnut, part novelty song, and once it reaches its ambiguous climax—“I am old story,” or maybe “I am horse story,” or maybe even both—the song steadily breaks apart, falsetto vocal harmonies and rhythmic loops dissolving into a spray of white noise. Even—especially?—on an album where Portner pursues a middle path between his opposing instincts, the disappearing act feels perfectly in character.\n", "pptitle": ["cow", "hourglass", "pond"]}