{"id": "PF_18", "url": "https://pitchfork.com/reviews/albums/flume-hi-this-is-flume/", "name": ["Hi", "This", "Is", "Flume"], "description": ["visual", "accompani", "careerhigh", "mixtap", "hi", "flume", "australian", "electron", "produc", "drive", "car", "decor", "kaleidoscop", "metal", "panel", "like", "pastelobsess", "pop", "artist", "bridget", "riley", "creat", "mtv", "pimp", "ride", "vehicl", "need", "refuel", "crack", "open", "la", "croix", "dump", "ga", "tank", "appear", "mildli", "flavor", "urbanitefavor", "seltzer", "clearli", "meant", "partli", "tongu", "cheek", "there", "fit", "cours", "flume", "drink", "la", "croix", "despit", "work", "invent", "artist", "like", "vinc", "stapl", "lord", "grammi", "harley", "streten", "music", "flume", "felt", "like", "bait", "audienc", "move", "softfocu", "edm", "influenti", "youtub", "channel", "majest", "casual", "prefer", "listen", "lite", "megapopular", "pillowi", "banger", "engin", "broad", "appeal", "possess", "soft", "emoy", "cutesi", "simplic", "streamingfirst", "produc", "speak", "anonym", "liz", "pelli", "baffler", "recogn", "playlist", "catnip", "hi", "flume", "set", "selfconsci", "dismantl", "view", "streten", "make", "music", "optim", "algorithm", "mixtap", "titl", "point", "sens", "reintroduct", "like", "pop", "superstar", "indic", "selftitl", "album", "year", "establish", "career", "push", "reset", "button", "song", "bright", "chimestrewn", "ecdysi", "name", "process", "snake", "shed", "epidermi", "streten", "previou", "fulllength", "titl", "skin", "geddit", "underscor", "messag", "hi", "flume", "open", "titl", "track", "spokenword", "novelti", "parodi", "stream", "platform", "commerci", "tap", "artwork", "listen", "save", "music", "collect", "streten", "say", "satir", "fauxbuoy", "scream", "hi", "flume", "philosoph", "sonic", "inflect", "point", "seventeen", "cohes", "track", "nudg", "needl", "streten", "sound", "frequent", "jump", "cut", "dismantl", "clubbi", "beat", "pogoinduc", "drop", "bass", "gener", "keep", "gift", "emot", "melodi", "foreground", "bulk", "mixtap", "track", "circl", "twominut", "mark", "give", "sens", "sketch", "roadmap", "new", "outlook", "streten", "promis", "music", "come", "dreamtim", "vortex", "white", "nois", "featheri", "vocal", "effect", "soundtrack", "coachella", "documentari", "film", "david", "lynch", "synth", "jewel", "uncanni", "vocaloid", "qualiti", "littl", "like", "melod", "manipul", "battl", "atla", "time", "certain", "scrappi", "welcom", "airtight", "momentum", "neg", "space", "wormhol", "duti", "lockandload", "effect", "quit", "feel", "sinist", "sirenlik", "textur", "daze", "2200", "arent", "trippi", "titl", "promis", "hi", "flume", "fragmentlik", "moment", "dynam", "emot", "tension", "streten", "allow", "complex", "arrang", "track", "length", "room", "maneuv", "review", "flume", "skin", "stacey", "anderson", "note", "mathemat", "qualiti", "way", "streten", "treat", "vocal", "guest", "singer", "women", "happili", "hi", "flume", "snuff", "habit", "adopt", "spare", "evenhand", "approach", "collabor", "just", "song", "featur", "guest", "vocalist", "remix", "sophi", "coproduct", "voic", "gregorianchantl", "melodrama", "reminisc", "fatima", "al", "qadiri", "experi", "religi", "music", "yearn", "kuka", "hook", "that", "shred", "slap", "latex", "sophi", "idiosyncrat", "style", "holist", "effect", "hi", "flume", "tooand", "just", "flume", "san", "francisco", "produc", "eprom", "superflu", "ampedup", "cold", "water", "remix", "steppedon", "balloon", "squeak", "sodacan", "hiss", "amber", "mind", "sophi", "earliest", "music", "offer", "evid", "streten", "ear", "turn", "pop", "rel", "fring", "speak", "zane", "low", "year", "streten", "detail", "techniqu", "work", "rapper", "involv", "overhaul", "beat", "lay", "vers", "piec", "music", "fit", "vocal", "like", "glove", "good", "given", "previou", "disjoint", "track", "vic", "mensa", "pusha", "t", "refreshingli", "hi", "flume", "collabor", "vein", "highlight", "flow", "natur", "high", "beam", "coproduct", "perthborn", "hwl", "pair", "slowthai", "livestreamedfromhel", "punchlin", "thud", "bass", "jostl", "cluster", "synth", "hydraul", "bounc", "build", "relationship", "ricochet", "menac", "low", "end", "raygun", "zap", "jpegmafia", "riotou", "quotabl", "artist", "anecdot", "forc", "regurgit", "interview", "streten", "stori", "start", "make", "music", "download", "gimmicki", "loopbas", "music", "program", "giveaway", "nutrigrain", "cereal", "box", "concept", "music", "laid", "layer", "came", "piec", "music", "realli", "intrigu", "said", "vivid", "takeaway", "hi", "flume", "break", "apart", "nowfamiliar", "sound", "zoom", "differ", "layer", "look", "new", "way", "taken", "music", "long", "way", "safeti", "cereal", "box", "fascin", "far", "will", "push"], "date_published": ["2019-03-26T05:00:00"], "sentiment": 0.12409627159627158, "content": "In a “visualizer” accompanying his career-high mixtape Hi This Is Flume, the Australian electronic producer drives a car decorated in kaleidoscopic metal panels, like something that the pastel-obsessed pop artist Bridget Riley might create for MTV’s “Pimp My Ride.” When the vehicle needs refueling, he cracks open a can of La Croix and dumps it into the gas tank. The appearance of the mildly flavored, urbanite-favored seltzer here is clearly meant to be at least partly tongue in cheek. But there’s something fitting about it, too: Of course Flume would drink La Croix.\nDespite his work with inventive artists like Vince Staples and Lorde (and a Grammy to his name), Harley Streten’s music as Flume has often felt like bait for audiences who have moved on from the soft-focus EDM of the influential YouTube channel Majestic Casual but still prefer to keep their listening lite. His mega-popular pillowy bangers are engineered for broad appeal, often possessing the “soft, emo-y, cutesy” simplicity that one streaming-first producer, speaking anonymously to Liz Pelly in The Baffler, recognized as playlisting catnip.\nHi This Is Flume is set up to self-consciously dismantle the view of Streten as making music optimized for the algorithm. The mixtape’s title has a pointed sense of re-introduction, like the pop superstar who indicates, with a self-titled album years into an established career, that she is pushing the reset button. One song, the bright, chime-strewn “Ecdysis,” is even named after the process of a snake shedding its epidermis. (Streten’s previous full-length was titled Skin, geddit?) Underscoring this message is Hi This Is Flume’s opening title track, a spoken-word novelty which parodies streaming platform commercials. “Tap the artwork to listen and save to your own music collection,” Streten says with satirical faux-buoyancy. Then he screams.\nHi This Is Flume is, both philosophically and sonically, an inflection point. Seventeen cohesive tracks nudge the needle on Streten’s sound, with frequent jump cuts from dismantled clubby beats to pogo-inducing drops and thick bass, while generally keeping his gifts for emotive melodies in the foreground. The bulk of the mixtape’s tracks circle the two-minute mark, giving the sense of a sketched roadmap to a new outlook (Streten has already promised “more music to come”). “Dreamtime,” a vortex of white noise with feathery vocal effects, could soundtrack a Coachella documentary filmed by David Lynch, while the synths of “Jewel” take on an uncanny vocaloid quality, a little like the melodic manipulations of Battles’ “Atlas.” At other times, a certain scrappiness would be welcome: less airtight momentum, more negative space. “Wormhole,” for all its Call of Duty lock-and-load effects, never quite feels sinister, and the siren-like textures of “Daze 22.00” aren’t as trippy as the title promises. Hi This Is Flume’s fragment-like moments might take on more dynamic and emotive tension if Streten allowed himself more complex arrangements, or track lengths with more room to maneuver.\nIn her review of Flume’s Skin, Stacey Anderson noted a “mathematical quality” in the way Streten treated the vocals of his guest singers, most of them women. Happily, Hi This Is Flume snuffs out that habit, adopting a more sparing and even-handed approach to collaboration. Just four songs feature guest vocalists, and one of those is a remix. The SOPHIE co-production “Voices” is a Gregorian-chant-led melodrama, reminiscent in part of Fatima Al Qadiri’s experiments with religious music, with a yearning Kučka hook that’s shredded and slapped with latex. SOPHIE’s idiosyncratic style seems to have had a more holistic effect on Hi This Is Flume, too—and not just in Flume and San Francisco producer Eprom’s superfluously amped-up “Is It Cold in the Water?” remix. The stepped-on balloon squeaks and soda-can hiss of “Amber” also call to mind SOPHIE’s earliest music, offering further evidence of Streten’s ear turning toward pop’s relative fringes.\nSpeaking to Zane Lowe last year, Streten detailed his technique when working with rappers, one that involved overhauling the beat after they lay down their verses “so the whole piece of music fits the vocal like a glove.” He hasn’t always made good on that, given previous disjointed tracks with Vic Mensa and Pusha T. Refreshingly, Hi This Is Flume’s two collaborations in this vein, both highlights, flow much more naturally. “High Beams,” a co-production with Perth-born HWLS, pairs Slowthai’s livestreamed-from-hell punchlines with thudding bass and jostling clusters of synths. And the hydraulic bounce of “How to Build a Relationship” ricochets from menacing low end to ray-gun zaps around JPEGMAFIA’s riotous quotables.\nMany artists have an anecdote that they are forced to regurgitate in every interview. For Streten, it’s the story of how he started making music after downloading a “gimmicky,” loop-based music program from a giveaway in a Nutri-Grain cereal box. “The whole concept of how music was laid out in layers [...] but came out as one piece of music was really intriguing for me,” he has said. The most vivid takeaway from Hi This Is Flume is how he breaks apart his now-familiar sound, zooming in on the different layers and looking at them in new ways. He has taken his music a long way from the safety of the cereal box. It will be fascinating to see how far he is willing to push it.\n", "pptitle": ["hi", "flume"]}