{"id": "PF_98", "url": "https://pitchfork.com/reviews/albums/various-artists-eminent-domain/", "name": ["Eminent", "Domain"], "description": ["new", "york", "label", "lie", "long", "island", "electr", "system", "better", "suit", "util", "companyuntil", "hear", "music", "come", "widerang", "catalog", "sputter", "electron", "nois", "onthefritz", "club", "music", "lie", "bring", "mind", "throb", "gristl", "industri", "music", "industri", "peopl", "slogan", "right", "welloil", "releas", "schedul", "notabl", "earli", "showcas", "2013", "compil", "music", "shutinsa", "fit", "titl", "dark", "murki", "hermet", "electron", "music", "new", "emin", "domain", "selfdescrib", "collect", "subterranean", "american", "electron", "lie", "drag", "underground", "finest", "basement", "dweller", "sunlight", "label", "best", "compil", "spread", "lp", "bonu", "7", "sprawl", "emin", "domain", "work", "dive", "label", "head", "ron", "morelli", "extra", "care", "sequenc", "22", "track", "there", "craze", "logic", "way", "prickli", "edg", "connect", "clash", "compil", "take", "time", "open", "atmospher", "earli", "track", "like", "prison", "tell", "lie", "vision", "scene", "choke", "keyboard", "tortur", "jt", "whitfield", "sawblad", "synth", "jam", "bleak", "speak", "fulli", "strap", "funhous", "horror", "follow", "recogniz", "name", "quit", "know", "surpris", "pop", "minneapoli", "nois", "artist", "cbn", "great", "exampl", "extrem", "limitedrun", "cassett", "hard", "obtain", "work", "stun", "ebm", "workout", "time", "tear", "send", "search", "track", "propuls", "drum", "machin", "ghostli", "moan", "build", "relentless", "minut", "turn", "bloodi", "scream", "nois", "nearli", "sparkl", "harsh", "memor", "introduct", "emin", "domain", "act", "crucial", "cog", "kick", "seamless", "bside", "give", "way", "filth", "prickli", "agit", "crucial", "point", "daniel", "holt", "near", "window", "provid", "comedown", "doomlac", "synth", "track", "work", "carv", "lp", "uniqu", "corner", "place", "compil", "happen", "lo", "angel", "nois", "veteran", "suzi", "pole", "aka", "pod", "blotz", "offer", "emin", "domain", "highlight", "bodi", "transform", "voic", "wound", "electr", "signal", "thread", "blunt", "drumbeat", "ether", "synth", "balanc", "lie", "alum", "51717", "approach", "ambient", "music", "provid", "midway", "breather", "cleverli", "set", "listen", "fakeout", "like", "skander", "run", "danger", "bliss", "soundscap", "interrupt", "midway", "hellish", "percuss", "genuin", "moment", "peac", "save", "track", "swan", "king", "hospit", "product", "regular", "lussuria", "give", "emin", "domain", "fullcircl", "finish", "make", "brilliant", "collect", "clash", "part", "organ"], "date_published": ["2019-03-02T06:00:00"], "sentiment": 0.14314651069970222, "content": "The full name of New York label L.I.E.S. is Long Island Electrical Systems. That might seem better suited to a utility company—until you hear the music coming out of it. Over a wide-ranging catalog of sputtering electronics, noise, and on-the-fritz club music, L.I.E.S. brings to mind Throbbing Gristle’s “industrial music for industrial people” slogan, right down to its well-oiled release schedule. A notable early showcase was the 2013 compilation Music for Shut-Ins—a fitting title for its dark, murky, hermetic take on electronic music. With the new Eminent Domain, a self-described collection of “subterranean American electronics,” L.I.E.S. drags some of the underground’s finest basement dwellers into the sunlight, and it’s one of the label’s best compilations yet.\nSpread over three LPs and a bonus 7”, the sprawling Eminent Domain works well anywhere you might dive in, but label head Ron Morelli seems to take extra care in sequencing its 22 tracks. There’s a crazed logic in the way their prickly edges connect and clash. The compilation takes its time to open up with atmospheric early tracks like of Prisons’ “Tell Lie Visions,” a scene of choked keyboard torture, before JT Whitfield’s saw-blade synth jam “Bleak Speak” fully straps you in for the funhouse horrors to follow. With few recognizable names, you never quite know what surprises will pop out.\nMinneapolis’ noise artist CBN is a great example. With only a few extremely limited-run cassettes, it’s hard to even obtain his work, but the stunning EBM workout “Who Has Time for Tears” may send you in search of more. The track’s propulsive drum machine and ghostly moans build over six relentless minutes before turning to bloody screams and noise that nearly sparkles in its harshness. For many, it will be a memorable introduction, but for Eminent Domain, it acts as another crucial cog, kicking off a seamless B-side as it gives way to FILTH’s prickly, agitated “Crucial Point” before Daniel Holt’s “Near the Window” provides a comedown of doom-laced synths. The three tracks work together to carve their side of the LP into its own unique corner; it’s not the only place on the compilation that this happens.\nLos Angeles noise veteran Suzy Poling, aka Pod Blotz, offers another of Eminent Domain’s highlights with “Beyond the Body,” transforming her voice into a wounded electrical signal and threading it through blunt drumbeats and ethereal synths. It’s balanced by L.I.E.S. alum 51717’s “אדגמה”, which approaches ambient music and provides a midway breather, but also cleverly sets the listener up for fake-outs like Skander’s “Running Into Danger,” a blissful soundscape interrupted midway through by hellish percussion. The only genuine moment of peace is saved until the very last track: “The Swan King,” from Hospital Productions regular Lussuria. It all gives Eminent Domain a full-circle finish, making it both a brilliant collection of clashing parts and an organic whole all at once.\n", "pptitle": ["emin", "domain"]}