{"id": "PF_78", "url": "https://pitchfork.com/reviews/albums/yves-jarvis-the-same-but-by-different-means/", "name": ["The", "Same", "but", "by", "Different", "Means"], "description": ["past", "year", "montrealbas", "jeansebastian", "audet", "amass", "consider", "bodi", "work", "convent", "law", "logic", "songwrit", "dont", "appli", "end", "goal", "music", "experi", "metaphys", "obsess", "homerecord", "savant", "earli", "teen", "audet", "22", "said", "goal", "record", "song", "day", "said", "he", "writer", "sculptor", "forev", "pick", "away", "monolith", "mass", "music", "idea", "mind", "he", "enamor", "process", "result", "let", "marvel", "littl", "piec", "he", "chip", "way", "differ", "mean", "album", "audet", "releas", "yve", "jarvi", "mean", "debut", "reset", "natur", "step", "journey", "initi", "blond", "short", "year", "blond", "gradual", "mutat", "clang", "cavern", "postpunk", "2014", "tenet", "sublim", "psychfolk", "psalm", "2016", "good", "come", "record", "earn", "placement", "canada", "polari", "music", "prize", "long", "list", "subsequ", "american", "deal", "anti", "use", "profil", "boost", "opportun", "streamlin", "sound", "audet", "doubl", "wander", "diy", "aesthet", "album", "expans", "tune", "shorter", "differ", "mean", "stitch", "microsong", "abbrevi", "epic", "sprawl", "opu", "that", "comfort", "uncompromis", "audet", "said", "color", "scheme", "album", "cover", "reflect", "sound", "record", "differ", "mean", "audet", "interpret", "blue", "famou", "connot", "sad", "isnt", "feel", "overcom", "settl", "open", "say", "easi", "gauzi", "piano", "ballad", "just", "verg", "decay", "set", "bliss", "adrift", "sooth", "organ", "line", "shuffl", "beat", "case", "blue", "assum", "ocean", "qualityof", "flotat", "immers", "recogn", "humbl", "stand", "amidst", "vast", "world", "audet", "paid", "due", "busker", "matter", "form", "music", "taken", "he", "continu", "embrac", "simplic", "intimaci", "favor", "fieldrecord", "ambienc", "see", "wind", "sound", "chirp", "bird", "drone", "insect", "pass", "car", "serv", "facto", "back", "band", "aptli", "titl", "differ", "mean", "draw", "wider", "instrument", "palett", "audet", "previou", "work", "posit", "insular", "tradit", "smileera", "brian", "wilson", "sli", "stone", "circather", "riot", "goin", "earli", "70", "stevi", "wonder", "todd", "rundgren", "new", "album", "retain", "otherworldli", "aura", "environment", "influenc", "predecessor", "foreground", "tactil", "instrument", "sound", "right", "differ", "mean", "surprisingli", "seamless", "22track", "record", "like", "ouija", "board", "session", "track", "feel", "collect", "effort", "access", "realm", "outsid", "lead", "sustain", "moment", "connect", "like", "radiant", "tropicalia", "sunshow", "curtain", "rain", "yield", "sudden", "surpris", "moment", "raptur", "like", "beauti", "melanchol", "choru", "hard", "say", "bye", "briefest", "snippet", "feel", "like", "statement", "constant", "chang", "30second", "capella", "hymn", "decipher", "lyric", "repeat", "titl", "audet", "manipul", "tape", "sound", "like", "scratch", "record", "transform", "metacommentari", "chao", "modern", "life", "desir", "slow", "stop", "world", "spin", "axi", "tellingli", "phrase", "constant", "chang", "keep", "pop", "differ", "mean", "seen", "audet", "attempt", "come", "term", "album", "chart", "quest", "inner", "peac", "real", "time", "audet", "confess", "creativ", "stagnat", "amid", "slowmot", "psych", "soul", "new", "ponder", "place", "world", "churchorgan", "confession", "talk", "listen", "closer", "truth", "find", "sanctuari", "stretch", "acoust", "idyl", "enchant", "minut", "song", "buri", "audet", "mutter", "spokenword", "vocal", "just", "surfac", "encroach", "symphoni", "sampl", "tv", "sound", "threaten", "drown", "like", "dream", "quit", "make", "detail", "peac", "unnerv", "find", "seren", "mean", "surrend", "understand", "world", "audet", "mayb", "calmli", "coexist"], "date_published": ["2019-03-09T06:00:00"], "sentiment": 0.11491042212873198, "content": "Over the past five years, the Montreal-based Jean-Sebastian Audet has amassed a considerable body of work, one where the conventional laws and logic of songwriting don’t apply and where the end goal is less a musical experience than a metaphysical one. An obsessive home-recording savant since his early teens, Audet (now 22) has said his goal is to record a song per day. That said, he’s less a writer than a sculptor, forever picking away at the monolithic mass of musical ideas in his mind. He’s as enamored with process as with results, letting us marvel at the little pieces he’s chipped off along the way.\nThe Same but by Different Means is the first album Audet has released under the name Yves Jarvis, but it is by no means a debut or reset. Rather, it’s the natural next step in the journey he initiated as Un Blonde. In three short years, Un Blonde gradually mutated from the clanging, cavernous post-punk of 2014’s Tenet to the sublime psych-folk psalms of 2016’s Good Will Come to You, with the latter record earning him a placement on Canada’s Polaris Music Prize long list and, subsequently, an American deal with Anti-.\nBut rather than use that profile boost as an opportunity to streamline his sound, Audet is doubling down on his wandering DIY aesthetic. His albums have become more expansive as the tunes become much shorter, and with The Same but by Different Means, he stitches his micro-songs and abbreviated epics into a sprawling opus that’s as comforting as it is uncompromising.\nAudet has said the color schemes of his album covers reflect the sound of the records, and The Same but by Different Means is Audet’s interpretation of blue and all its famous connotations. But sadness isn’t the feeling that overcomes you as you settle into the opening “To Say That Is Easy,” a gauzy piano ballad that, just as it seems on the verge of decay, is set blissfully adrift on a soothing organ line and shuffling beat. In this case, “blue” assumes a more oceanic quality—of flotation and immersion, of recognizing your humble standing amidst the vastness of the world.\nAudet paid his dues as a busker, and no matter what form his music has taken, he’s continued to embrace simplicity and intimacy, while favoring a field-recording ambience that often sees wind sounds, chirping birds, droning insects, and passing cars serving as his de facto backing band. The aptly titled The Same but by Different Means draws from a wider instrumental palette than Audet’s previous work, positioning him in the insular tradition of SMiLE-era Brian Wilson, Sly Stone circa-There’s a Riot Goin’ On, and early ‘70s Stevie Wonder and Todd Rundgren. But the new album retains the otherworldly aura and environmental influences of its predecessors, foregrounding the tactility of his instruments as if the sounds were being made right next to you.\nThe Same but by Different Means is surprisingly seamless for a 22-track record. Like a Ouija board session, each track here feels part of a collective effort to access a realm outside our own. Sometimes, it leads to sustained moments of connection, like the radiant tropicalia sunshower of “Curtain of Rain.” At others, it yields sudden, surprising moments of rapture, like the beautiful melancholic chorus of “Hard to Say Bye.” Even the briefest snippets can feel like statements: “Constant Change” is a 30-second a capella hymn whose only decipherable lyric is its repeated title.  However, as Audet manipulates the tape to sound like a scratching record, it’s transformed into a meta-commentary on the chaos of modern life and the desire to slow down and stop the world from spinning off its axis.\nTellingly, the phrase “constant change” keeps popping up, and The Same but by Different Means can be seen as Audet’s attempt to come to terms with it. The album charts his quest for inner peace in real time, whether Audet is confessing to his own creative stagnation amid the slow-motion psych soul of “Nothing New” or pondering his place in the world on the church-organ confessional “Talking or Listening?” But with the closer, “The Truth,” he finds sanctuary. Stretching out its acoustic idyll for eight enchanting minutes, the song buries Audet’s muttered spoken-word vocals just below the surface, as an encroaching symphony of sampled TV sounds threatens to drown him out. It’s like a dream where you can’t quite make out the details, but it is peaceful, not unnerving. Perhaps finding serenity means surrendering your will to understand the world around you. For Audet, and maybe for us, it’s enough to calmly coexist within it.\n", "pptitle": ["differ", "mean"]}