{"id": "PF_102", "url": "https://pitchfork.com/reviews/albums/the-japanese-house-good-at-falling/", "name": ["Good", "at", "Falling"], "description": ["amber", "bain", "began", "releas", "music", "japanes", "hous", "2015", "british", "singersongwrit", "kept", "ident", "mysteri", "avoid", "photo", "interview", "maintain", "low", "socialmedia", "profil", "let", "distort", "androgyn", "vocal", "fuel", "rumor", "tactic", "gener", "plenti", "hypemani", "wonder", "song", "secret", "project", "1975", "matt", "healybut", "bain", "wasnt", "fulli", "commit", "month", "ditch", "gimmick", "pull", "curtain", "softspoken", "queer", "19yearold", "girl", "kurt", "cobain", "hair", "boyish", "style", "play", "guitar", "lefthand", "upsid", "use", "rich", "romant", "product", "timid", "voic", "indi", "ideal", "bain", "offer", "varieti", "reason", "stuntsh", "want", "avoid", "gender", "classif", "hate", "have", "pictur", "takenbut", "end", "withhold", "ident", "thing", "want", "talk", "just", "thing", "told", "nme", "year", "bain", "23", "kept", "steadi", "foot", "ga", "releas", "spellbind", "ep", "establish", "expand", "sound", "mix", "sumptuou", "synth", "vocal", "mute", "drum", "sound", "like", "theyv", "wrap", "felt", "releas", "felt", "bigger", "brighter", "mark", "gradual", "progress", "glitchi", "offkilt", "electrofolk", "clean", "mourn", "synthpop", "root", "mainstream", "structur", "saw", "dream", "confid", "intox", "fulllength", "good", "fall", "let", "linger", "selfconsci", "make", "transform", "hesit", "outsid", "unlik", "pop", "star", "technic", "reason", "spaciou", "unfussi", "record", "excel", "bain", "unrel", "heartach", "lift", "bedroom", "pop", "bigger", "song", "profoundli", "person", "detail", "tragic", "tumultu", "experi", "shape", "recent", "past", "death", "love", "griev", "follow", "relationship", "save", "musician", "marika", "hackman", "eventu", "dissolut", "ultim", "realiz", "shell", "okay", "lilo", "grace", "ode", "hackman", "perfectli", "float", "melodi", "find", "bain", "suffer", "look", "remind", "im", "good", "fall", "love", "told", "id", "surviv", "fall", "hope", "power", "album", "play", "synth", "vivaci", "rhythm", "heavi", "sens", "existenti", "gloom", "loom", "tone", "that", "tender", "frustratingli", "detach", "bain", "throw", "question", "cosmo", "tell", "somethingi", "point", "theyr", "answer", "stop", "believ", "thing", "real", "sing", "later", "thing", "dont", "matteral", "thing", "dont", "matter", "there", "resign", "feel", "home", "2019", "ultim", "nihilist", "canva", "trumpera", "fatigu", "confess", "lukewarm", "relationship", "sound", "numb", "deflat", "dont", "fuck", "anymorebut", "talk", "time", "fine", "sing", "somebodi", "tell", "want", "caus", "chang", "mind", "sunken", "gen", "z", "listless", "exasperatingy", "want", "shake", "awakebut", "shouldnt", "confus", "surrend", "said", "breakup", "record", "confront", "bain", "approach", "introspect", "brood", "doesnt", "march", "right", "pain", "circl", "admir", "scrape", "bruis", "work", "sculptur", "like", "avantpop", "peer", "robyn", "christin", "queen", "bain", "use", "dancefloor", "rhythm", "loosen", "emot", "muscl", "arent", "cryintheclub", "anthem", "theyr", "lullabi", "voic", "soft", "low", "feel", "like", "she", "whisper", "ear", "nudg", "stay", "home", "breath", "lost", "dreami", "glimmer", "mellotron", "album", "record", "partli", "bon", "iver", "fall", "creek", "studio", "produc", "bj", "burton", "bon", "iver", "franci", "light", "georg", "daniel", "1975", "f", "r", "w", "y", "featur", "heali", "back", "vocal", "imposs", "hear", "band", "influenceth", "soar", "melodi", "schlocki", "1980", "nostalgia", "sudden", "burst", "stadiums", "drum", "growl", "electr", "guitar", "bain", "attribut", "largess", "play", "bigger", "show", "heali", "sign", "home", "label", "dirti", "hit", "invit", "arena", "tour", "open", "act", "huge", "lush", "arrang", "grow", "toolkit", "instrument", "song", "sound", "clutter", "overwrought", "follow", "girl", "ether", "pummel", "song", "forget", "feel", "like", "feel", "good", "blur", "synth", "vocal", "like", "light", "trail", "nighttim", "photograph", "bain", "powerhous", "singer", "beef", "vocal", "autotun", "harmon", "layer", "saw", "dream", "strippedback", "version", "previous", "releas", "singl", "peel", "flotat", "devic", "jump", "strummi", "surfi", "tribut", "late", "love", "track", "record", "teari", "take", "voic", "quiver", "crack", "wrestl", "conflict", "feel", "agoni", "accept", "isnt", "sing", "perfect", "epilogu", "project", "life", "grief"], "date_published": ["2019-03-04T06:00:00"], "sentiment": 0.062192460317460306, "content": "When Amber Bain began releasing music as the Japanese House in 2015, the British singer-songwriter kept her identity a mystery. She avoided photos and interviews, maintained a low social-media profile, and let her distorted, androgynous vocals fuel the rumor mill. The tactic generated plenty of hype—many wondered if the songs were a secret side project of The 1975’s Matt Healy—but Bain wasn’t fully committed. After a few months, she ditched the gimmick and pulled back the curtain. Behind it was a soft-spoken, queer 19-year-old girl with Kurt Cobain hair and boyish style who played guitar left-handed and upside down, and who used rich, romantic production to fill out her timid voice. She was an indie ideal.\nBain offered a variety of reasons for the stunt—she wanted to avoid gender classifications, she hated having her picture taken—but in the end, withholding her identity made it the only thing anyone wanted to talk about. “It just became this thing,” she told NME. In the years since, Bain, now 23, has kept a steady foot on the gas, releasing three more spellbinding EPs that established and expanded her sound: a mix of sumptuous synths and vocals with muted drums that sound like they’ve been wrapped in felt. Each release felt bigger and brighter than the last, and marked a gradual progression from glitchy, off-kilter electro-folk (Clean) to mournful synth-pop rooted in mainstream structures (Saw You in a Dream). On her confident and intoxicating first full-length, Good at Falling, she lets go of any lingering self-consciousness and makes the transformation from hesitant outsider to unlikely pop star.\nThere are many technical reasons this spacious, unfussy record excels, but it’s Bain’s unrelenting heartache that lifts it from bedroom pop into something bigger. The songs are profoundly personal, detailing the tragic and tumultuous experiences that shaped her recent past: the death of her first love, the grieving that followed, the relationship that saved her (with musician Marika Hackman) and its eventual dissolution, and the ultimate realization that she’ll be okay. “Lilo,” a graceful ode to Hackman that has a perfectly floating melody, finds Bain on the other side of suffering, looking back. “It’s a reminder to me that I’m good at falling in love,” she told i-D, “and I can survive falling out of it.”\nHope powers the album with playful synths and vivacious rhythms, but a heavy sense of existential gloom is always looming. In a tone that’s tender but frustratingly detached, Bain throws questions into the cosmos (“Now tell me something/Is there a point to this?”) and seems to give up before they’re answered (“Sometimes I stop believing in things that are real,” she sings, and later, “All these things don’t matter/All these things don’t matter”). There’s something about her resignation that feels at home in 2019: It’s the ultimate nihilist canvas for Trump-era fatigue. Even her confession about a lukewarm relationship sounds numb and deflated: “We don’t fuck anymore/But we talk all the time so it’s fine,” she sings. “Can somebody tell me what I want? Cause I keep changing my mind.”\nSuch sunken, Gen Z listlessness can get exasperating—you almost want to shake her awake—but it shouldn’t be confused with surrender. Nobody ever said breakup records have to be confrontational. Bain’s approach is more introspective and brooding; she doesn’t march right up to pain so much as circle it, admiring its scrapes and bruises as though they were works of sculpture.\nMuch like avant-pop peers Robyn and Christine and the Queens, Bain uses dancefloor rhythms to loosen up her emotional muscles. But these aren’t cry-in-the-club anthems, they’re lullabies. With a voice so soft and low that it feels like she’s whispering in your ear, she nudges you to stay home, take a breath, and get lost in the dreamy glimmer of a Mellotron.\nThe album, recorded partly at Bon Iver’s Fall Creek Studio, was produced by BJ Burton (Bon Iver, Francis and the Lights) and George Daniel (the 1975), and “f a r a w a y” features Healy on backing vocals. It’s impossible not to hear his band’s influence—the soaring melodies, schlocky 1980s nostalgia, and sudden bursts into stadium-sized drums or growling electric guitar. Bain attributes this largesse to playing bigger shows; after Healy signed her to his home label, Dirty Hit, he invited her on their arena tours as the opening act. Still, even with huge, lush arrangements and a growing toolkit of instruments, the songs never sound cluttered or overwrought. “Follow My Girl,” an ethereal yet pummeling song about forgetting what it feels like to feel good, blurs synths and vocals together like light trails in a nighttime photograph.\nBain is not a powerhouse singer, and she often beefs up her vocals with Auto-Tune or thick harmonic layers. But on “Saw You in a Dream,” a stripped-back version of the previously released single, she peels off the flotation devices and jumps in. A strummy, surfy tribute to her late first love, the track was recorded in two teary takes. Her voice quivers and cracks along as she wrestles with conflicting feelings of agony and acceptance. “It isn’t the same but it is enough,” she sings, the perfect epilogue to a project about life after grief.\n", "pptitle": ["good", "fall"]}