{"id": "PF_10", "url": "https://pitchfork.com/reviews/albums/floating-points-late-night-tales/", "name": ["Late", "Night", "Tales"], "description": ["listen", "consist", "underwhelm", "stream", "algorithm", "wors", "follow", "sam", "shepherd", "better", "known", "float", "point", "globetrot", "nt", "radio", "rove", "your", "melodi", "dj", "night", "hidden", "gem", "lovingli", "reissu", "label", "melodi", "intern", "shepherd", "enthusiast", "sharer", "delect", "select", "unearth", "rare", "gospel", "soul", "jazz", "droney", "minim", "tropicalismo", "folk", "plenti", "music", "elud", "easi", "identif", "tap", "float", "point", "curat", "latest", "edit", "late", "night", "talesa", "seri", "selector", "hidden", "depth", "record", "collectionsi", "great", "pair", "shepherd", "take", "opportun", "float", "unhurri", "select", "rumin", "crepuscular", "music", "wee", "hour", "unlik", "good", "friend", "tet", "eclect", "contribut", "seri", "float", "point", "keep", "mood", "consist", "select", "faster", "rest", "heartbeat", "feel", "dramat", "despit", "staringatacandl", "zoneout", "karali", "coverdal", "sarah", "davachi", "mix", "isnt", "fall", "sleep", "instead", "trackth", "spiderweb", "fragil", "carlo", "walker", "lctea", "minut", "zerograv", "bliss", "ecm", "trio", "azimuthi", "perfectli", "suit", "inspir", "sweet", "reveri", "float", "point", "geek", "discog", "ask", "price", "select", "exquisit", "arcan", "sonic", "detail", "lost", "listen", "yield", "way", "simpl", "ride", "cymbal", "sound", "consecut", "select", "underst", "timekeep", "dreami", "psych", "pop", "ration", "glowin", "turn", "urgent", "amid", "restrain", "orchestr", "movement", "william", "s", "fischer", "chain", "state", "swing", "hand", "drummer", "max", "roach", "equipois", "pass", "set", "lost", "reverb", "sweet", "innoc", "express", "love", "sound", "like", "transmit", "distant", "planet", "listen", "close", "antiwar", "soul", "bobbi", "wright", "selfreleas", "1974", "song", "blood", "american", "recent", "reissu", "melodi", "intern", "hear", "lip", "smack", "lean", "microphon", "float", "point", "mix", "trade", "primarili", "rare", "groov", "given", "gorgeous", "select", "unusu", "surfac", "lyric", "sweet", "innoc", "sing", "want", "emot", "vulner", "men", "default", "stress", "import", "humil", "gentl", "mantwo", "trait", "hard", "world", "pop", "music", "listen", "close", "darker", "sentiment", "aris", "default", "fret", "have", "food", "eat", "ration", "sing", "dont", "commit", "suicidey", "got", "glowin", "wright", "lost", "bandmat", "fight", "vietnam", "sing", "soldier", "blood", "pour", "hush", "voic", "harrow", "indict", "war", "moment", "like", "make", "case", "vital", "music", "drift", "equal", "crucial", "music", "meaning", "say"], "date_published": ["2019-03-30T05:00:00"], "sentiment": 0.22859848484848486, "content": "Listeners consistently underwhelmed by streaming algorithms could do worse than to follow Sam Shepherd, better known as Floating Points. From his globetrotting show on NTS Radio and his roving You’re a Melody DJ nights to the hidden gems he lovingly reissues on his label Melodies International, Shepherd is an enthusiastic sharer of the delectable selections he unearths: rare gospel, soul, jazz, droney minimalism, tropicalismo, folk, and plenty of music that eludes easy identification.\nSo tapping Floating Points to curate the latest edition of Late Night Tales—a series in which selectors show off the hidden depths of their record collections—is a great pairing. Shepherd takes the opportunity to float through an unhurried selection of ruminative, crepuscular music for the wee hours. Unlike his good friend Four Tet’s own eclectic contribution to the series, Floating Points keeps the mood consistent. Few selections move faster than a resting heartbeat, but they nevertheless feel dramatic. Despite staring-at-a-candle zone-outs from Kara-Lis Coverdale and Sarah Davachi, the mix isn’t made for falling to sleep. Instead, each track—the spiderweb fragility of Carlos Walker’s “Via Láctea,” nine minutes of zero-gravity bliss from ECM trio Azimuth—is perfectly suited to inspire sweet reveries.\nAnd since it’s Floating Points, you can either geek out over Discogs’ asking price of some of these selections or find exquisite, arcane sonic details to get lost in. One listen might yield the way something as simple as the ride cymbal can sound across three consecutive selections: It’s an understated timekeeper on the dreamy psych pop of the Rationals’ “Glowin’,” turns urgent amid the otherwise restrained orchestral movements of William S. Fischer’s “Chains,” and becomes stately and swinging in the hands of drummer Max Roach on “Equipoise.” On another pass through the set, you might find yourself lost in reverb: Sweet & Innocent’s “Express Your Love” sounds like it’s transmitting from a distant planet. Listen close to the anti-war soul of Bobby Wright’s self-released 1974 song “Blood of an American,” recently reissued by Melodies International, and you can hear his lips smack as he leans toward the microphone.\nThat Floating Points’ mix trades primarily in rare grooves is a given. Beyond the gorgeousness of each selection, something even more unusual surfaces in the lyrics. Sweet & Innocent sing of wanting emotional vulnerability in their men, and the Defaulters stress the importance of humility on “Gentle Man”—two traits hard enough to find in the world, much less in pop music. Listen close and darker sentiments arise: The Defaulters fret about having enough food to eat. The Rationals sing, “Don’t commit suicide/You got to keep on glowin’.” And Wright, who lost one of his bandmates to the fighting in Vietnam, sings of soldiers’ blood being “poured out over you,” his hushed voice a harrowing indictment of the war. Moments like these make the case that, as vital as it is to have music to drift off to, it’s equally crucial that the music has something meaningful to say.\n", "pptitle": ["late", "night", "tale"]}