{"id": "PF_86", "url": "https://pitchfork.com/reviews/albums/t-pain-1up/", "name": ["1UP"], "description": ["time", "surpris", "strength", "tpain", "voic", "2014", "clip", "multiplatinum", "grammywin", "artist", "sing", "aid", "autotun", "npr", "tini", "desk", "seri", "quickli", "went", "viral", "deft", "display", "vocal", "control", "prove", "man", "soundtrack", "high", "school", "prom", "parti", "pitchcorrect", "pop", "anthem", "command", "room", "godgiven", "croon", "year", "later", "he", "shock", "time", "win", "realiti", "sing", "competit", "requir", "shroud", "ident", "furri", "cyclop", "costum", "belt", "sam", "smith", "ballad", "show", "judg", "guess", "ident", "monster", "rb", "star", "like", "jami", "foxx", "tyres", "gibson", "dariu", "rucker", "consid", "rappa", "ternt", "sanga", "shed", "mask", "verg", "tear", "explain", "didnt", "chanc", "enter", "game", "natur", "voicethi", "help", "voic", "took", "perform", "dress", "like", "nightmarish", "monster", "charact", "isnt", "realli", "tpain", "fault", "massiv", "success", "earli", "singl", "like", "im", "sprung", "im", "n", "luv", "wit", "stripper", "buy", "u", "drank", "usher", "new", "landscap", "pop", "music", "that", "go", "strong", "today", "influenc", "paul", "mccartney", "boogi", "wit", "da", "hoodi", "harmon", "audio", "processor", "hard", "separ", "tpain", "technolog", "reintroduc", "world", "infiltr", "pop", "nearli", "decad", "earlier", "cher", "1998", "smash", "believ", "continu", "lean", "heavili", "token", "refus", "tri", "new", "recent", "album", "stifl", "abil", "capit", "goodwil", "he", "garner", "newest", "project", "1up", "differ", "12", "track", "sound", "like", "come", "2005", "debut", "result", "start", "fun", "ride", "memori", "lane", "quickli", "turn", "grate", "slog", "trendsett", "frustratingli", "gotten", "thing", "start", "rel", "strong", "open", "titl", "track", "see", "tpain", "strike", "tone", "usual", "filter", "synth", "pluck", "stutter", "snare", "clap", "harmon", "phone", "friend", "jail", "wonder", "place", "opposit", "end", "freedom", "phone", "smell", "like", "tear", "dawg", "sigh", "barrel", "energi", "introspect", "recal", "work", "fellow", "crooner", "futur", "took", "tpain", "digit", "sound", "darker", "harderhit", "critic", "commerci", "success", "profund", "pretti", "end", "song", "later", "u", "prototyp", "tpain", "love", "lullabi", "captur", "feel", "run", "pictur", "ex", "social", "media", "want", "text", "whiskey", "sour", "u", "nostalg", "repres", "predict", "1up", "larg", "incorpor", "snap", "sound", "use", "past", "hit", "like", "buy", "u", "drank", "album", "fill", "rehash", "old", "materi", "chestbump", "camaraderi", "2010", "starstud", "dj", "khale", "collab", "win", "parti", "anthem", "dog", "birthday", "gentl", "key", "2008", "believ", "ballad", "x", "bad", "habit", "lyricist", "linger", "cross", "line", "play", "juvenil", "like", "come", "open", "pain", "clumsi", "line", "hurt", "derrier", "devot", "choru", "brazenli", "cuss", "partner", "parent", "featur", "canadian", "singer", "tori", "lanez", "rapper", "russ", "known", "simplist", "crass", "approach", "heavi", "subject", "matter", "dont", "help", "there", "autotun", "end", "album", "suffoc", "repetit", "lighterflick", "lil", "wayn", "pain", "longestrun", "collabor", "help", "breath", "life", "project", "final", "track", "give", "vocal", "minu", "filter", "switch", "product", "lean", "acoust", "natur", "viral", "perform", "tpain", "instead", "reli", "tire", "formula", "save", "grace", "1up", "know", "craft", "earworm", "clearli", "encapsul", "song", "got", "impish", "melodi", "singalong", "hook", "draw", "mind", "artist", "heavili", "influenc", "pain", "tierra", "whack", "mostrec", "project", "whack", "world", "act", "decad", "straightforward", "version", "songwrit", "warbl", "chorus", "short", "runtim", "got", "follow", "similar", "path", "essenti", "function", "big", "choru", "make", "breez", "compar", "track", "1up", "stretch", "minut", "long", "mayb", "groundwork", "pain", "project", "cue", "like", "whack"], "date_published": ["2019-03-06T06:00:00"], "sentiment": 0.050189165878821045, "content": "How many times can we be surprised by the strength of T-Pain’s voice? Back in 2014, clips of the multi-platinum, Grammy-winning artist singing without the aid of Auto-Tune for NPR’s ”Tiny Desk” series quickly went viral for their deft display of vocal control, proving that the man who soundtracked our high school proms and parties with pitch-corrected pop anthems could command a room with his God-given croon. Now, five years later, he’s shocking us once again, this time by winning a reality singing competition that required him to shroud his identity in a furry cyclops costume and belt Sam Smith ballads. The show’s judges guessed the identity of “The Monster” was a former R&B star, like Jamie Foxx or Tyrese Gibson, or even Darius Rucker. No one considered the Rappa Ternt Sanga, who, upon shedding his mask and on the verge of tears, explained, “I didn’t get a chance to enter the game with my natural voice...this helped get my voice out there.” It only took a few performances dressed like a nightmarish Monsters, Inc. character to do so.\nThis isn’t really T-Pain’s fault. With the massive success of his early singles like “I’m Sprung,” “I’m N Luv (Wit a Stripper)” and “Buy U a Drank,” he ushered in a new landscape for pop music that’s still going strong today, influencing everyone from Paul McCartney to A Boogie Wit Da Hoodie to harmonize through an audio processor. Thus it’s hard to separate T-Pain from the technology that he reintroduced to the world (it first infiltrated pop nearly a decade earlier on Cher’s 1998 smash “Believe”) and continues to lean on heavily. By the same token, his refusal to try anything new on his recent albums has stifled his ability to capitalize on the goodwill he’s garnered. His newest project, 1UP, is no different, with many of its 12 tracks sounding like they could have come from his 2005 debut. As a result, what starts as a fun ride down memory lane quickly turns into a grating slog by a trendsetter who frustratingly still hasn’t gotten his due.\nThings start out relatively strong with the opening title track, which sees T-Pain strike a more serious tone than usual. Over filtered synth plucks and stuttering snare claps, he harmonizes from the other side of the phone to a friend in jail, wondering what placed them on opposite ends of freedom. “Phone smell like tears, how my dawg get up in there,” he sighs. Its barreling energy and introspectiveness recall the work of fellow crooner Future, who took T-Pain’s digitized sound and made it darker and harder-hitting to critical and commercial success. The profundity pretty much ends there, though. A few songs later and we’re at “U Up,” a prototypical T-Pain love lullaby that captures the feeling of running across a picture of an ex on social media and wanting to text them after one too many whiskey sours.\n“U Up,” although nostalgic, is representative of the predictability of 1UP, which by and large incorporates the same snap sounds used on past hits like “Buy U a Drank.” The album is filled with rehashes of old material, whether it’s the chest-bumping camaraderie of 2010’s star-studded DJ Khaled collab “All I Do Is Win” on the party anthem “It’s My Dog’s Birthday” or the gentle keys of 2008’s “Can’t Believe It” on the ballad “Be Your X.” Many of his bad habits as a lyricist still linger, too, as he often crosses the line between being playful and juvenile, like on “Here It Comes,” which opens with the painfully clumsy line, “I put the hurt on the derriere,” or “Keep This From Me,” where he devotes the chorus to brazenly cussing out a partner’s parents. Features by Canadian singer Tory Lanez and rapper Russ, known for their simplistic and sometimes crass approach to heavy subject matter, don‘t help.\nAnd then there’s the Auto-Tune, which, by the end of the album, is suffocating in its repetitiveness; not even a lighter-flicking Lil Wayne, Pain’s longest-running collaborator, can help breathe life into the project on its final track. Rather than giving his vocals a go minus filters or switching the production to lean into the acoustic nature of his viral performances, T-Pain instead relies on a tired formula.\nThe one saving grace of 1UP is that he still knows how to craft earworms, most clearly encapsulated by the song “We All We Got.” Its impish melody and sing-along hook draw my mind to another artist heavily influenced by Pain, Tierra Whack, whose most-recent project Whack World acts as a more decadent and straightforward version of his songwriting, with its warbled choruses and short runtimes. “We Got” follows a similar path, essentially functioning as one big chorus and thus making it a breeze compared to other tracks on 1UP, many of which stretch over four minutes long. Maybe this is the groundwork for Pain’s next project; if he can’t take cues from himself, he can from others like Whack.\n", "pptitle": ["1up"]}