{"id": "PF_70", "url": "https://pitchfork.com/reviews/albums/rap-export/", "name": ["EXPORT"], "description": ["element", "export", "sound", "familiar", "way", "album", "draw", "deepli", "root", "subgenr", "like", "dub", "techno", "gabber", "shoegaz", "postpunk", "simpli", "record", "collector", "ultim", "fetish", "object", "ambit", "extend", "far", "tick", "box", "yesterday", "nich", "sound", "rap", "thoma", "bush", "guy", "gormley", "join", "sound", "idea", "gener", "thought", "incompat", "way", "fundament", "deepen", "mysteri", "effect", "uk", "duo", "achiev", "explicitli", "futurist", "obvious", "retro", "path", "slice", "sooti", "gloom", "margaret", "thatcher", "earli", "reign", "hangarlik", "rave", "rotterdam", "decad", "later", "sound", "explicitli", "doesnt", "sound", "like", "electron", "music", "moment", "export", "draw", "energi", "moment", "youth", "movement", "yore", "shot", "fieldrecord", "scrap", "contemporari", "citi", "life", "feel", "like", "album", "commun", "experi", "record", "inform", "life", "headphon", "rap", "known", "deepen", "intrigu", "doe", "cut", "loos", "obviou", "connot", "float", "unteth", "mean", "like", "word", "youv", "repeat", "long", "begin", "sound", "like", "nonsens", "avail", "inform", "group", "pale", "move", "enigmat", "qualiti", "music", "itselflik", "way", "search", "piano", "etud", "collaps", "smartphon", "record", "roost", "bird", "gentl", "folktron", "ballad", "cut", "short", "oppress", "din", "public", "transport", "breadcrumb", "scatter", "duo", "catalog", "lead", "singular", "achiev", "busha", "visual", "artist", "work", "encompass", "typographi", "stone", "engrav", "bakingreleas", "strang", "moros", "album", "lopsid", "synth", "pop", "year", "depend", "squint", "detect", "strain", "postrock", "goth", "african", "music", "gormley", "photograph", "curat", "lengthier", "discographi", "enchant", "put", "danc", "12", "2011", "steadili", "develop", "woolli", "style", "leftfield", "hous", "cofound", "jolli", "disc", "label", "export", "hand", "label", "record", "cycl", "hand", "idea", "small", "set", "collabor", "way", "insular", "crew", "inscrut", "aesthet", "morph", "drift", "snap", "sharpli", "focu", "remain", "difficult", "rap", "debut", "album", "2015", "let", "felt", "larg", "like", "pastich", "early80", "synth", "pop", "export", "uniqu", "album", "sullen", "open", "chord", "sketch", "dubtechno", "feel", "offer", "littl", "indic", "far", "quickli", "album", "travel", "34", "minut", "track", "flow", "like", "dj", "set", "baptism", "open", "song", "steadili", "gather", "forc", "whip", "clang", "chord", "trap", "snare", "pensiv", "whirlwind", "build", "build", "ruin", "pick", "piledriv", "beat", "wrap", "strang", "eerili", "bright", "melodi", "sound", "like", "seefeel", "tackl", "mediev", "folk", "bass", "drum", "fall", "away", "ravetest", "puls", "return", "mixer", "steeldrum", "synth", "play", "unabash", "tranc", "melodi", "bass", "drum", "land", "weight", "medicin", "ball", "caught", "prototechno", "posteveryth", "song", "dizzi", "way", "collaps", "era", "export", "plenti", "make", "album", "truli", "except", "duo", "vocal", "sung", "untutor", "bariton", "there", "uncanni", "resembl", "vintag", "new", "wave", "contribut", "music", "strang", "heard", "context", "wonder", "old", "song", "decad", "time", "lyric", "import", "simpl", "sound", "voicesflat", "smooth", "like", "stone", "river", "young", "persuas", "gnomic", "command", "veer", "away", "traditionturn", "away", "act", "young", "persuas", "mirror", "agil", "basslin", "rise", "fall", "static", "callandrespons", "refrain", "take", "qualiti", "intern", "dialogu", "round", "melancholi", "depth", "sound", "interior", "defin", "album", "hardli", "record", "recent", "memori", "combin", "postpunk", "influenc", "contemporari", "electron", "product", "distinguish", "export", "way", "rap", "use", "unlik", "fusion", "way", "access", "untap", "feel", "rare", "beat", "like", "led", "introspect", "place", "close", "nsew", "raver", "bittersweet", "blend", "hous", "beat", "indi", "guitar", "sound", "littl", "like", "hot", "chip", "filter", "burial", "nostalg", "gaze", "north", "south", "east", "westal", "want", "bit", "perspect", "sing", "voic", "layer", "low", "hihat", "peter", "keyboard", "die", "away", "leav", "audio", "snapshot", "captur", "handheld", "record", "steadi", "footstep", "bark", "dog", "wind", "whip", "surfac", "microphon", "entir", "clear", "end", "look", "landscap", "entir", "invent", "hell", "view"], "date_published": ["2019-03-14T05:00:00"], "sentiment": 0.08568386346164125, "content": "The elements of EXPORT sound familiar, but the way they have been put together is anything but. Because the album draws from deeply rooted subgenres like dub techno, gabber, shoegaze, and post-punk, it could have been simply a record collector’s ultimate fetish object, but its ambitions extend far beyond ticking off the boxes of yesterday’s niche sounds. RAP’s Thomas Bush and Guy Gormley have joined sounds and ideas generally thought to be incompatible in ways that fundamentally deepen the mystery of each one.\nThe effect the UK duo achieve is neither explicitly futuristic nor obviously retro. Its path slices through the sooty gloom of Margaret Thatcher’s early reign and the hangar-like raves of Rotterdam a decade later, yet it sounds explicitly now, even though it doesn’t sound much like any other electronic music being made at the moment. And although EXPORT draws energy from momentous youth movements of yore and is shot through with field-recorded scraps of contemporary city life, it feels less like an album about communal experience than a record informed by life under headphones.\nThat RAP are not well known deepens the intrigue. So does their name. Cut loose from its most obvious connotation, it floats untethered from meaning, like a word you’ve repeated so long it begins to sound like nonsense. The available information about the group (which is not much) pales against the moving, enigmatic qualities of the music itself—like the way a searching piano etude collapses into a what might be a smartphone recording of roosting birds, or a gentle folktronic ballad is cut short by the oppressive din of public transport.\nBut there are breadcrumbs scattered throughout the duo’s catalog that lead to this singular achievement. Bush—a visual artist whose work has encompassed typography, stone engraving, and baking—released a strange, morose album of lopsided synth pop last year in which, depending on how you squinted, you might also detect strains of post-rock, goth, or African music. Gormley, a photographer and curator, has the lengthier discography. As Enchante, he has been putting out dance 12\"s since 2011, steadily developing a woolly style of left-field house. As a co-founder of Jolly Discs, the label behind EXPORT, he has also had a hand in most of the label’s records, cycling through a handful of ideas with a small set of collaborators. Along the way, this insular crew’s often inscrutable aesthetic has morphed and drifted, but it snaps sharply into focus here, even if it remains difficult to name.\nRAP’s debut album, 2015’s Let’s Get Serious, felt largely like a pastiche of early-’80s synth pop, but EXPORT is unique. The album’s sullen opening chords sketch out a dub-techno feel but offer little indication of how far and how quickly the album will travel. Over 34 minutes, its eight tracks flow almost like a DJ set. “Baptism,” the opening song, steadily gathers force, whipping clanging chords and trap snares into a pensive whirlwind that builds and builds. “Ruin” picks up the pile-driving beat and wraps it in a strange, eerily bright melody that sounds like Seefeel tackling medieval folk. The bass drum falls away for a while, but the rave-tested pulse returns for “No Mixer,” in which steel-drum synths play unabashed trance melodies over a bass drum that lands with the weight of a medicine ball. Caught between proto-techno and post-everything, these songs have a dizzying way of collapsing eras together.\nIf that were all there was to EXPORT, it would be plenty, but what makes the album truly exceptional are the duo’s vocals, sung in an untutored baritone. There’s an uncanny resemblance to vintage new wave that contributes to the music’s strangeness: Heard without context, you might wonder if these are old songs that were decades before their time. The lyrics are less important than the simple sound of their voices—flat and smooth, like stones at the bottom of a river. In “Young Persuasion,” their gnomic commands (“Veer away from tradition/Turn away for an act of young persuasion”) mirror the agile bassline’s rise and fall; in “Static,” their call-and-response refrain takes on the quality of an internal dialogue, rounding out the melancholy depths of their sound.\nThat interiority defines the album. This is hardly the first record in recent memory to combine post-punk influences with contemporary electronic production, but what distinguishes EXPORT is the way RAP use their unlikely fusion as a way of accessing untapped feelings: Rarely have beats like these led to such an introspective place. The closing “NSEW Ravers” is a bittersweet blend of house beats and indie guitars that sounds a little like Hot Chip filtered through Burial’s nostalgic gaze. “To the north, south, east, west/All I ever wanted was a bit of perspective,” they sing, their voices layered and low, and then the hi-hats peter out and the keyboards die away, leaving us with another audio snapshot captured on a handheld recorder: steady footsteps, barking dogs, and wind whipping across the surface of the microphone. It’s not entirely clear where we have ended up, but, looking back over a landscape entirely of their own invention, it’s a hell of a view.\n", "pptitle": ["export"]}