{"id": "RS_74", "url": "https://www.rollingstone.com/music/music-album-reviews/review-jimi-hendrixs-electric-ladyland-turns-50-with-an-ambitious-boxset-reissue-754982/", "name": ["Review:", "Jimi", "Hendrix’s", "‘Electric", "Ladyland’", "Box", "Set", "Reissue", "–", "Rolling", "Stone"], "description": ["hard", "imagin", "wasnt", "electr", "ladyland", "jimi", "hendrix", "offici", "charg", "music", "sound", "lp", "come", "1967", "year", "play", "200", "concert", "trio", "jimi", "hendrix", "experi", "hed", "quickli", "guitarwield", "megastar", "album", "decid", "slow", "littl", "make", "statement", "lost", "produc", "process", "band", "fell", "apart", "time", "electr", "ladyland", "complet", "hendrix", "selfproclaim", "voodoo", "child", "hardrock", "auteur", "final", "bring", "vision", "world", "doublelp", "contain", "nearli", "80", "minut", "privat", "revel", "gallop", "blue", "psychedel", "explor", "cours", "heap", "transcend", "breathtak", "guitar", "solo", "person", "way", "reflect", "produc", "direct", "credit", "hendrix", "gave", "home", "definit", "watchtow", "arrang", "dylan", "latch", "year", "heard", "possibl", "mimick", "guitar", "lick", "hendrix", "catalogu", "chickenscratch", "wahwah", "intro", "voodoo", "child", "slight", "return", "14", "individu", "masterpiec", "lightn", "energi", "sear", "crosstown", "traffic", "rb", "raveup", "come", "let", "good", "time", "roll", "baroqu", "pop", "burn", "midnight", "lamp", "trippi", "epic", "voodoo", "chile", "1983", "merman", "turn", "list", "goe", "new", "50th", "anniversari", "box", "set", "brilliantli", "explor", "hendrix", "headspac", "lead", "record", "releas", "privat", "demo", "jawdrop", "live", "perform", "experi", "hollywood", "bowl", "documentari", "lp", "51", "surround", "sound", "mix", "record", "remast", "origin", "form", "engin", "eddi", "kramer", "way", "tri", "cover", "collect", "nearli", "ambiti", "hendrix", "imposs", "origin", "album", "sparkl", "thank", "remast", "job", "documentari", "insight", "came", "previous", "episod", "classic", "album", "nonalbum", "materi", "make", "box", "set", "definit", "disc", "earli", "take", "dub", "begin", "featur", "12", "amateur", "record", "hendrix", "teac", "reeltoreel", "new", "york", "drake", "hotel", "1968", "theyr", "quieter", "album", "hear", "struggl", "voic", "mutter", "thing", "like", "guitar", "solo", "map", "tune", "annoy", "neighbor", "hear", "turn", "page", "lyric", "midsong", "version", "1983", "that", "half", "long", "album", "version", "exponenti", "intim", "handwritten", "lyric", "reproduc", "accompani", "book", "funki", "demo", "gypsi", "eye", "hear", "winc", "telephon", "ring", "engag", "record", "take", "long", "hot", "summer", "night", "version", "miss", "settl", "right", "groov", "strum", "song", "bluesi", "burner", "lp", "fascin", "hear", "song", "chang", "time", "got", "studio", "what", "miss", "collect", "imposs", "document", "fulli", "hendrix", "built", "record", "gargantuan", "fullband", "version", "album", "rest", "disc", "featur", "outtak", "variou", "studio", "session", "stun", "angel", "caterina", "version", "1983", "open", "sort", "fluid", "wahinflect", "solo", "hendrix", "call", "card", "instrument", "long", "hot", "summer", "night", "find", "guitarist", "work", "chord", "pianist", "al", "kooper", "rendit", "1983", "time", "10", "minut", "long", "that", "instrument", "featur", "hendrix", "play", "guitar", "bass", "mitch", "mitchel", "blue", "phrase", "just", "flow", "hendrix", "fingertip", "disc", "live", "hollywood", "bowl", "showcas", "thrill", "concert", "experi", "play", "week", "electr", "ladyland", "came", "sound", "gnarli", "staticki", "trio", "play", "form", "make", "suppos", "relax", "thing", "hendrix", "tell", "crowd", "wade", "pool", "stage", "point", "caus", "im", "scare", "hell", "nerv", "dont", "especi", "bassthump", "version", "voodoo", "child", "featur", "impress", "wail", "solo", "channel", "run", "just", "free", "studio", "one", "dedic", "foxey", "ladi", "somebodi", "girlfriend", "tri", "hand", "cream", "sunshin", "love", "realli", "dig", "cat", "turn", "starspangl", "banner", "dont", "mad", "tell", "crowd", "america", "right", "unhing", "purpl", "haze", "concert", "record", "better", "equip", "gone", "hendrix", "great", "concert", "51", "surround", "mix", "allow", "guitar", "solo", "run", "free", "especi", "voodoo", "child", "slight", "return", "make", "room", "maximum", "psychedelia", "track", "like", "1983", "burn", "midnight", "lamp", "way", "truli", "envelop", "sort", "attent", "make", "set", "great", "produc", "fastidi", "reflect", "collect", "packag", "cover", "featur", "shot", "experi", "hang", "children", "central", "park", "taken", "linda", "mccartney", "featur", "handwritten", "note", "insid", "hendrix", "ask", "record", "label", "use", "cover", "infam", "uk", "label", "heed", "request", "american", "press", "sport", "live", "shot", "hendrix", "face", "english", "one", "display", "19", "nake", "women", "hendrix", "hate", "rest", "book", "featur", "insight", "essay", "trackbytrack", "liner", "note", "bonu", "materi", "photo", "hendrix", "bandmat", "page", "page", "notebook", "closest", "represent", "hendrix", "hope", "selfappoint", "director", "titl"], "date_published": ["2018-11-13T15:53:09+00:00"], "sentiment": 0.12430323113312808, "content": "It's hard to imagine now, but it wasn't until Electric Ladyland that Jimi Hendrix was officially in charge of how his music would sound. His first two LPs had come out in 1967, a year in which he played more than 200 concerts with his trio, the Jimi Hendrix Experience. He'd quickly become a guitar-wielding megastar, so with his third album he decided to slow down a little and make a statement. He lost his producer in the process and his band fell apart, but by the time Electric Ladyland was complete, Hendrix had become the self-proclaimed Voodoo Child, a hard-rock auteur finally bringing his own vision to the world. The double-LP contains nearly 80 minutes of private revelations, galloping blues, psychedelic explorations and, of course, heaps of transcendent, breathtaking guitar solos. But it's also personal in a way that reflects the \"produced and directed by\" credit that Hendrix gave himself.\r\n\r\nIt's home to the definitive \"All Along the Watchtower\" (the arrangement Dylan latched onto a few years after he heard it) as well as possibly the most mimicked guitar lick in Hendrix's catalogue, the chicken-scratch wah-wah intro to \"Voodoo Child (Slight Return)\" — and there are 14 other individual masterpieces full of lightning energy before you even get to those two: the searing \"Crosstown Traffic,\" the R&B rave-up \"Come On (Let the Good Times Roll),\" the baroque pop of \"Burning the Midnight Lamp\" and the trippy epics \"Voodoo Chile\" and \"1983 ... (A Merman I should Turn to Be).\" The list goes on.\r\n\r\nA new, 50th anniversary box set brilliantly explores Hendrix's headspace leading up to the record's release with private demos, a jaw-dropping live performance by the Experience at the Hollywood Bowl, a documentary about the LP and a 5.1 surround sound mix of the record, which is also remastered in its original form, by engineer Eddie Kramer. With the way it tries to cover everything, the collection is nearly as ambitious as Hendrix was when he made it (though that would be impossible).\r\n\r\nThe original album still sparkles, thanks to the remastering job, and the documentary is insightful (most of it came out previously as an episode of Classic Albums). But it's the non-album material that makes the box set definitive.\r\n\r\nA disc of early takes, dubbed At Last ... the Beginning, features 12 amateur recordings Hendrix made himself on a Teac reel-to-reel in New York's Drake Hotel in 1968. They're quieter than the album — you can hear him struggling to keep his voice down and muttering things like \"guitar solo\" as he mapped a tune out— so as not to annoy his neighbors. You can hear him turn pages of lyrics mid-song  in a version of \"1983\" that's half as long as the album version and exponentially more intimate. (Some of his handwritten lyrics are reproduced in the accompanying book.) On a funky demo of \"Gypsy Eyes,\" you can hear him wince through the telephone ringing during an otherwise engaging recording. And then there are three takes of \"Long Hot Summer Night\" (one version is missing here) that find him settling into the right groove and strumming along on a song that would become a bluesy burner on the LP. It's fascinating to hear how much these songs changed by the time he got into the studio. What's missing in the collection — and this would be impossible to document fully — is how Hendrix built these recordings into the gargantuan, full-band versions on the album.\r\n\r\nThe rest of the disc features outtakes from various studio sessions. The most stunning are \"Angel Caterina\" (another version of \"1983\"), which opens the sort of fluid, wah-inflected soloing that was Hendrix's calling card, an instrumental take of \"Long Hot Summer Night\" that finds the guitarist working out the chords with pianist Al Kooper, and yet another rendition of \"1983\" (this time 10 minutes long) that's instrumental and features Hendrix playing guitar and bass with Mitch Mitchell. The blues phrases just seem to flow from Hendrix's fingertips.\r\n\r\nThe next disc, Live at the Hollywood Bowl, showcases a thrilling concert the Experience played a few weeks before Electric Ladyland came out. The sound is gnarly and staticky, but the trio's playing is in top form and more than makes up for it. \"This is [supposed to be] a relaxing thing,\" Hendrix tells the crowd, which was wading through a pool in front of the stage, at one point. \"'Cause I'm scared as hell.\" His nerves don't show though, especially on a bass-thumping version of \"Voodoo Child,\" that features some impressive wailing solos that he seems to channel from somewhere — they run just as free as the studio ones. Elsewhere, he dedicates \"Foxey Lady\" to \"somebody's girlfriend,\" tries his hands at Cream's \"Sunshine of Your Love\" (\"We really dig those cats\") and turns the \"Star-Spangled Banner\" (\"Please don't get mad,\" he tells the crowd, \"This is America, right?\") into an unhinged take on \"Purple Haze.\" If only the concert were recorded with better equipment, this could have gone down as one of Hendrix's great concerts.\r\n\r\nThe 5.1 surround mix allows the guitar solos to run free (especially on \"Voodoo Child (Slight Return)\") and makes room for maximum psychedelia on tracks like \"1983\" and \"Burning of the Midnight Lamp\" in a way that truly envelopes you. It's this sort of attention to detail that makes this set great.\r\n\r\nAnd the producers' fastidiousness is reflected in the collection's packaging. The cover features a shot of the Experience hanging with children in Central Park taken by Linda McCartney, and it features a handwritten note inside from Hendrix asking his record label to use it as the cover. Infamously, neither the U.S. nor U.K. labels heeded his request, with American pressings sporting a live shot of Hendrix's face and the English ones displaying 19 naked women, which Hendrix hated. The rest of the book features an insightful essay and track-by-track liner notes for the bonus material, as well as photos of Hendrix and his bandmates and pages and pages from his notebooks. It's the closest representation Hendrix could have hoped for with his self-appointed \"director\" title, and then some.", "pptitle": ["review", "jimi", "hendrix", "electr", "ladyland", "box", "set", "reissu", "roll", "stone"]}