{"id": "RS_54", "url": "https://www.rollingstone.com/music/music-album-reviews/earl-sweatshirts-some-rap-songs-obsessed-drowning-architect-rises-762990/", "name": ["Earl", "Sweatshirt’s", "‘Some", "Rap", "Songs’", "Is", "Obsessed", "With", "Drowning", "–", "Rolling", "Stone"], "description": ["voic", "listen", "hear", "rap", "song", "earl", "sweatshirt", "latest", "album", "jame", "baldwin", "imprecis", "word", "say", "pop", "vinyl", "hit", "sampl", "come", "1962", "record", "baldwin", "artist", "struggl", "integr", "speech", "new", "york", "citi", "commun", "church", "explain", "distrust", "variou", "word", "artist", "integr", "warlik", "integr", "point", "meaningless", "word", "start", "carri", "new", "weight", "time", "compel", "recogn", "imprecis", "word", "kind", "attempt", "real", "live", "word", "like", "exampl", "matter", "suppos", "word", "chip", "artist", "contrari", "perpetu", "mythmak", "certain", "corner", "rap", "twitter", "earl", "isnt", "lyric", "messiah", "bring", "classic", "hiphop", "halt", "ascent", "genr", "facetat", "new", "superstar", "instead", "he", "artist", "mold", "baldwin", "lay", "focus", "improv", "craft", "execut", "insular", "creativ", "vision", "word", "rapper", "arent", "imprecis", "theyr", "obsess", "prune", "chosen", "labor", "vocal", "deliveri", "studious", "way", "nonsens", "intern", "rhyme", "shock", "rap", "2010", "earl", "teenag", "breakout", "he", "master", "art", "restraint", "rap", "song", "album", "circl", "death", "loss", "matur", "rare", "album", "resist", "offer", "broader", "mean", "theme", "earl", "doesnt", "provid", "easi", "answer", "doesnt", "instead", "rap", "song", "simpli", "project", "good", "song", "bad", "emot", "januari", "sweatshirt", "father", "south", "african", "poet", "laureat", "keorapets", "kgositsil", "die", "dad", "relationship", "that", "uncommon", "peopl", "father", "nonperfect", "earl", "wrote", "statement", "album", "releas", "talk", "symbol", "nonsymbol", "liter", "closur", "childhood", "get", "moment", "left", "figur", "lot", "damn", "self", "grief", "manifest", "repetit", "earl", "select", "seri", "concis", "loop", "beat", "deploy", "repeat", "iter", "memori", "he", "drown", "disbelief", "inform", "way", "escap", "aint", "tell", "sinkin", "aint", "tell", "leav", "rap", "album", "open", "shatter", "dream", "song", "later", "red", "water", "proclaim", "sinkin", "aint", "know", "leav", "mint", "lament", "he", "stand", "shoulderlevel", "water", "wont", "stop", "rise", "unclear", "earl", "tri", "escap", "fame", "depress", "expect", "death", "make", "clear", "pressur", "get", "rap", "song", "seek", "circumv", "listen", "expect", "claustrophob", "crackl", "nostalg", "product", "sweatshirt", "boolieman", "ad", "hakim", "denmark", "black", "noie", "sage", "eless", "lean", "lowestfi", "instinct", "earl", "decid", "make", "version", "rapper", "mf", "doom", "produc", "mad", "lib", "ellipt", "classic", "madvillaini", "play", "role", "doom", "madlib", "earl", "vocal", "constantli", "verg", "swallow", "sampl", "endeavor", "soul", "superior", "billi", "jone", "overfil", "space", "loop", "replac", "hook", "earl", "declin", "write", "he", "preternatur", "talent", "lyricist", "inclin", "display", "brute", "forc", "opt", "fade", "mix", "instead", "talent", "tend", "produc", "singular", "kind", "egot", "peopl", "want", "know", "theyr", "great", "flaunt", "great", "nuanc", "moder", "afterthought", "lyric", "dens", "complex", "rapper", "manifest", "showi", "display", "headi", "bar", "dens", "wordplay", "part", "import", "rap", "song", "rare", "album", "immens", "talent", "lyricist", "deign", "pull", "firework", "opt", "sink", "cushion", "therapist", "couch", "search", "honest", "work", "art", "delic", "statement", "restraint", "case", "process", "show", "artist"], "date_published": ["2018-12-04T22:28:14+00:00"], "sentiment": 0.1066571802682914, "content": "The first voice listeners hear on Some Rap Songs, Earl Sweatshirt's latest album, is James Baldwin's. \"Imprecise words,\" he says before the pop of vinyl hits. The sample comes from a 1962 recording of Baldwin’s \"The Artist’s Struggle for Integrity\" speech at New York City’s Community Church. In it, he explains his \"distrust\" for various words — \"artist, integrity, warlike and integration\" — pointing out that meaningless words can start to carry new weight over time.\r\n\r\n\"One is compelled to recognize that all these imprecise words are kind of attempts made by us all to get to something which is real and which lives behind the words. Whether I like it or not, for example, and no matter what I call myself, I suppose the only word for me, when the chips are down, is that I am an artist.\"\r\n\r\nContrary to the perpetual mythmaking of certain corners of Rap Twitter, Earl isn't some lyrical messiah here to bring classicism back to hip-hop and halt the ascent of the genre's face-tatted new superstars. Instead, he's an artist in the mold Baldwin lays out; focused only on the improvement of his craft, the execution of his own insular creative vision.\r\n\r\nHis words as a rapper aren’t \"imprecise.\" They’re obsessively pruned, chosen and labored over, even as his vocal delivery is studiously not. It’s been this way since the nonsensical, internal rhyming shock raps of 2010’s EARL — his teenaged breakout — but here he's mastered the art of restraint. Some Rap Songs is an album that circles death, loss and maturity, but it's the rare album to resist offering any broader meaning to its themes. Earl doesn't provide any easy answers because he doesn't have any.\r\n\r\nInstead, Some Rap Songs is simply a project full of good songs about bad emotions. In January, Sweatshirt’s father, the South African poet laureate Keorapetse Kgositsile, died. \"Me and my dad had a relationship that’s not uncommon for people to have with their fathers, which is a non-perfect one,\" Earl wrote in a statement before the album was released. \"Talking to him is symbolic and non-symbolic, but it’s literally closure for my childhood. Not getting to have that moment left me to figure out a lot with my damn self.\"\r\n\r\nOften this grief manifests itself in repetition, and Earl selects a series of concise, looping beats over which to deploy repeated iterations of the same memories. He’s drowning and in disbelief that no one informed him there was a way to escape. \"Why ain't nobody tell me I was sinkin' / Ain't nobody tell me I could leave,\" he raps on album opener \"Shattered Dreams.\" A song later (\"Red Water\") he again proclaims, \"I was sinkin' / I ain't know that I could leave.\" On \"The Mint\" he laments that he’s standing in \"shoulder-level water\" and it won’t stop rising. It’s unclear whether Earl is trying to escape from fame, depression, expectations or death. It could be all of them, but he makes it clear the pressure is getting to him.\r\n\r\nSome Rap Songs seeks, always, to circumvent the listener’s expectations. Claustrophobic, crackling and nostalgic, the production by Sweatshirt, Booliemane, Adé Hakim, Denmark, Black Noi$e and Sage Elesser leans into its lowest-fi instincts. Earl decided to make his own version of rapper MF Doom and producer Mad Lib's elliptical classic Madvillainy, but is playing the roles of both DOOM and Madlib. Earl’s vocals are constantly on the verge of being swallowed whole, as samples by The Endeavors, Soul Superiors and Billy Jones overfill the space, the loops replacing the hooks Earl declined to write. He's still a preternaturally talented lyricist but is less inclined to display that through brute force, opting to fade into the mix instead.\r\n\r\nTalent tends to produce a singular kind of egotism. People want others to know they're great, so they flaunt their greatness — nuance or moderation is an afterthought. For lyrically dense and complex rappers, this often manifests itself in a showy display of heady bars and dense wordplay, the parts more important than the whole. Some Rap Songs is the rare album by an immensely talented lyricist who deigns not to pull out any fireworks, opting to sink into the cushion's of a therapist's couch in the search for an honest work of art. It's a delicate statement of restraint, and in this case the process shows more of the artist than ever before.", "pptitle": ["earl", "sweatshirt", "rap", "song", "obsess", "drown", "roll", "stone"]}