{"id": "UN_70", "url": "https://www.uncut.co.uk/news/leonard-cohen-still-looking-something-else-looking-better-108908", "name": ["Leonard", "Cohen:", "\"He", "was", "still", "looking", "for", "something", "else", "–", "looking", "for", "better\"", "-", "Uncut"], "description": ["new", "issu", "uncut", "shop", "tomorrow", "januari", "17", "avail", "order", "onlin", "click", "explor", "untold", "stori", "leonard", "cohen", "greatest", "album", "recount", "closest", "collabor", "album", "want", "darker", "cohen", "swansong", "releas", "19", "day", "death", "novemb", "7", "2016", "age", "82", "grave", "ill", "he", "work", "endord", "latest", "issu", "uncut", "onlin", "sent", "homepat", "leonard", "producercowriterprogram", "get", "realli", "ill", "creativ", "process", "fairli", "normal", "point", "got", "day", "mayb", "just", "coupl", "day", "day", "truncat", "got", "tough", "day", "id", "come", "talk", "lyric", "want", "darker", "certainli", "know", "came", "laugh", "sick", "just", "light", "heart", "said", "coupl", "time", "lucki", "felt", "record", "thing", "did", "real", "raw", "id", "heard", "live", "version", "bottrel", "play", "guitar", "play", "piano", "bass", "leonard", "sing", "messi", "noisi", "wasnt", "realli", "play", "guitar", "did", "coupl", "thing", "play", "chop", "know", "musician", "talk", "have", "chop", "fingerpick", "pattern", "did", "call", "chop", "oneanjani", "thoma", "rememb", "pat", "leonard", "play", "amaz", "track", "treati", "beauti", "cri", "heard", "pat", "love", "love", "look", "len", "said", "know", "beauti", "said", "music", "obvious", "move", "manipul", "emot", "poignant", "distract", "want", "control", "want", "edgeleonard", "iron", "earli", "version", "that", "record", "use", "talk", "treati", "movi", "did", "25", "version", "treati", "realli", "interest", "one", "interest", "think", "push", "fact", "request", "littl", "string", "arrang", "homag", "effort", "went", "damn", "song", "said", "ultim", "line", "didnt", "variat", "choru", "want", "say", "just", "kept", "tri", "itsharon", "robinson", "vocal", "knew", "get", "sick", "quiet", "time", "wed", "talk", "life", "death", "leonard", "lost", "lot", "friend", "period", "continu", "state", "mourn", "intent", "put", "record", "book", "knew", "time", "limit", "want", "involv", "gave", "lyric", "level", "realli", "like", "wrote", "did", "vocal", "studio", "play", "record", "finish", "littl", "boom", "box", "think", "boom", "box", "work", "80sleonard", "end", "day", "son", "adam", "finish", "fatherson", "stuff", "wasnt", "middl", "go", "longer", "just", "matter", "go", "happen", "dont", "like", "tragic", "end", "thing", "wasnt", "beauti", "man", "die", "home", "children", "guarante", "day", "pass", "away", "work", "stop", "matter", "work", "know", "look", "look", "better", "read", "cohen", "greatest", "album", "peek", "vault", "lowdown", "new", "documentari", "mariann", "leonard", "word", "love", "new", "issu", "uncut", "sale", "tomorrowsubscrib", "uncut", "make", "huge", "save", "cover", "price", "click", "herelik", "facebook", "date", "latest", "news", "uncutth", "march", "2019", "issu", "uncut", "sale", "uk", "leonard", "cohen", "cover", "insid", "youll", "david", "bowi", "bob", "marley", "yardbird", "lambchop", "jessica", "pratt", "crass", "neu", "sean", "ono", "lennon", "15track", "cd", "showcas", "best", "month", "new", "music", "includ", "cass", "mccomb", "sleaford", "mod", "julia", "jacklin", "royal", "truxuncut", "past", "present", "futur", "great", "music"], "date_published": ["2019-01-16T12:53:45+00:00", "2019-01-16T12:53:45+00:00"], "sentiment": 0.14953890553890553, "content": "The new issue of Uncut – in shops tomorrow (January 17) but available to order online now by clicking here – explores the untold stories behind Leonard Cohen’s greatest albums, as recounted by his closest collaborators. One of those albums is You Want It Darker: Cohen’s swansong, released 19 days before his death on November 7, 2016, aged 82. Though gravely ill, he’s working until the very end.Order the latest issue of Uncut online and have it sent to your home!PAT LEONARD [PRODUCER/CO-WRITER/PROGRAMMING]: He was getting really ill. The creative process was fairly normal up to a point, then it got to where he couldn’t do every day, maybe just a couple of days, and even those days were truncated. It got tough. Some days I’d come and all he could do was talk. That lyric, “You Want I Darker”, I certainly know where that came from – yet sometimes we would laugh ourselves sick about just about anything. There was a very light heart there. He said a couple of times how lucky he felt. I have recordings of things we did that were as real and raw as anything I’d ever heard. Live versions with Bill Bottrell playing guitar, me playing piano and bass, and Leonard singing. They were messy and noisy. By then, he wasn’t really playing guitar. We did a couple of things where he would play his ‘chop’. You know how musicians talk about having ‘chops’? He had that fingerpicking pattern that he did, and he called it his ‘chop’. He only had one!ANJANI THOMAS: I remember Pat Leonard playing me this amazing track for “Treaty”. It was so beautiful, I cried when I heard it. Pat loved it, I loved it. I looked at Len and he said, “You know what, it’s too beautiful.” He said the music was too obviously moving, almost manipulative. Too emotional, too poignant. Too much! It was distracting him. He wanted to control it, he wanted some edge.LEONARD: Ironically, that early version is the one that’s on the record. We used to talk about ‘Treaty: The Movie’, as I did no less than 25 versions of “Treaty”. There were some really interesting ones – the last one was so interesting, I think it pushed him back to the first one. In fact, his request for me to do a little string arrangement of it was an homage to how much effort went into the damn song. He said to me that ultimately it was about the line that he didn’t have. There were many variations of the chorus, and until he found what he wanted it to say, we just kept trying it.SHARON ROBINSON [VOCALS]: He knew he was getting sick. It was a quiet time. We’d get together to talk about life and death. Leonard lost a lot of friends during that period – he was almost in a continuous state of mourning, but he was intent on putting out another record and book, as he knew his time was limited. He wanted me to be involved, so he gave me the lyric “On The Level”, and really liked what I wrote. I did the vocals in my own studio, but he played the whole record for me once it was finished, on his little boom box – which I think was the same boom box we worked with back in the ’80s!LEONARD: At the end of the day, his son Adam finished it with him. There was some father/son stuff that I wasn’t about to get in the middle of. You could see that he couldn’t keep going much longer, it was just a matter of when something was going to happen. I don’t like the ‘tragic end’ thing, because it wasn’t. This was a beautiful man who died in his home with his children around him, and I guarantee the day he passed away he was working. He never stopped. No matter what, he worked. I know he was still looking for something else – looking for better. You can read much more about Cohen’s greatest albums – as well as a peek into the vaults and the lowdown on new documentary Marianne & Leonard: Words Of Love – in the new issue of Uncut, on sale tomorrow.Subscribe to Uncut and make huge savings on the cover price – find out by clicking here!Like us on Facebook to keep up to date with the latest news from Uncut.The March 2019 issue of Uncut is now on sale in the UK – with Leonard Cohen on the cover. Inside, you’ll find David Bowie, Bob Marley, The Yardbirds, Lambchop, Jessica Pratt, Crass, Neu!, Sean Ono Lennon and much more. Our 15-track CD also showcases the best of the month’s new music, including Cass McCombs, Sleaford Mods, Julia Jacklin and Royal Trux.Uncut: the past, present and future of great music.", "pptitle": ["leonard", "cohen", "look", "look", "better", "uncut"]}