{"id": "UN_78", "url": "https://www.uncut.co.uk/news/making-bob-marley-wailers-exodus-109010", "name": ["The", "making", "of", "Bob", "Marley", "&", "The", "Wailers'", "Exodus", "-", "Uncut"], "description": ["latest", "issu", "uncut", "shop", "avail", "buy", "onlin", "click", "look", "make", "bob", "marley", "wailer", "greatest", "album", "help", "key", "personnel", "includ", "marley", "wailer", "bandmat", "aston", "famili", "man", "barrett", "donald", "kinsey", "junior", "marvinin", "extract", "graem", "thomson", "articl", "trio", "discuss", "make", "1977", "classic", "exodu", "exil", "london", "marley", "wailer", "make", "album", "allcom", "turn", "angri", "philosoph", "mystic", "offer", "uplift", "parti", "tune", "order", "latest", "issu", "uncut", "onlin", "sent", "home", "donald", "kinsey", "bob", "left", "jamaica", "went", "bahama", "decid", "want", "england", "realli", "went", "underground", "exilejunior", "marvin", "met", "bob", "london", "valentin", "day", "1977", "start", "rehears", "right", "away", "jam", "day", "exodu", "wait", "vain", "jam", "play", "song", "45", "minut", "bob", "put", "final", "touch", "lyric", "music", "keyboard", "player", "tyron", "downi", "time", "fill", "bass", "tyron", "help", "write", "exodu", "love", "electr", "experi", "time", "saw", "somebodi", "aura", "happi", "aliv", "shoot", "smile", "have", "good", "time", "comfort", "london", "great", "jamaican", "afrocaribbean", "commun", "peopl", "ethiopia", "africaaston", "barrett", "spent", "good", "time", "london", "just", "live", "life", "band", "do", "music", "did", "record", "island", "studio", "vibe", "nice", "junior", "marvin", "rush", "studio", "watch", "clock", "book", "24", "hour", "day", "bob", "dream", "come", "true", "song", "exodu", "gener", "recent", "one", "kaya", "wait", "vain", "fresh", "just", "fallen", "love", "cindi", "breakspear", "exodu", "partli", "written", "bob", "left", "jamaica", "shoot", "attempt", "movement", "jah", "peopl", "mean", "movement", "matter", "colour", "creed", "histori", "natur", "mystic", "current", "believ", "aliv", "get", "protect", "spiritu", "vibrat", "song", "definit", "continu", "special", "sens", "time", "place", "love", "song", "milit", "edg", "good", "time", "record", "live", "organ", "way", "drum", "bass", "piano", "acoust", "guitar", "lead", "guitar", "rough", "vocal", "bob", "redo", "rhythm", "guitar", "lot", "vocal", "spent", "lot", "time", "mix", "tri", "perfect", "wed", "compar", "album", "album", "time", "measur", "sonic", "wasnt", "just", "great", "song", "music", "perfect", "realli", "revolutionis", "sound", "reggaey", "read", "bob", "marley", "wailer", "latest", "issu", "uncut", "sale", "leonard", "cohen", "coversubscrib", "uncut", "make", "huge", "save", "cover", "price", "click", "herelik", "facebook", "follow", "twitter", "date", "latest", "news", "uncutth", "march", "2019", "issu", "uncut", "sale", "uk", "leonard", "cohen", "cover", "insid", "youll", "david", "bowi", "bob", "marley", "yardbird", "lambchop", "jessica", "pratt", "crass", "neu", "sean", "ono", "lennon", "15track", "cd", "showcas", "best", "month", "new", "music", "includ", "cass", "mccomb", "sleaford", "mod", "julia", "jacklin", "royal", "truxuncut", "past", "present", "futur", "great", "music"], "date_published": ["2019-01-23T12:49:22+00:00", "2019-01-23T12:49:22+00:00"], "sentiment": 0.23900369238604532, "content": "In the latest issue of Uncut – in shops now or available to buy online by clicking here – we look back at the making of Bob Marley & The Wailers‘ greatest albums with the help of key personnel, including Marley’s Wailers bandmates Aston ‘Family Man’ Barrett, Donald Kinsey and Junior Marvin.In this extract from Graeme Thomson’s article, the trio discuss the making of their 1977 classic Exodus. Exiled in London, Marley and The Wailers make an album for all-comers: Side One is by turns angry, philosophical and mystical; Side Two offers uplifting party tunes. Order the latest issue of Uncut online and have it sent to your home!\n\nDONALD KINSEY: Bob left Jamaica and went to the Bahamas, then decided he wanted to go to England. They really went underground for a while, into exile.JUNIOR MARVIN: I met Bob in London on Valentine’s Day 1977. We started rehearsing right away. My first jam that day was “Exodus”, “Waiting In Vain” and “Jamming” – we played each song for about 45 minutes. Bob was still putting final touches to the lyrics and the music with the keyboard player, Tyrone Downie, who at the time was filling in on bass. Tyrone and myself helped write “Exodus” and “Is This Love?” It was a very electric experience. It was the first time I ever saw somebody’s aura. He was so happy to be alive after the shooting, smiling and having a good time. He was very comfortable in London. There was a great Jamaican and Afro-Caribbean community, people from Ethiopia, Africa…ASTON BARRETT: We spent some good times in London. Just living life, all of us in the band, doing music as we always did. Recording at Island studios was a vibe. It was nice.\n\nJUNIOR MARVIN: There was no rush in the studio, nobody watching the clock. We had it booked 24 hours a day; for Bob that was a dream come true. The songs on Exodus were generally more recent than the ones on Kaya. “Waiting In Vain” was fresh because he had just fallen in love with Cindy Breakspeare. “Exodus” was partly written because Bob had left Jamaica after the shooting attempt – “movement of Jah people,” meaning everyone is part of that movement, no matter your colour, creed or history. “Natural Mystic” was very current, because he couldn’t believe he was still alive, getting protection from the spiritual vibration. The songs definitely had continuity and a special sense of time and place. It had love songs, too, but it had a militant edge. We had a good time recording live, the organic way. It would be drums, bass, piano, acoustic guitar, lead guitar, and rough vocals. Bob would redo his rhythm guitar, and a lot of the vocals. We spent a lot of time mixing, trying to perfect everything. We’d compare our album with the top albums of the time and see how ours measured up sonically. It wasn’t just great songs, but musically almost perfect. It really revolutionised the sound of reggae.You can read much more about Bob Marley & The Wailers in the latest issue of Uncut, on sale now with Leonard Cohen on the cover.Subscribe to Uncut and make huge savings on the cover price – find out by clicking here!Like us on Facebook or follow us on Twitter to keep up to date with the latest news from Uncut.The March 2019 issue of Uncut is now on sale in the UK – with Leonard Cohen on the cover. Inside, you’ll find David Bowie, Bob Marley, The Yardbirds, Lambchop, Jessica Pratt, Crass, Neu!, Sean Ono Lennon and much more. Our 15-track CD also showcases the best of the month’s new music, including Cass McCombs, Sleaford Mods, Julia Jacklin and Royal Trux.Uncut: the past, present and future of great music.", "pptitle": ["make", "bob", "marley", "wailer", "exodu", "uncut"]}