{"id": "PF_80", "url": "https://pitchfork.com/reviews/albums/maren-morris-girl/", "name": ["Girl"], "description": ["want", "repres", "sampl", "pop", "music", "2018", "throw", "time", "capsul", "futur", "explor", "scour", "earth", "climatewreck", "mess", "know", "exactli", "good", "radio", "averag", "better", "zedd", "maren", "morri", "middl", "hit", "slightli", "snazzier", "version", "zedd", "previou", "hit", "alessia", "cara", "collabor", "stay", "vocod", "choru", "clock", "tick", "morri", "writer", "audit", "annemari", "frontrunn", "lost", "music", "job", "equival", "noncompet", "agreement", "member", "fifth", "harmoni", "carli", "rae", "jepsen", "12", "singer", "plenti", "song", "zedd", "career", "consist", "make", "inoffens", "track", "singer", "belt", "yearn", "seiz", "stage", "morri", "great", "litani", "notquitealist", "consid", "suggest", "conduit", "royalti", "starmak", "star", "born", "star", "born", "ceaselessli", "pop", "machin", "do", "middl", "maren", "morri", "flashpoint", "like", "spoiler", "perpetu", "nasti", "debat", "countri", "music", "pop", "mean", "year", "tweet", "defens", "semiinfluenti", "blogger", "accus", "conduct", "like", "absolut", "superstar", "hot", "shit", "ground", "exist", "girl", "reluct", "defens", "shouldnt", "exist", "doe", "record", "promot", "im", "set", "make", "edm", "album", "big", "know", "popdiva", "record", "morri", "told", "ringer", "just", "wanna", "make", "record", "sound", "like", "insid", "head", "judg", "girl", "insid", "morri", "head", "sound", "like", "hobbi", "lobbi", "edm", "album", "popdiva", "record", "diva", "leann", "rime", "faith", "hill", "morri", "dread", "fullariana", "grand", "turn", "songwrit", "greg", "kurstin", "kelli", "clarkson", "pink", "sarah", "aaron", "camila", "cabello", "khalidalreadi", "welltoward", "acoust", "songwrit", "teamsonli", "contribut", "song", "girl", "brandi", "carlil", "duet", "common", "rest", "written", "nashvil", "songwrit", "isnt", "realli", "countrycountri", "record", "remov", "unmistak", "twangi", "vers", "brother", "osborn", "there", "strong", "tell", "sign", "morri", "poppi", "just", "music", "industri", "mainstream", "pop", "increasingli", "welcom", "countri", "artist", "doubt", "notic", "success", "taylor", "swift", "fact", "countri", "radio", "popular", "overal", "contemporari", "hitstop", "40", "sign", "boom", "time", "just", "sign", "kid", "fled", "stream", "result", "stuff", "like", "florida", "georgia", "line", "bebe", "rexha", "meant", "chainsmok", "recent", "singl", "kelsea", "ballerini", "feel", "countri", "today", "increasingli", "just", "sound", "like", "90", "poprock", "like", "dont", "want", "miss", "thing", "semicharm", "life", "countri", "music", "tend", "process", "music", "rob", "harvilla", "wrote", "ringer", "fun", "casual", "notatal", "contriv", "thing", "countri", "music", "star", "love", "namedrop", "pop", "star", "song", "order", "lyric", "crash", "parti", "morri", "did", "breakout", "hit", "church", "doe", "girl", "titl", "track", "doe", "implicitli", "turn", "countri", "halo", "troperec", "growlingli", "chri", "stapleton", "hilari", "keith", "urbaninto", "beyonc", "interpol", "song", "she", "explicit", "what", "time", "machin", "springsteen", "teenag", "dream", "sing", "alongsid", "fivenot", "piano", "bit", "make", "sound", "like", "jingl", "concept", "music", "reminisc", "coldplay", "play", "club", "like", "lose", "edg", "edg", "pillow", "lavish", "time", "ident", "fave", "morri", "bare", "left", "girl", "like", "taylor", "swift", "cross", "write", "deepli", "person", "song", "like", "heartemoji", "text", "sent", "million", "girl", "directli", "kacey", "musgrav", "cross", "warm", "earnest", "doggedli", "untrendi", "record", "girl", "cross", "demonstr", "maren", "morri", "powerhous", "talent", "sing", "hell", "middleoftheroad", "style", "go", "morri", "best", "trait", "goofi", "streak", "heard", "singl", "like", "rich", "dime", "time", "cross", "mindwel", "id", "basic", "sit", "bigass", "pile", "dime", "girl", "best", "peek", "guitar", "chug", "swagger", "stomp", "lead", "singl", "girl", "feel", "effervesc", "bubbl", "popcountri", "best", "word", "spill", "speed", "feel", "rsvp", "closest", "album", "come", "rb", "particularli", "morri", "vocal", "coyli", "whir", "percuss", "great", "one", "slam", "southernrock", "choru", "inevit", "vers", "suggest", "twitchi", "novelti", "girl", "stifl", "repertoir", "suggest", "genr", "excel", "make", "undeni", "tender", "basic", "meghan", "trainor", "song", "retrorepro", "stylingsth", "song", "begin", "fauxcrackli", "end", "recordand", "doowop", "lilt", "bowdler", "song", "clearli", "booti", "lyric", "stuck", "base", "taken", "hard", "imagin", "audienc", "enjoy", "corner", "album", "harder", "imagin", "artist", "morri", "realli", "want"], "date_published": ["2019-03-09T06:00:00"], "sentiment": 0.17246240601503757, "content": "If you want a representative sample of pop music in 2018, something to throw in a time capsule so that future explorers scouring Earth’s climate-wrecked mess would know exactly how good the radio was on average, you can’t do better than Zedd and Maren Morris’ “The Middle.” The hit is a slightly snazzier version of Zedd’s previous hit, Alessia Cara collaboration “Stay,” with the same vocoder chorus and clock ticks. For Morris’ part, the writers also auditioned Anne-Marie (the former front-runner, who lost it because of the music jobbing equivalent of a non-compete agreement), two members of Fifth Harmony, Carly Rae Jepsen(!), and more than 12 other singers.\nThis is how plenty of songs are made and Zedd’s career has consisted of making these inoffensive tracks over which singers can belt and yearn and seize the stage; Morris is great at all three. But as the litany of not-quite-A-listers considered suggests, it’s more a conduit for royalties than for star-making: not an A Star Is Born, more a star borne ceaselessly into the pop machine.\nAnd by doing “The Middle” at all, Maren Morris became a flashpoint whether she liked it or not (spoiler: not) for the perpetually nasty debate over country music becoming “too pop,” and what that even means. Last year, she tweeted in her defense after a semi-influential blogger accused her of “[conducting] herself like she is an absolute superstar and hot shit,” on grounds of existing. Girl is full of this reluctant defensiveness, which shouldn’t have to exist but does, both on record and in its promotion. “I’m not setting out to make an EDM album or a big, you know, pop-diva record,” Morris told The Ringer. “I just wanna make a record that sounds like the inside of my head.”\nJudging by Girl, the inside of Morris’ head sounds like a Hobby Lobby. An EDM album it is not. A pop-diva record it could be, if the diva is LeAnn Rimes or Faith Hill. It is also not Morris’ dreaded full-Ariana Grande turn. Songwriters Greg Kurstin (Kelly Clarkson, Pink) and Sarah Aarons (Camila Cabello, Khalid)—already well-toward the acoustic side of songwriting teams—only contribute two songs, “Girl” and Brandi Carlile duet “Common.” The rest are written by mostly Nashville songwriters. But it isn’t really a country-country record either; remove the unmistakably twangy verse by the Brothers Osborne, and there’d be no strong tells.\nThis is less a sign of Morris’ poppiness than just where the music industry is now. Mainstream pop is increasingly welcoming country artists, no doubt noticing the success of one Taylor Swift and, even more, the fact that country radio is now more popular overall than “contemporary hits”/Top 40. Whether this is a sign of boom times or just a sign that the kids have fled to streaming, it’s resulting in stuff like Florida Georgia Line and Bebe Rexha’s “Meant to Be” or the Chainsmokers’ recent single with Kelsea Ballerini, “This Feeling.” Meanwhile, country today increasingly just sounds like ’90s pop-rock: like “I Don’t Want to Miss a Thing” or “Semi-Charmed Life.”\nCountry music tends to process this in their music: as Rob Harvilla wrote in The Ringer, “a fun and casual and not-at-all contrived thing country music stars love to do is name-drop pop stars in their songs,” in order to lyrically crash its party. Morris did it in breakout hit “My Church,” and does it on Girl too. On the title track, she does it implicitly, turning country’s “halo” trope—recently done growlingly by Chris Stapleton and hilariously by Keith Urban—into a Beyoncé interpolation. In “A Song for Everything,” she’s more explicit: “What’s your time machine? Springsteen or ‘Teenage Dream’?” she sings, alongside a five-note piano bit that makes it sound like a jingle for the very concept of music. She reminisces about when “Coldplay still played clubs,” like “Losing My Edge” by someone with the edge of a pillow. By lavishing so much time on the identity of her faves, Morris barely has any left for her own.\nToo much of Girl is like this. Where Taylor Swift crossed over by writing deeply personal songs, like heart-emoji texts sent to millions of girls directly, and Kacey Musgraves crossed over with a warm, earnest and doggedly untrendy record, Girl crosses over by demonstrating Maren Morris is a powerhouse talent who can sing the hell out of every middle-of-the-road style going. One of Morris’ best traits is her goofy streak, as heard on singles like “Rich” (“If I had a dime every time that you crossed my mind/Well, I’d basically be sitting on a big-ass pile of dimes.”) Girl is best when it can peek out, as on the guitar chug swaggering stomp of lead single “Girl,” or “The Feels”: effervescent bubbly pop-country at its best, words spilling out at the speed of feelings. “RSVP” is the closest the album comes to R&B, particularly in Morris’ vocals, and done coyly, with whirring percussion. “Great Ones” slams into its Southern-rock chorus too inevitably, but the verses do suggest a twitchy novelty that could have been.\nBut too much of Girl is stifling repertoire: suggesting all genres at once, excelling at none. “Make Out With Me” is undeniably tender, but it’s also basically a Meghan Trainor song, from its retro-repro stylings—the song begins with a faux-crackly “this is the end of side one of this record”—and doo-wop lilt to the bowdlerization of a song clearly about a booty call but lyrically stuck at first base. Taken as a whole, it’s hard to imagine the audience who enjoys every corner of this album. It’s even harder to imagine the artist Morris really wants to be.\n", "pptitle": ["girl"]}