{"id": "PF_12", "url": "https://pitchfork.com/reviews/albums/ty-segall-and-freedom-band-deforming-lobes/", "name": ["Deforming", "Lobes"], "description": ["2018", "tour", "forc", "freedom", "goblin", "ty", "segal", "provid", "doublealbum", "highlight", "reel", "aesthet", "restless", "garag", "rocker", "explor", "decad", "solo", "artist", "lightspe", "hardcor", "idyl", "psychedelicfolk", "balladri", "12minut", "fretboardsnap", "jam", "interview", "conduct", "eve", "album", "releas", "segal", "suggest", "album", "repres", "close", "chapter", "feel", "like", "ive", "bare", "tap", "said", "reveal", "desir", "experi", "electron", "product", "make", "hiphop", "album", "remain", "seen", "ty", "actual", "follow", "transform", "mc", "lil", "t", "segal", "lay", "rocker", "id", "rest", "deform", "lobe", "blaze", "glori", "go", "deform", "lobe", "record", "live", "steve", "albini", "segal", "threenight", "stint", "lo", "angel", "teragram", "ballroom", "januari", "2018", "disavow", "rule", "typic", "live", "album", "ambit", "document", "concert", "happenedth", "crowd", "nois", "larg", "suck", "albini", "mix", "point", "feel", "like", "your", "listen", "privat", "rehears", "perform", "crowd", "peopl", "select", "cherrypick", "sprawl", "eclect", "set", "list", "radic", "resequenc", "except", "segal", "signatur", "song", "like", "deform", "lobe", "meant", "serv", "sort", "facto", "greatesthit", "overview", "arent", "freedom", "goblin", "track", "frame", "particular", "moment", "segal", "career", "crucial", "qualiti", "connect", "deform", "lobe", "random", "assort", "deep", "cut", "cover", "earli", "nugget", "that", "pulver", "power", "freedom", "band", "fourpiec", "unitbassist", "mikal", "cronin", "guitarist", "emmett", "kelli", "keyboardist", "ben", "boy", "drummer", "charli", "moothartthat", "back", "segal", "onstag", "2016", "push", "new", "level", "heavi", "facemelt", "gnarli", "concert", "songwrit", "record", "refin", "deform", "lobe", "closest", "anteced", "who", "origin", "equal", "compact", "live", "leed", "purpos", "highlight", "setlist", "stapl", "showcas", "band", "primal", "exploratori", "state", "feel", "freedom", "band", "impos", "presenc", "notea", "announc", "introduc", "band", "open", "chord", "warm", "hand", "come", "rude", "crash", "like", "safe", "drop", "high", "rise", "finish", "utter", "segal", "taken", "segal", "selftitl", "2017", "releas", "nineminut", "progpunk", "suit", "serv", "deform", "lobe", "fearsom", "pointofnoreturn", "gateway", "electricf", "barrier", "erect", "ward", "casual", "fan", "prefer", "segal", "play", "melod", "origin", "eventu", "dissolv", "tranquil", "pool", "noodli", "santana", "solo", "freedom", "band", "redirect", "turbul", "shred", "climax", "combin", "feroc", "fluiditi", "make", "deform", "lobe", "distinct", "segal", "bottomless", "catalog", "freedom", "band", "adren", "properti", "deepli", "felt", "song", "taken", "2016", "emot", "mugger", "segal", "dement", "detour", "alien", "glamrock", "morsecod", "fuzz", "tinfoilchew", "guitar", "frequenc", "stiff", "robot", "rhythm", "squealer", "breakfast", "egg", "way", "pure", "punkmet", "muscl", "segal", "invest", "whimsic", "vocal", "throatravag", "theatric", "deform", "lobe", "revis", "simpli", "exist", "segal", "trashysound", "earli", "record", "welcom", "bottomend", "boosth", "devious", "stretch", "quiet", "intro", "2009era", "standard", "finger", "presum", "maxim", "shockandaw", "factor", "band", "final", "kick", "psychsludg", "groov", "ton", "heavier", "origin", "teragram", "show", "segal", "encor", "rendit", "groundhog", "1971", "asphaltrip", "classic", "cherri", "red", "song", "cover", "2011", "singl", "segal", "tend", "corrupt", "classicrock", "cover", "manic", "energyoften", "pare", "rearrang", "see", "fitth", "cherri", "red", "featur", "reverenti", "standard", "segal", "duti", "mimick", "toni", "mcphee", "highpitch", "melodi", "line", "band", "extracar", "upset", "song", "steadi", "hypnochug", "groov", "deform", "lobe", "smartli", "reposit", "cherri", "red", "penultim", "repriev", "let", "catch", "breath", "album", "gloriou", "final", "version", "love", "fuzz", "stretch", "threeminut", "twin", "thrasher", "segal", "wont", "fool", "complet", "dramat", "oscillatingorgan", "breakdown", "tee", "blitzkrieg", "blast", "career", "segal", "come", "differ", "way", "wave", "goodby", "say", "goodnight", "emphat"], "date_published": ["2019-03-30T05:00:00"], "sentiment": 0.09339038739038741, "content": "On his 2018 tour de force, Freedom’s Goblin, Ty Segall provided us with a double-album highlight reel of every aesthetic the restless garage rocker has explored in his first decade as a solo artist, from light-speed hardcore to idyllic psychedelic-folk balladry to 12-minute fretboard-snapping jams. But in an interview conducted on the eve of the album’s release, Segall suggested the album represented the closing of a chapter. “I feel like I’ve barely even tapped anything,” he said, before revealing a desire to experiment with electronic production and make a hip-hop album. It remains to be seen whether Ty actually follows through on the transformation into MC Lil T. But if Segall is indeed laying his rocker id to rest for a while, Deforming Lobes is the blaze of glory in which it’s going out.\nDeforming Lobes was recorded live by Steve Albini during Segall’s three-night stint at Los Angeles’ Teragram Ballroom in January 2018, but it disavows the rules of the typical live album. It has no ambition to document the concerts as they happened—the crowd noise has been largely sucked out of Albini’s mixes, to the point where it sometimes feels like you’re listening in on a private rehearsal rather than a performance before a crowd of several hundred people. Its eight selections have been cherry-picked from what were much more sprawling and eclectic set lists and radically resequenced. And with few exceptions, these are not Segall’s signature songs, so it’s not like Deforming Lobes is meant to serve as some sort of de facto greatest-hits overview. There aren’t even any Freedom’s Goblin tracks here to frame this particular moment in Segall’s career.\nBut there is one crucial quality that connects Deforming Lobes’ random assortment of deep cuts, covers, and early nuggets. And that’s the pulverizing power of the Freedom Band, the four-piece unit—bassist Mikal Cronin, guitarist Emmett Kelly, keyboardist Ben Boye, and drummer Charlie Moothart—that has backed Segall onstage since 2016, and has pushed him to new levels of heaviness and face-melting gnarliness in concert, even as his songwriting on record has become more refined. As such, Deforming Lobes’ closest antecedent would be The Who’s original, equally compact Live at Leeds, where the purpose is less about highlighting the set-list staples than showcasing the band in their most primal, exploratory state.\nYou can feel the Freedom Band’s imposing presence from the very first note—as an announcer introduces the band, the opening chord of “Warm Hands” comes rudely crashing in like a safe dropped from a high rise before he can even finish uttering Segall’s name. Taken from Segall’s self-titled 2017 release, the nine-minute prog-punk suite serves as Deforming Lobes’ fearsome point-of-no-return gateway, an electric-fence barrier erected to ward off casual fans who prefer Segall’s more playful, melodic side. And where the original eventually dissolves into a tranquil pool of noodly Santana solos, the Freedom Band redirect it toward a turbulent, shredding climax.\nThat combination of ferocity and fluidity makes Deforming Lobes distinct from anything in Segall’s bottomless catalog. The Freedom Band’s adrenalizing properties are most deeply felt on the songs taken from 2016’s Emotional Mugger, Segall’s demented detour into alien glam-rock. Here, the Morse-code fuzz, tinfoil-chewing guitar frequencies, and stiff robotic rhythms of “Squealer” and “Breakfast Eggs” give way to pure punk-metal muscle, while Segall invests their whimsical vocals with a throat-ravaging theatricality. But some Deforming Lobes revisions simply exist to give Segall’s trashy-sounding early recordings a welcome bottom-end boost—he deviously stretches out the quiet intro to the 2009-era standard “Finger,” presumably to maximize the shock-and-awe factor when the band finally kicks into a psych-sludge groove several tons heavier than the original.\nAt all three of his Teragram shows, Segall encored with a rendition of the Groundhogs’ 1971 asphalt-ripping classic “Cherry Red,” a song he first covered for a 2011 single. Where Segall tends to corrupt his classic-rock covers with his manic energy—often paring them down and rearranging them as he sees fit—the “Cherry Red” featured here is almost too reverential by his standards, with Segall dutifully mimicking Tony McPhee’s high-pitched melody lines while the band seems extra-careful not to upset the song’s steady hypno-chug groove. But Deforming Lobes smartly repositions “Cherry Red” as a penultimate reprieve that lets you catch your breath before the album’s glorious finale: a version of “Love Fuzz” that stretches out the three-minute Twins thrasher into Segall’s very own “Won’t Get Fooled Again,” complete with a dramatic oscillating-organ breakdown that tees up one last blitzkrieg blast. Over his career, Segall has come up with different ways to wave goodbye and say goodnight, but none as emphatic as this.\n", "pptitle": ["deform", "lobe"]}