{"id": "PF_100", "url": "https://pitchfork.com/reviews/albums/gary-clark-jr-this-land/", "name": ["This", "Land"], "description": ["startl", "hear", "gari", "clark", "jr", "begin", "land", "spit", "choru", "run", "nigger", "runth", "word", "hear", "spit", "right", "middl", "trump", "countri", "year", "donald", "j", "trump", "administr", "antitrump", "song", "arent", "exactli", "uncommon", "dead", "aim", "openli", "racist", "polit", "surround", "maga", "movement", "make", "land", "brace", "have", "sentiment", "sung", "gari", "clark", "jran", "artist", "studious", "avoid", "make", "grand", "statementsi", "power", "feel", "like", "time", "push", "blue", "guitarist", "stand", "accord", "clark", "wasnt", "mere", "overal", "polit", "climat", "push", "write", "land", "specif", "incid", "new", "neighboron", "believ", "young", "black", "man", "sprawl", "ranch", "just", "outsid", "austin", "gari", "clark", "jr", "channel", "anger", "casual", "racism", "dose", "furi", "control", "origin", "obscuredit", "proper", "blue", "song", "word", "specif", "turn", "univers", "iron", "land", "isnt", "necessarili", "harbing", "rest", "land", "texa", "bluesman", "studio", "album", "apart", "feed", "babi", "offer", "vagu", "plea", "growth", "understand", "isnt", "song", "directli", "confront", "societ", "woe", "anger", "flow", "15", "song", "land", "doe", "indic", "clark", "longer", "feel", "restrict", "confin", "dictat", "modern", "blue", "2012", "releas", "debut", "blak", "blu", "clark", "call", "blue", "world", "home", "cut", "teeth", "legendari", "austin", "club", "antonesth", "place", "stevi", "ray", "vaughan", "began", "rise", "stardom", "clark", "step", "srv", "shoe", "share", "idol", "jimi", "hendrix", "preternatur", "gift", "mimicri", "guitarist", "emul", "hero", "drop", "hat", "instinct", "crank", "amplifi", "limit", "clark", "tendenc", "releas", "live", "album", "studio", "set", "tacit", "admiss", "audienc", "realli", "want", "hear", "solo", "soloan", "acknowledg", "modern", "blue", "fan", "prize", "pyrotechn", "song", "plenti", "guitar", "landhighway", "71", "extend", "solobut", "sixstr", "prowess", "secondari", "concern", "clark", "time", "he", "happi", "use", "instrument", "textur", "shred", "blue", "take", "backseat", "land", "fring", "inform", "chord", "chang", "color", "arrang", "happili", "exist", "coda", "fingerpick", "dirti", "dish", "blue", "boozi", "stumbl", "governor", "forefront", "instead", "clark", "draw", "deepli", "legaci", "princ", "curti", "mayfield", "punctuat", "slowburn", "ballad", "dens", "color", "soul", "churn", "psychedelia", "elong", "regga", "jam", "feel", "like", "million", "blast", "burn", "rocknrol", "gotta", "hint", "sound", "heard", "clark", "previou", "album", "stori", "sonni", "boy", "slimopen", "track", "heal", "wing", "built", "drum", "loop", "star", "sleep", "feign", "funkbut", "land", "interest", "dont", "play", "accoutr", "theyr", "entir", "reason", "album", "exist", "usual", "clark", "work", "lush", "layer", "sound", "sharpli", "execut", "piec", "rootspop", "enliven", "retro", "clich", "keen", "hook", "imagin", "juxtaposit", "im", "gone", "meld", "easi", "windi", "citi", "groov", "touch", "latin", "rumbl", "dont", "wait", "til", "tomorrow", "thread", "drum", "loop", "sampl", "soul", "plea", "clark", "coproduc", "jacob", "sciba", "reli", "sound", "songit", "possibl", "envis", "got", "anthem", "design", "reviv", "flag", "audienc", "tail", "end", "long", "setyet", "that", "ultim", "album", "benefit", "studio", "concoct", "feel", "kinet", "clark", "concert", "better", "land", "place", "gari", "clark", "jr", "doesnt", "appear", "hem", "past", "album", "inform", "old", "sound", "form", "familiar", "trope", "feel", "fresh", "thank", "clark", "idiosyncrat", "splicinga", "crosscultur", "pangenr", "sensibl", "speak", "modern", "world", "just", "land", "speak", "individu", "moment"], "date_published": ["2019-03-02T06:00:00"], "sentiment": 0.06157161678900809, "content": "It’s startling to hear Gary Clark Jr. begin This Land by spitting out a chorus of “Run, nigger, run”—the words he hears spit at him “right in the middle of Trump country.” Two years into the Donald J. Trump administration, anti-Trump songs aren’t exactly uncommon, but very few take dead aim at the openly racist politics surrounding the MAGA movement. That alone makes “This Land” bracing, but having these sentiments sung by Gary Clark Jr.—an artist who has until now studiously avoided making grand statements—is all the more powerful: It feels like the times have pushed the blues guitarist to take a stand.\nAccording to Clark, it wasn’t merely the overall political climate that pushed him to write “This Land,” it was a specific incident with a new neighbor—one who couldn’t believe a young black man could own a sprawling ranch just outside of Austin. Gary Clark Jr. channeled his anger over this casual racism into a dose of fury so controlled, its origin becomes obscured—it becomes a proper blues song, in other words, where the specific is turned into something universal.\nIronically, “This Land” isn’t necessarily a harbinger for the rest of This Land, the Texas bluesman’s third studio album. Apart from “Feed the Babies,” which offers a vague plea for growth and understanding, there isn’t another song that directly confronts a societal woe, nor is there much anger flowing through its other 15 songs. What “This Land” does indicate is how Clark no longer feels restricted by the confining dictates of modern blues.\nEven before the 2012 release of his debut, Blak and Blu, Clark called the blues world his home, cutting his teeth at the legendary Austin club Antone’s—the same place where Stevie Ray Vaughan began his rise to stardom. Often, it seemed as if Clark had stepped into SRV’s shoes: They shared an idol in Jimi Hendrix, a preternatural gift for mimicry (both guitarists could emulate their heroes at a drop of a hat), and an instinct to crank amplifiers to their limits. Clark’s tendency to release live albums after a studio set was a tacit admission that what his audience really wanted to hear was solo after solo—an acknowledgment that many modern blues fans prize pyrotechnics over songs.\nThere is plenty of guitar on This Land—“Highway 71” is nothing but an extended solo—but six-string prowess seems a secondary concern for Clark this time around; he’s happy to use the instrument for texture, not shredding. Blues also takes a backseat on This Land. It’s there on the fringes, informing the chord changes and coloring the arrangements, happily existing as coda on the finger-picked “Dirty Dishes Blues” and on the boozy stumble “The Governor,” but it’s not at the forefront. Instead, Clark draws deeply from the legacies of Prince and Curtis Mayfield, punctuating his slow-burning ballads, densely colored soul, and churning psychedelia with elongated reggae jams (“Feeling Like a Million”) and blasts of burning rock’n’roll (“Gotta Get Into Something”). Hints of these sounds could be heard on Clark’s previous album, The Story of Sonny Boy Slim—opening track “The Healing” and “Wings” were built upon drum loops, and “Star” and “Can’t Sleep” feigned funk—but on This Land, these interests don’t play as accoutrements: They’re the entire reason the album exists.\nUsually, Clark works these lush, layered sounds into a sharply executed piece of roots-pop, enlivening retro cliches through keen hooks and imaginative juxtapositions: “When I’m Gone” melds an easy Windy City groove to a touch of Latin rumble, “Don’t Wait Til Tomorrow” threads drum loops and samples through its soulful plea. Sometimes Clark and co-producer Jacob Sciba rely on sound over song—it’s possible to envision “Got to Get Up” as an anthem designed to revive flagging audience interest at the tail end of a long set—yet that’s ultimately to the album’s benefit, since their studio concoctions feel more kinetic than a Clark concert. Even better, This Land is the first place where Gary Clark Jr. doesn’t appear hemmed in by the past. The album may be informed by old sounds and forms, yet these familiar tropes feel fresh thanks to Clark’s idiosyncratic splicing—a cross-cultural, pan-genre sensibility that speaks to the modern world as a whole, just as “This Land” speaks to this individual moment.\n", "pptitle": ["land"]}