{"id": "PF_64", "url": "https://pitchfork.com/reviews/albums/deli-girls-i-dont-know-how-to-be-happy/", "name": ["I", "Don’t", "Know", "How", "to", "Be", "Happy"], "description": ["truism", "best", "reveng", "life", "wellliv", "mayb", "work", "eventu", "necessari", "stepa", "violenc", "purg", "deli", "girl", "second", "record", "new", "yorkbas", "sweat", "equiti", "dont", "know", "happi", "vengeanc", "document", "built", "industri", "mutant", "rage", "rogu", "galleri", "name", "deflect", "includ", "cop", "hypocrit", "fascist", "apologist", "unusualin", "2019", "know", "enemi", "truli", "celebratori", "unfold", "deli", "girl", "peopledanni", "orlowski", "vocal", "tommi", "kelli", "machin", "record", "legion", "id", "die", "kelli", "layer", "cybernoir", "synth", "drop", "distortedtooblivion", "beat", "crunch", "like", "combat", "boot", "broken", "glass", "orlowski", "shred", "vocal", "weapon", "hyster", "come", "point", "mix", "deli", "girl", "world", "claustrophob", "2017", "record", "evid", "play", "take", "like", "live", "happi", "intent", "construct", "dens", "overdub", "make", "immers", "danc", "track", "perform", "live", "stir", "revelatori", "mosh", "pit", "orlowski", "thrash", "brooklyn", "punk", "show", "arent", "known", "danc", "devot", "underground", "popul", "artist", "dreamcrush", "machin", "girl", "bodi", "signal", "bodi", "collid", "crucial", "queer", "text", "aid", "memoir", "close", "knive", "honor", "year", "whitney", "retrospect", "david", "wojnarowicz", "rage", "expect", "civil", "face", "constant", "statesanct", "violenc", "attend", "noisepunk", "brooklyn", "moment", "feel", "like", "collect", "exorc", "opportun", "discharg", "ubiquit", "anxieti", "legion", "exist", "hey", "mickeymeetsbank", "head", "clap", "intro", "abort", "offkilt", "puls", "anchor", "kinet", "offic", "pinbal", "timpani", "peg", "implicit", "invit", "join", "kelli", "grew", "video", "game", "music", "inch", "nail", "legaci", "compos", "song", "littl", "like", "showdown", "dystopian", "actionshoot", "shut", "sound", "wholli", "like", "final", "boss", "battl", "complet", "mortal", "kombat", "acid", "pit", "drip", "sound", "roll", "war", "drum", "sampl", "unreal", "tournament", "deadpan", "excel", "lost", "lead", "kelli", "orlowski", "frequent", "collabor", "absurdist", "desktop", "webseri", "comp", "usa", "live", "locat", "aesthet", "ouroboro", "y2kretrofuturetechmediaanxieti", "ryan", "trecartin", "molli", "soda", "work", "orlowski", "revel", "villaini", "lean", "derang", "cackl", "nice", "volley", "whimper", "bark", "money", "unleash", "rag", "metal", "screamgrowl", "abort", "kelli", "sampl", "extens", "vox", "repertoir", "use", "percuss", "turn", "indict", "like", "got", "hand", "pockety", "got", "meyou", "scare", "heard", "younoth", "stop", "desert", "sick", "groov", "evid", "delv", "autobiograph", "element", "happi", "commit", "attack", "song", "built", "refrain", "like", "money", "mouth", "shut", "end", "world", "refus", "narr", "your", "kick", "aggress", "person", "space", "assert", "right", "law", "enforc", "bear", "rememb", "excess", "word", "use", "youth", "surest", "cours", "action", "repeat", "need", "say", "stand", "firm", "play", "devil", "advoc", "mantra"], "date_published": ["2019-03-13T05:00:00"], "sentiment": 0.1655333951762523, "content": "There is a truism that the best revenge is a life well-lived, and maybe that works eventually, but before that there is another necessary step—a violence, a purge. Deli Girls’ second record with New York-based Sweat Equity, I Don’t Know How to Be Happy, is a vengeance document built on industrial mutant rage. Their rogues’ gallery, named without deflection, includes cops, hypocrites, fascists, and apologists. This alone is not unusual—in 2019 we know who our enemies are. The truly celebratory part is how it all unfolds.\nDeli Girls is only two people—Danny Orlowski on vocals and Tommi Kelly on machines, but on record they are legion. In “I’d Rather Die,” Kelly layers on cyber-noir synths then drops in distorted-to-oblivion beats that crunch like combat boots on broken glass. Orlowski’s shredded vocals and weaponized hysterics come in from all points of the mix.  The Deli Girls world has always been a claustrophobic one, but where their 2017 record Evidence was played through in one or two takes like a live show, Happy is more intentionally constructed, with dense overdubs that make it all the more immersive.\nFor the most part, these are dance tracks. When performed live, they often stir up revelatory mosh pits in which Orlowski thrashes. Brooklyn punk shows aren’t known for their dancing, but in a devoted underground populated by artists such as Dreamcrusher, Machine Girl, Show Me the Body, and SIGNAL, bodies still collide. In the crucial queer text and AIDS memoir Close to the Knives, honored last year in a Whitney retrospective, David Wojnarowicz raged against the expectation of civility in the face of constant state-sanctioned violence, and attending a noise-punk show in Brooklyn at the moment can feel like a collective exorcism, an opportunity to discharge some of this ubiquitous anxiety. The legion, after all, exists. And in the “Hey Mickey”-meets-“Bank Head” claps on the intro to “Abortion,” or the off-kilter pulse anchoring the kinetic “Officer,” or the pinball timpani on “Peg,” there is an implicit invite to join up.\nKelly grew up on video game music and Nine Inch Nails and, in that legacy, composes each song a little like a showdown in a dystopian action-shooter. “Shut Up” sounds wholly like a final boss battle, complete with Mortal Kombat acid pit dripping sounds, rolling war drums, and samples from Unreal Tournament deadpanning “excellent” and “you have lost the lead.” (Kelly and Orlowski are also both frequent collaborators on the absurdist desktop webseries Comp USA Live, located somewhere in the same aesthetic ouroboros of Y2K/retro/future/tech/media/anxiety as Ryan Trecartin or Molly Soda’s work.)\nOrlowski revels in their own villainy, leaning into a deranged cackle on “Here We Go Again” or “It Must Be So Nice,” volleying between whimpers and barks on “Money,” or unleashing ragged metal scream-growls on “Abortion.” As with Kelly’s samples, their extensive vox repertoire is used percussively, turning indictments like “I got my hand in my pocket/You got me?/You scared?” or “I see you and I heard you/Nothing stops me from deserting” into sick grooves.\nWhere Evidence delved into more autobiographical elements, Happy is committed to the attack. Songs are built around refrains like “put your money where your mouth is” or “shut up about the end of the world,” refusing narrative. But whether you’re kicking an aggressive person out of the show space or asserting your rights to law enforcement, it bears remembering that any excess words can be used against you—the surest course of action is to repeat what you need to say and stand firm. There is no playing devil’s advocate with a mantra.\n", "pptitle": ["dont", "know", "happi"]}