{"id": "PF_44", "url": "https://pitchfork.com/reviews/albums/lil-gotit-crazy-but-its-true/", "name": ["Crazy", "But", "It’s", "True"], "description": ["atlanta", "dont", "pledg", "allegi", "flag", "pledg", "allegi", "burn", "copi", "young", "thug", "slime", "season", "2", "there", "neverend", "flow", "artist", "spring", "thug", "gardenth", "promin", "dripenamor", "pair", "lil", "babi", "gunna", "year", "lil", "gotit", "alongsid", "older", "brother", "lil", "keed", "join", "rank", "rapper", "inspir", "thug", "quirki", "deliveri", "lil", "keed", "stamp", "instantli", "drop", "guest", "vers", "thug", "slime", "languag", "follow", "breakout", "song", "nameless", "unlik", "keed", "gotit", "wasnt", "fast", "start", "19yearold", "instinct", "melodi", "wasnt", "nearli", "develop", "matter", "month", "lil", "gotit", "vers", "live", "deliveri", "anim", "song", "feel", "like", "fantasi", "set", "atlanta", "lenox", "mall", "latest", "project", "crazi", "true", "purpos", "capit", "improv", "find", "lil", "gotit", "hit", "song", "offici", "knight", "atlanta", "star", "lil", "gotit", "concept", "album", "meaningless", "crazi", "true", "isnt", "meant", "cohes", "bodi", "work", "consum", "sit", "18", "dart", "thrown", "board", "hope", "hit", "bullsey", "lil", "gotit", "dire", "search", "hit", "began", "drop", "unenthus", "triller", "video", "instagram", "like", "alamo", "record", "execut", "camera", "hold", "match", "contract", "didnt", "tri", "creat", "viral", "danc", "challeng", "cours", "didnt", "work", "danc", "overli", "complex", "gimmick", "unnecessari", "crazi", "true", "potenti", "end", "gotit", "tireless", "search", "hit", "especi", "da", "real", "hoodbabi", "gotit", "music", "sound", "best", "care", "world", "let", "know", "love", "percocet", "ignor", "moral", "fashion", "brand", "get", "cancel", "drape", "design", "afford", "gucci", "aint", "racist", "rock", "cloth", "gotit", "isnt", "crooner", "thug", "lil", "keed", "voic", "harsher", "gotit", "belliger", "take", "break", "fanci", "flex", "lyric", "warn", "test", "street", "atlanta", "glock", "squeez", "like", "lemon", "ohi", "twist", "red", "just", "like", "trippi", "huh", "similar", "lil", "babi", "gunna", "gotit", "search", "hit", "song", "end", "pair", "lil", "keed", "keed", "highpitch", "deliveri", "gotit", "sound", "menac", "abl", "success", "replic", "drip", "hard", "acoust", "guitar", "formula", "second", "collabor", "project", "drop", "hand", "album", "track", "dud", "expect", "project", "bet", "breakout", "there", "gener", "collabor", "hoodrich", "pablo", "juan", "call", "whitew", "virgil", "send", "free", "clothesthat", "mistaken", "atlantabas", "leak", "that", "surfac", "spinrilla", "year", "song", "bog", "featur", "like", "da", "gang", "overt", "away", "lil", "gotit", "moment", "rapper", "album", "vehicl", "push", "singl", "video", "premier", "worldstarhiphop", "lil", "gotit", "doesnt", "care", "portion", "album", "wind", "unessenti", "filler", "long", "fan", "gravit", "chosen", "fewsong", "like", "da", "real", "hoodbabi", "good", "crazi", "true", "lil", "gotit", "wait", "fate", "cours", "want", "atlanta", "crown", "fit", "comfort", "dome"], "date_published": ["2019-03-20T05:00:00"], "sentiment": 0.10387588001224367, "content": "In Atlanta, they don’t pledge allegiance to the flag, they pledge allegiance to a burned copy of Young Thug’s Slime Season 2. There’s a never-ending flow of artists springing from Thug’s garden—the most prominent being the drip-enamored pair of Lil Baby and Gunna. Last year, Lil Gotit, alongside his older brother Lil Keed, joined the ranks of rappers inspired by Thug’s quirky delivery. Lil Keed made his stamp instantly, dropping in a guest verse on Thug’s Slime Language, followed by his breakout song, “Nameless.” Unlike Keed, Gotit wasn’t off to such a fast start, as the 19-year-old’s instinct for melody wasn’t nearly as developed. But, in a matter of months, Lil Gotit’s verses have become more lively, his delivery more animated, and his songs often feel like a fantasy set in Atlanta’s Lenox Mall. His latest project, Crazy But It’s True, has one purpose: to capitalize on this improvement by finding Lil Gotit a hit song, so he can officially be knighted as one of Atlanta’s next stars.\nFor Lil Gotit, the concept of an album is meaningless. Crazy But It’s True isn’t meant to be a cohesive body of work or made to be consumed in one sitting, it’s 18 darts thrown at the board and hopefully one hits the bullseye. Lil Gotit’s dire search for a hit first began when he dropped a few unenthused Triller videos on Instagram that seemed like an Alamo Records executive was behind the camera holding a match to his contract if he didn’t. Then, he tried to create a viral dance challenge, which of course didn’t work because the dance was overly complex.\nThe gimmicks were unnecessary Crazy But It’s True has more than enough potential to end Gotit’s tireless search for a hit, especially with “Da Real Hoodbabies.” Gotit’s music sounds best when his only cares in the world are letting us know about his love of Percocets and ignoring morals and fashion brands getting canceled to drape himself in a designer that most can’t afford: “Gucci ain’t racist, I still rock their clothes.”\nGotit isn’t as much of a crooner as Thug or Lil Keed, his voice is harsher. “Now” is Gotit at his most belligerent, taking a break from the fanciful flexing for lyrics that warn others not to test him in the streets of Atlanta: “I can get the Glock and squeeze it like a lemon, oh/I take his top and twist it red just like its Trippie, huh.” But similar to Lil Baby and Gunna, Gotit’s search for a hit song may end with pairing up with Lil Keed. Next to Keed’s high-pitched delivery, Gotit sounds menacing. And together they are able to successfully replicate the “Drip Too Hard” acoustic guitar formula on their second collaboration on the project, “Drop The Top.”\nThough a handful of the album’s tracks are duds, it’s to be expected when the project bets on them all becoming breakouts. There’s the generic collaboration with Hoodrich Pablo Juan called “Off White”—we get it, Virgil sends you free clothes—that could be mistaken for any Atlanta-based leak that’s surfaced on Spinrilla in the last year. Then there are songs that are bogged down with features like “We Da Gang” and “OverT” that take away from Lil Gotit’s moment.\nFor some rappers, albums are nothing more than a vehicle to push singles and videos premiered on WorldStarHipHop. Lil Gotit doesn’t care if a portion of his album winds up unessential filler, as long as fans gravitate to a chosen few—songs like “Da Real Hoodbabies” and “Now” are good enough to do that. Crazy But It’s True is Lil Gotit not waiting for fate to take its course, he wants to see if the Atlanta crown fits comfortably on his dome.\n", "pptitle": ["crazi", "true"]}