{"id": "PF_8", "url": "https://pitchfork.com/reviews/albums/karyyn-the-quanta-series/", "name": ["The", "Quanta", "Series"], "description": ["song", "debut", "album", "quanta", "seri", "k", "r", "y", "y", "n", "serv", "accompani", "choru", "coo", "echo", "mirror", "song", "compris", "voic", "reverb", "effect", "cascad", "foggi", "layer", "voic", "grow", "restless", "shudder", "like", "tecton", "plate", "collid", "moment", "stutter", "recit", "string", "one", "zero", "binari", "work", "voic", "solitari", "charact", "brace", "environ", "environ", "descend", "survivor", "armenian", "genocid", "syrian", "american", "produc", "vocalist", "weav", "legaci", "gener", "trauma", "music", "carri", "futurist", "sheen", "album", "earliest", "song", "written", "2011", "k", "r", "y", "y", "n", "mourn", "famili", "member", "die", "aleppo", "sing", "place", "root", "past", "acceler", "futur", "ambet", "gorav", "solemn", "rendit", "armenian", "folk", "song", "low", "electron", "drone", "funnel", "voic", "pixel", "machin", "effect", "dizzi", "k", "r", "y", "y", "n", "ask", "listen", "gaze", "vanish", "point", "opposit", "horizon", "song", "quanta", "seri", "releas", "previou", "year", "singl", "sequenc", "lp", "carri", "dramat", "weight", "k", "r", "y", "y", "ns", "cv", "includ", "score", "work", "game", "film", "compos", "music", "experiment", "opera", "light", "studi", "perform", "artist", "marina", "abramovish", "wellvers", "intricaci", "narr", "product", "confus", "aris", "stori", "start", "blur", "colleg", "student", "pioneer", "experiment", "electron", "musician", "paulin", "olivero", "chaotic", "influenc", "shiver", "quanta", "seri", "k", "r", "y", "y", "n", "begin", "stori", "unstitch", "send", "word", "tumbl", "ici", "electron", "product", "she", "fond", "pun", "doubl", "mean", "lyric", "swirl", "eye", "play", "polyval", "word", "tongu", "bodi", "languag", "produc", "tongu", "word", "want", "sing", "binari", "make", "simultan", "bid", "commun", "sensual", "semant", "break", "favor", "pure", "sound", "aleppo", "leap", "head", "voic", "punctuat", "line", "wobbl", "electron", "bass", "consol", "memori", "protect", "sing", "consol", "yourrecal", "enjamb", "strang", "languag", "impressionist", "word", "vessel", "voic", "way", "hole", "leav", "open", "album", "product", "rest", "paus", "space", "k", "r", "y", "y", "n", "hint", "histori", "ruin", "today", "saddest", "day", "sing", "today", "read", "life", "stori", "1111", "im", "miss", "timei", "stori", "wrote", "time", "bare", "sing", "whisper", "corrod", "voic", "effect", "make", "sound", "cri", "faulti", "phone", "line", "amid", "loss", "mourn", "late", "famili", "member", "lacuna", "histori", "k", "r", "y", "y", "n", "locat", "passag", "forward", "aliv", "carri", "famili", "stori", "segmen", "line", "melod", "continu", "life", "stori", "conclud", "album", "placid", "note", "resolut", "segmenti", "line", "sing", "your", "gonei", "breath", "death", "hang", "heavi", "record", "shadow", "k", "r", "y", "y", "n", "project", "futur", "upbeat", "percuss", "glitch", "spur", "segment", "amp", "line", "shove", "forward", "funer", "drone", "tether", "past", "doe", "close", "record", "allow", "grief", "horror", "dissip", "let", "linger", "quicken", "pace", "prove", "capabl", "carri", "weight"], "date_published": ["2019-03-30T05:00:00"], "sentiment": 0.028343253968253983, "content": "On many songs on her debut album The Quanta Series, K Á R Y Y N serves as her own accompaniment, her own chorus. Her coos echo on “Mirror Me,” a song comprising only her voice and a reverb effect, cascading in foggy layers. Elsewhere, her voice grows restless. It shudders like tectonic plates colliding  in the first moments of “Ever,” stutters as she recites strings of ones and zeroes on “Binary.” In her work, the voice is not a solitary character bracing against its environment. It is the environment.\nDescended from survivors of the Armenian genocide, the Syrian American producer and vocalist weaves the legacy of generational trauma into music that carries a futuristic sheen. The album's earliest songs were written in 2011 while K Á R Y Y N was mourning two family members who died in Aleppo.  She sings from a place rooted in the past, but always seems to be accelerating into the future: “Ambets Gorav,” is a solemn rendition of an Armenian folk song against a low electronic drone that funnels her voice into pixelating machines. The effect is dizzying, as if K Á R Y Y N were asking her listeners to gaze into vanishing points at opposite horizons.\nMany of the songs on The Quanta Series were released in previous years as singles. Sequenced into an LP, they carry more dramatic weight. K Á R Y Y N's CV includes score work for games and films, and she composed music for the experimental opera Of Light while studying under performance artist Marina Abramović—she’s well-versed in the intricacies of narrative and the productive confusion that can arise when a story starts to blur. In college, she was also a student of the pioneering experimental electronic musician Pauline Oliveros, whose chaotic influence shivers across The Quanta Series.\nK Á R Y Y N begins stories and then unstitches them, sending her words tumbling across icy electronic production. She's fond of puns and double meanings in her lyrics, swirling together “I” and “eye,” playing on the polyvalence of the word “tongue”: the body part and the language it produces. “Tongue is the word I want to have with you,” she sings on “Binary,” making a simultaneous bid for communication and sensuality. Often, her semantics break down in favor of pure sound. On “Aleppo,” she leaps up into her head voice, punctuating her lines with wobbling electronic bass. “I console your memory protect,” she sings, “I console your/Recall.” Her enjambment is strange, her language impressionistic. The words are vessels for her voice and not the other way around.\nIn the holes she leaves open throughout the album's production, the rests and pauses and empty spaces, K Á R Y Y N hints at a history of ruin. “Today is the saddest day for me,” she sings on “Today I Read Your Life Story 11:11.” “I’m missing you all the time/I have the stories you wrote one time.” She barely sings above a whisper and corrodes her voice with an effect that makes it sound as though she is crying out across a faulty phone line.\nAmid the loss she mourns, the late family members and the lacunae in their histories, K Á R Y Y N locates a passage forward. She is still alive to carry her family's story. “Segmen & the Line,” a melodic continuation of “Life Story,” concludes the album on a placid note of resolution. “You are the segment/I am the line,” she sings. “Now that you're gone/I can breathe again.” Death hangs heavy over the record, but in its shadow, K Á R Y Y N projects herself into the future. An upbeat percussive glitch spurs on “Segment &amp; the Line,” shoving her forward even as funereal drones tether her to the past. She does not close the record by allowing its grief and horror to dissipate. She lets them linger but quickens her pace, proving herself capable of carrying their weight.\n", "pptitle": ["quanta", "seri"]}