{"id": "PF_88", "url": "https://pitchfork.com/reviews/albums/roses-gabor-fantasy-and-facts/", "name": ["Fantasy", "&", "Facts"], "description": ["rose", "gabor", "dreamer", "freeflow", "like", "pisc", "sign", "artist", "wind", "career", "proof", "abil", "make", "wave", "variou", "space", "arriv", "new", "project", "singersongwrit", "known", "gift", "background", "vocalist", "featur", "guest", "act", "like", "gorillaz", "brasstrack", "sbtrkt", "2011", "song", "pharaoh", "2012", "took", "leap", "premier", "star", "independ", "dubheavi", "track", "year", "gabor", "work", "hard", "build", "otherworldli", "sound", "debut", "album", "fantasi", "fact", "gabor", "reemerg", "silveri", "melodi", "expand", "electron", "rhythm", "hold", "close", "sonic", "project", "live", "special", "ecosystem", "experiment", "rb", "gabor", "emot", "candor", "carri", "light", "2018", "share", "album", "singl", "illus", "featur", "sampha", "heartrush", "song", "singer", "yearn", "ghost", "past", "love", "11", "track", "fantasi", "fact", "gabor", "product", "thrill", "doesnt", "let", "overshadow", "what", "mind", "heart", "sincer", "isnt", "heavi", "refresh", "standout", "singl", "produc", "stereotyp", "work", "bruno", "mar", "24k", "magic", "gabor", "tell", "lover", "pride", "regret", "thing", "stop", "tomorrow", "come", "usbut", "wait", "fatey", "know", "onebut", "thing", "didnt", "way", "sing", "like", "type", "heartfelt", "honesti", "share", "treasur", "far", "away", "jade", "world", "gabor", "saccharin", "harmoni", "magnifi", "urgenc", "bold", "starryey", "feel", "sink", "deeper", "groov", "fck", "bass", "slow", "sensual", "cut", "galact", "chord", "gabor", "doesnt", "want", "limit", "specif", "sound", "song", "soul", "leav", "yearn", "sultri", "track", "like", "gabor", "walk", "line", "genr", "categor", "music", "simpli", "feel", "descript", "vagu", "fit", "industri", "classif", "tad", "linear", "art", "fantasi", "fact", "flow", "42minut", "mood", "stretch", "smoki", "tone", "compar", "keli", "bring", "full", "sad", "ador", "end", "fantasi", "fact", "lose", "bit", "momentum", "track", "solid", "highqual", "hard", "hypnot", "midalbum", "gem", "interlud", "awkward", "desir", "patter", "drum", "kick", "pair", "gabor", "antigrav", "lull", "creat", "brief", "outofbodi", "experi", "longer", "album", "univers", "feel", "right", "place"], "date_published": ["2019-03-06T06:00:00"], "sentiment": 0.11259175607001692, "content": "Roses Gabor is a dreamer. Free-flowing like her Pisces sign, the artist’s winding career is proof of her ability to make waves in various spaces. Before arriving with her new project, the singer-songwriter was known mostly as a gifted background vocalist and featured guest with acts like Gorillaz, Brasstracks, and SBTRKT on his 2011 song, “Pharaohs.” In 2012, she took a leap and premiered “Stars,” her first independent and dub-heavy track. Over the last six years, Gabor has been working hard on building her otherworldly sound. On her debut album Fantasy & Facts, Gabor has re-emerged with silvery melodies that expand on the electronic rhythms she holds close.\nSonically, the project lives within the special ecosystem of experimental R&B while Gabor’s emotional candor carries its own light. In 2018, she shared it on her first album single, “Illusions,”  featuring Sampha, which is a heart-rushing song where the two singers yearn the ghosts of a past love. Throughout all 11 tracks on Fantasy & Facts, Gabor’s production is thrilling, but she doesn’t let it overshadow what’s on her mind and heart.\nHer sincerity isn’t heavy, it’s refreshing. On the standout single, “I Could Be Yours,” produced by the Stereotypes (who also worked on Bruno Mars’ “24K Magic”), Gabor tells a lover that pride and regret is the only thing stopping them from being with her again. “Tomorrow might not come for us/But you still wait for fate/You know how I was the one/But things didn’t go your way,” she sings. It seems like the type of heartfelt honesty that can only be shared and treasured far away from a jaded world. Gabor’s saccharine harmonies magnify the urgency of her bold and starry-eyed feelings. She sinks into a deeper groove on “F*ck up the Bass,” which is a slow and sensual cut with galactic chords. Gabor doesn’t want to be limited to any specific sound, but the song’s soulfulness leaves a yearning for more sultry tracks like this.\nGabor walks the lines of many genres but categorizes her music simply as “feels.” The description is vague, but it’s more fitting than the industry classifications that are a tad too linear for her art. On Fantasy & Facts, she flows through 42-minutes of moods, stretching her smoky tone comparable to Kelis’ which brings fullness to her sadness and adoration. The end of Fantasy & Facts seems to lose a bit of momentum. The latter tracks are all solid and of high-quality, but it’s hard to top the hypnotizing mid-album gem “Interlude: Awkward Desire.” The pattering drum kicks paired with Gabor’s anti-gravity lulls create a brief out-of-body experience that could last longer. But the album is her universe and all of her feelings have a rightful place.\n", "pptitle": ["fantasi", "fact"]}