{"id": "PF_32", "url": "https://pitchfork.com/reviews/albums/prefab-sprout-i-trawl-the-megahertz/", "name": ["I", "Trawl", "the", "Megahertz"], "description": ["deterior", "inspir", "prefab", "sprout", "major", "work", "english", "pop", "group", "breakthrough", "singl", "shimmeri", "1984", "ballad", "love", "break", "weaken", "tie", "absenc", "make", "heart", "lose", "weight", "year", "later", "king", "rock", "roll", "pair", "whimsic", "fanfar", "superproduc", "thoma", "dolbi", "wither", "reflect", "onehit", "wonder", "come", "term", "obsolesc", "remain", "biggest", "hit", "nativ", "unit", "kingdom", "band", "rose", "minor", "fame", "80", "frontman", "paddi", "mcaloon", "reced", "spotlight", "ambival", "public", "imag", "health", "start", "fail", "interview", "he", "spoken", "struggl", "menier", "diseas", "tinnitu", "shingl", "eczema", "temporari", "blind", "stem", "retina", "detachmentan", "afflict", "commonli", "associ", "boxer", "anybodi", "who", "regularli", "repeatedli", "punch", "face", "surgeri", "success", "forc", "mcaloon", "forti", "new", "way", "job", "recoveri", "unabl", "sit", "upright", "lean", "forward", "spent", "time", "supin", "unabl", "read", "look", "screen", "turn", "audiobook", "radio", "broadcast", "inspir", "disjoint", "sentenc", "stuck", "headim", "49", "divorc", "daddi", "love", "just", "doesnt", "want", "live", "anymoreand", "start", "form", "loos", "narr", "soon", "began", "hear", "sad", "gorgeou", "melodi", "accompani", "flugelhorn", "clarinet", "cello", "fulli", "recov", "brought", "idea", "life", "22minut", "spoken", "word", "orchestr", "piec", "call", "trawl", "megahertz", "narrat", "american", "stockbrok", "name", "yvonn", "connor", "way", "paddi", "mcaloon", "oper", "artist", "beli", "logic", "follow", "chronolog", "career", "separ", "fact", "mytholog", "quickli", "imposs", "entir", "album", "scrap", "old", "song", "way", "new", "project", "stori", "good", "true", "releas", "trawl", "megahertz", "legend", "work", "unlik", "catalog", "deni", "strength", "feel", "autobiograph", "newli", "remast", "reissu", "prefab", "sprout", "albumit", "previous", "releas", "mcaloon", "solo", "lp", "2003", "larg", "ignor", "critic", "publicit", "stand", "peak", "strang", "brilliant", "career", "album", "consist", "movement", "titl", "track", "eightpart", "instrument", "accompani", "depict", "businessman", "escap", "forest", "featur", "mcaloon", "voic", "just", "track", "word", "import", "lost", "sing", "softli", "long", "abandon", "oblig", "associ", "career", "mcaloon", "soon", "did", "grow", "long", "silver", "beard", "did", "songwrit", "aspir", "craftsman", "heartonhissleev", "confessionalist", "word", "sound", "newli", "vulner", "person", "decis", "releas", "megahertz", "solo", "project", "artist", "commerci", "mcaloon", "worri", "fan", "respond", "sweep", "collect", "longform", "composit", "megahertz", "doesnt", "just", "stand", "apart", "mcaloon", "discographi", "pop", "music", "analog", "instead", "feel", "piec", "dreami", "ambiti", "film", "era", "like", "punchdrunk", "love", "etern", "sunshin", "spotless", "mind", "work", "music", "find", "power", "merg", "ordinarymed", "procedur", "traffic", "bureaucracywith", "extraordinari", "open", "word", "forecast", "hazi", "origin", "stori", "follow", "poetic", "reflect", "love", "trauma", "age", "chamber", "heart", "sit", "account", "connor", "narrat", "sound", "like", "close", "score", "kind", "cosmic", "western", "frown", "wave", "red", "paper", "orchestra", "swell", "narr", "loop", "disintegr", "point", "connor", "inton", "forgiv", "sleepwalk", "music", "dream", "mcaloon", "say", "chose", "connor", "recit", "word", "want", "make", "album", "escap", "led", "voic", "wholli", "distinct", "record", "connor", "vocal", "hotel", "room", "london", "feel", "materi", "attempt", "replic", "studio", "magic", "vanish", "end", "return", "initi", "tape", "edit", "air", "condition", "buzz", "word", "make", "mcaloon", "laborintens", "projectstr", "arrang", "horn", "chart", "recur", "motifsalso", "kind", "happi", "accid", "album", "aim", "reflect", "fragment", "mysteri", "way", "process", "memori", "megahertz", "forecast", "mcaloon", "evad", "nostalgia", "evolv", "21st", "centuri", "initi", "releas", "he", "albumson", "previous", "shelv", "collect", "heal", "power", "music", "contractu", "oblig", "set", "tradit", "sprout", "song", "health", "problem", "assur", "hell", "perform", "live", "public", "appear", "rare", "way", "megahertz", "lost", "mystic", "power", "point", "mcaloon", "remind", "real", "world", "lie", "fantasi", "pop", "song", "train", "late", "doctor", "break", "bad", "news", "connor", "sigh", "live", "lullabi", "trawl", "megahertz", "kind", "dream", "time", "slow", "world", "ahead", "magnific", "new"], "date_published": ["2019-03-23T05:00:00"], "sentiment": 0.13067404512459457, "content": "Deterioration inspires all of Prefab Sprout’s major works. The English pop group’s breakthrough single, the shimmery 1984 ballad “When Love Breaks Down,” was about weakening ties and how “absence makes the heart lose weight.” A few years later, with “The King of Rock and Roll,” they paired whimsical fanfare from super-producer Thomas Dolby with the withering reflections of a one-hit wonder coming to terms with his obsolescence. It remains their biggest hit in their native United Kingdom.\nAs the band rose to minor fame throughout the ’80s, frontman Paddy McAloon receded from the spotlight. He was always ambivalent about his public image, and now his health was starting to fail him as well. In interviews, he’s spoken about struggles with Meniere's disease, tinnitus, shingles, eczema, and temporary blindness stemming from retina detachment—an affliction most commonly associated with boxers, or anybody who’s been regularly, repeatedly punched in the face.\nThe surgery was successful, but it forced McAloon, then in his forties, to find new ways to do his job. In recovery, he was unable to sit upright or lean forward, and so he spent much of his time supine. Unable to read or look at screens, he turned to audiobooks and radio broadcasts for inspiration. Disjointed sentences stuck in his head—“I’m 49 and divorced,” “Your daddy loves you very much; he just doesn’t want to live with us anymore”—and they started forming a loose narrative. Soon, he began hearing a sad, gorgeous melody accompanying it: flugelhorns, clarinets, cellos. When he was fully recovered, he brought the idea to life as a 22-minute spoken word and orchestral piece called “I Trawl the Megahertz” narrated by an American stockbroker named Yvonne Connors.\nThe way Paddy McAloon operates as an artist belies logic. Following the chronology of his career and separating the facts from mythology quickly becomes impossible. Entire albums get scrapped; old songs find their way onto new projects; stories seem too good to be true. If he had never released I Trawl the Megahertz, it might have been one of these legends: a work unlike anything else in his catalog that denies all of his strengths yet feels almost autobiographical. Newly remastered and reissued as a Prefab Sprout album—it was previously released as a McAloon solo LP in 2003 and largely ignored by both critics and the public—it now stands as one of the peaks of his strange, brilliant career.\nThe album consists of two movements: the title track and an eight-part, mostly instrumental accompaniment that depicts a businessman escaping to the forest. It features McAloon’s voice in just one track, and his words are important. “I am lost,” he sings softly, longing to abandon the obligations associated with his career (which McAloon soon did) and grow a long, silver beard (which he also did). From a songwriter who always aspired to be a craftsman more than a heart-on-his-sleeve confessionalist, the words sound newly vulnerable. But as personal as it may seem, the decision to release Megahertz as a solo project was less artistic than commercial, as McAloon worried how fans might respond to this sweeping collection of long-form compositions.\nMegahertz doesn’t just stand apart in McAloon’s discography; it has few pop music analogs. Instead, it feels more of a piece with the dreamy, ambitious films from the era like Punch-Drunk Love and Eternal Sunshine of the Spotless Mind. As with those works, the music finds power in merging the ordinary—medical procedures, traffic, bureaucracy—with the extraordinary. Its opening words forecast a hazy origin story, followed by poetic reflections on love, trauma, and aging. “In a chamber of my heart sits an accountant,” Connors narrates, over what sounds like the closing score to some kind of cosmic Western. “He is frowning and waving red paper at me.”\nAs the orchestra swells, the narrative loops back and disintegrates. At one point, Connors intones, “Forgive me, I am sleepwalking,” and the music seems to dream along with her. McAloon says he chose Connors to recite his words because he wanted to make an album from which he could escape, led by a voice wholly distinct from his own. He recorded Connors’ vocals in a hotel room in London to get a feel for the material. When they attempted to replicate it in a studio, the magic had vanished. In the end, they returned to that initial tape, editing out the air conditioner buzz between words and making McAloon’s most labor-intensive project—string arrangements, horn charts, recurring motifs—also a kind of happy accident.\nAn album that aims to reflect the fragmented, mysterious way we process memory, Megahertz also forecasts how McAloon would evade nostalgia and evolve in the 21st century. Since its initial release, he’s only put out two albums—one, a previously shelved collection about the healing power of music, and another, a contractually obligated set of more traditional Sprout songs. His health problems have all but assured that he’ll never perform live again, and his public appearances have been rare. Along the way, Megahertz has lost none of its mystical power. At one point, McAloon reminds us of the real world that lies beyond our fantasies and pop songs. “Trains are late, doctors are breaking bad news,” Connors sighs. “But I am living in a lullaby.” I Trawl the Megahertz is its own kind of dream, where time slows down and the world ahead seems magnificent and new.\n", "pptitle": ["trawl", "megahertz"]}