{"id": "PF_40", "url": "https://pitchfork.com/reviews/albums/jonny-nash-make-a-wilderness/", "name": ["Make", "a", "Wilderness"], "description": ["world", "supposedli", "big", "place", "that", "travel", "guitar", "franoi", "baschet", "observ", "year", "follow", "world", "war", "ii", "eager", "circumnavig", "globe", "instrument", "french", "musician", "came", "solut", "inflat", "guitar", "balloon", "bodi", "foldabl", "wooden", "neck", "humbl", "invent", "origin", "baschet", "older", "brother", "bernard", "engin", "make", "life", "work", "sonor", "object", "blur", "line", "sculptur", "music", "instrument", "otherworldli", "sound", "gener", "baschet", "brother", "sound", "structur", "call", "deviceslik", "cristal", "baschet", "array", "glass", "rod", "play", "wet", "fingershav", "inspir", "musician", "tom", "wait", "jeanmichel", "jarr", "instrument", "form", "basi", "make", "wilder", "solo", "album", "year", "ambient", "musician", "jonni", "nash", "easi", "nash", "attract", "baschet", "brother", "object", "rich", "reson", "timbr", "suggest", "electron", "sound", "produc", "use", "nonelectron", "mean", "solo", "collabor", "suzann", "kraft", "member", "gaussian", "curv", "nash", "tend", "pursu", "ineff", "music", "earli", "ep", "phantom", "actor", "invok", "ambient", "forebearsjon", "hassel", "mark", "isham", "walli", "badarouin", "tone", "textur", "evoc", "tropic", "sunset", "ripe", "peach", "lover", "sigh", "music", "diffus", "edg", "synthes", "piano", "standup", "bass", "steadili", "soften", "worn", "away", "eros", "make", "wilder", "ether", "effort", "modest", "set", "instrument", "sketch", "feel", "cloak", "mysteri", "glassi", "timbr", "microton", "harmoni", "baschet", "brother", "object", "lend", "desertmirag", "air", "imposs", "discern", "song", "compos", "movement", "gentli", "haphazard", "clank", "wind", "chime", "studi", "still", "suggest", "winter", "breez", "whistl", "scrapyard", "creak", "murmur", "boat", "harbor", "night", "melodi", "speak", "album", "ephemer", "meander", "expens", "conson", "pleasur", "minut", "half", "shell", "rich", "reassur", "piano", "chord", "ring", "repeat", "cours", "piec", "regular", "beacon", "heavi", "fog", "nash", "minimalist", "tendenc", "suggest", "taken", "heart", "late", "mark", "holli", "advic", "play", "note", "learn", "play", "note", "dont", "play", "note", "unless", "youv", "got", "reason", "play", "nash", "touch", "distinguish", "patienc", "layer", "tone", "except", "finess", "take", "care", "wast", "singl", "sound", "note", "feel", "earn", "album", "fact", "draw", "inspir", "quietest", "secret", "corner", "holli", "group", "talk", "talk", "discographi", "that", "particularli", "true", "shell", "rumin", "piano", "languag", "collaps", "10minut", "centerpiec", "bside", "vibraphon", "paint", "broad", "stroke", "blurri", "backdrop", "flicker", "brass", "woodwind", "flash", "dark", "disappear", "just", "swiftli", "ephemer", "appear", "mark", "make", "wilder", "defin", "characterist", "gorgeou", "play", "imposs", "rememb", "needl", "hit", "runout", "groov", "transienc", "make", "nash", "mood", "music", "allur", "make", "wilder", "make", "good", "franoi", "baschet", "youth", "desir", "sound", "travel", "just", "portabl", "dissolv", "air"], "date_published": ["2019-03-19T05:00:00"], "sentiment": 0.10599390919158364, "content": "“The world is supposedly a big place, but that’s not so when you travel with a guitar,” François Baschet observed. In the years following World War II, eager to circumnavigate the globe with his instrument, the French musician came up with a solution: an inflatable guitar with a balloon for a body and a foldable wooden neck. That humble invention was the origin of what Baschet and his older brother, Bernard, an engineer, would make their life’s work: sonorous objects that blurred the line between sculpture and musical instrument. The otherworldly sounds generated by the Baschet brothers’ sound structures, as they called their devices—like the Cristal Baschet, an array of glass rods played with wet fingers—have inspired musicians from Tom Waits to Jean-Michel Jarre. Now, the instruments form the basis of Make a Wilderness, the first solo album in two years from the ambient musician Jonny Nash.\nIt’s easy to see why Nash would be attracted to the Baschet brothers’ objects, with their rich, resonant timbres, which suggest electronic sounds produced using non-electronic means. Whether solo, in collaboration with Suzanne Kraft, or as a member of Gaussian Curve, Nash tends to pursue the ineffable in his music. An early EP, Phantom Actors, invoked his ambient forebears—Jon Hassell, Mark Isham, Wally Badarou—in tones and textures evocative of tropical sunsets, ripe peaches, a lover’s sigh. His music has only become more diffuse from there, the edges between synthesizer, piano, and standup bass steadily softening, as though worn away by erosion.\nMake a Wilderness is his most ethereal effort yet: a modest set of instrumental sketches that feel cloaked in mystery. The glassy timbres and microtonal harmonies of the Baschet brothers’ objects lend to the desert-mirage air, though it’s impossible to discern how any of these songs were made, or even whether they were composed at all. Their movements are as gently haphazard as the clanking of wind chimes. Studies in stillness, they suggest a winter breeze whistling through a scrapyard, or the creak and murmur of a boat harbor at night.\nThere are no melodies to speak of, though the album’s ephemeral meanderings are not at the expense of more consonant pleasures. A minute and a half into “Shell,” a rich, reassuring piano chord rings out, and it is repeated throughout the course of the piece, regular as a beacon in heavy fog. Nash’s minimalist tendencies suggest that he has taken to heart the late Mark Hollis’ advice: “Before you play two notes, learn how to play one note. And don’t play one note unless you’ve got a reason to play it.” Nash’s touch is distinguished by its patience: He layers his tones with exceptional finesse, taking care not to waste a single sound. Each note feels earned.\nMuch of the album, in fact, draws its inspiration from the quietest, most secretive corners of Hollis’ and his group Talk Talk’s discographies. That’s particularly true of “Shell,” with its ruminative piano, and “Language Collapsed,” the 10-minute centerpiece of the B-side, where vibraphone paints broad strokes across a blurry backdrop in which flickers of brass and woodwinds flash out from the darkness and disappear just as swiftly. Those ephemeral appearances mark Make a Wilderness’ defining characteristic: Gorgeous while it plays, it’s almost impossible to remember once the needle has hit the run-out groove. But that transience only makes Nash’s mood music that much more alluring. Make a Wilderness makes good on François Baschet’s youthful desire to find a sound that travels well. It’s not just portable; it dissolves into thin air.\n", "pptitle": ["make", "wilder"]}