{"id": "PF_20", "url": "https://pitchfork.com/reviews/albums/fetnat-le-mal/", "name": ["Le", "Mal"], "description": ["exercis", "expos", "bodi", "machin", "lock", "limb", "control", "motion", "consciou", "direct", "mind", "fit", "album", "treadmil", "cover", "le", "mal", "bilingu", "psychojazz", "punkfunk", "quartet", "fetnat", "likewis", "mechanist", "process", "theyv", "essenti", "record", "materi", "le", "mal", "featur", "song", "perform", "band", "half", "dedic", "midi", "reinterpretationsor", "degradationsof", "structur", "bring", "mind", "neu", "notori", "second", "album", "have", "blown", "record", "budget", "kosmischerock", "pioneer", "pad", "spedup", "sloweddown", "version", "song", "earlier", "singl", "le", "mal", "midi", "manipul", "feel", "like", "ploy", "tracklist", "companion", "remix", "bizarr", "band", "splice", "reformul", "dna", "aggress", "strang", "fetnat", "hail", "small", "citi", "hull", "locat", "river", "ontario", "border", "ottawa", "canadian", "capit", "fittingli", "theyr", "band", "straddl", "music", "cultur", "divid", "atop", "group", "spasmod", "rhythm", "lead", "singer", "lyricist", "jfno", "deliv", "fragment", "singspeak", "hybrid", "franglai", "dialect", "hull", "greatest", "claim", "fame", "parti", "town", "latenight", "destin", "18yearold", "ottawan", "eager", "advantag", "quebec", "lower", "legal", "drink", "age", "fetnat", "music", "hardli", "stuff", "collegepub", "playlist", "jar", "sonic", "intrus", "trippedup", "time", "signatur", "know", "entertain", "exactli", "danc", "music", "certainli", "convuls", "enthusiast", "fetnat", "earlier", "releas", "built", "bedrock", "beefheartian", "skronk", "le", "mal", "ventur", "polyrhythm", "path", "2017", "gaoler", "ep", "crosswir", "cowbellclank", "dubfunk", "faction", "80", "postpunk", "konk", "pigbag", "23", "skidoo", "glitchi", "skitter", "cadenc", "90", "idm", "time", "like", "warp", "distend", "de", "foi", "jnfo", "mutat", "slowmot", "deliveri", "pierreluc", "clment", "slapbass", "spike", "olivi", "fairfield", "stutter", "beat", "linsey", "wellman", "saxophon", "fart", "pull", "song", "differ", "direct", "resili", "rubberi", "groov", "tapi", "testament", "fetnat", "abil", "maintain", "forward", "momentum", "wellman", "sax", "squiggl", "upset", "equilibrium", "patio", "monday", "relentlessli", "hiccup", "rhythm", "give", "way", "simplest", "pleasuresa", "giddi", "playground", "chant", "conjur", "imag", "schoolchildren", "play", "doubl", "dutch", "floor", "mudd", "club", "fetnat", "start", "feed", "music", "midi", "filter", "concess", "access", "swiftli", "break", "tapi", "jnfo", "suggest", "whisper", "vers", "hover", "unobtrus", "groov", "tapi", "dorient", "theyr", "omin", "foreground", "mix", "seinfeldworthi", "slapbass", "tri", "ward", "creep", "influx", "scifi", "synth", "oscil", "greatest", "disfigur", "reserv", "world", "mysteri", "gift", "fetnat", "contort", "freakazoid", "love", "song", "origin", "form", "sort", "electroshock", "serenad", "mightv", "sound", "home", "knife", "shake", "habitu", "sequel", "song", "mutant", "slow", "jam", "melt", "vat", "ambient", "acid", "disintegr", "chipmunksoul", "squeal", "bodi", "machin", "prone", "sudden", "deceler", "short", "circuit"], "date_published": ["2019-03-26T05:00:00"], "sentiment": 0.12304988662131522, "content": "Exercise exposes the body as a machine, locking limbs into controlled motions without the conscious direction of the mind. Fitting for an album with a treadmill on the cover, on Le Mal, the bilingual psycho-jazz punk-funk quartet FET.NAT likewise give themselves over to mechanistic processes. They’ve essentially made two records from the same material: Le Mal’s first side features five songs performed by the band, while its back half is dedicated to MIDI reinterpretations—or degradations—of four of them. The structure brings to mind Neu!’s notorious second album, where, having blown their recording budget, the kosmische-rock pioneers padded side two with sped-up and slowed-down versions of songs from an earlier single. But Le Mal’s MIDI manipulations never feel like a ploy to fill the tracklist, nor even companion remixes. Rather, they find this already bizarre band splicing and reformulating their DNA to become even more aggressively strange.\nFET.NAT hail from the small city of Hull, located across the river and the Ontario border from Ottawa, the Canadian capital. Fittingly, they’re a band that straddle musical and cultural divides: Atop the group’s spasmodic rhythms, lead singer and lyricist JFNO delivers his fragmented sing-speak in a hybrid franglais dialect. Hull’s greatest claim to fame, though, is that it’s a party town, a late-night destination for 18-year-old Ottawans eager to take advantage of Quebec’s lower legal drinking age. FET.NAT’s music is hardly the stuff of college-pub playlists, but for all their jarring sonic intrusions and tripped-up time signatures, they know how to entertain. If you can’t exactly dance to their music, you can certainly convulse enthusiastically.\nWhere FET.NAT’s earlier releases were built upon a bedrock of Beefheartian skronk, Le Mal ventures further down the polyrhythmic path of their 2017’s Gaoler EP, cross-wiring the cowbell-clanking, dub-funked faction of ’80s post-punk (Konk, Pigbag, 23 Skidoo) with the glitchy, skittering cadences of ’90s IDM. At times, like on the warped and distended “Des Fois,” JNFO’s mutating slow-motion delivery, Pierre-Luc Clément’s slap-bass spikes, Olivier Fairfield’s stuttering beats, and Linsey Wellman’s saxophone farts all seem to pull the song in different directions. But the resilient rubbery groove of “Tapis” is a testament to FET.NAT’s ability to maintain forward momentum even as Wellman’s sax squiggles upset their equilibrium. And on “Patio Monday,” a relentlessly hiccuping rhythm gives way to the simplest of pleasures—a giddy playground chant that conjures the image of schoolchildren playing double dutch on the floor of the Mudd Club.\nOnce FET.NAT start feeding their music through the MIDI filter, any concessions to accessibility swiftly break down. Where “Tapis” found JNFO’s suggestively whispered verses hovering unobtrusively below the groove, on “Tapis d’Orient,” they’re ominously foregrounded in the mix, while Seinfeld-worthy slap-bass tries to ward off a creeping influx of sci-fi synth oscillations. The greatest disfiguration is reserved for “Your World Is My Mystery Gift,” FET.NAT’s contorted freakazoid of a love song. In its original form, it’s the sort of electro-shocked serenade that might’ve sounded at home on the Knife’s Shaking the Habitual. In its side two sequel, the song becomes a mutant slow jam, melting in a vat of ambient acid and disintegrated chipmunk-soul squeals. If the body is a machine, this one is prone to sudden decelerations and short circuits.\n", "pptitle": ["le", "mal"]}