{"id": "PF_72", "url": "https://pitchfork.com/reviews/albums/la-dispute-panorama/", "name": ["Panorama"], "description": ["middl", "ground", "diehard", "fan", "la", "disput", "peopl", "decid", "second", "sound", "like", "fugazi", "do", "book", "tape", "past", "decad", "la", "disput", "peer", "new", "wave", "posthardcor", "just", "wave", "increasingli", "lean", "underli", "populist", "aspectstouch", "amor", "emerg", "populist", "firebrand", "earli", "screamo", "piano", "teeth", "burnish", "silveri", "moperock", "mewithouty", "folki", "mystic", "veer", "uncannili", "close", "rembut", "begin", "grand", "rapid", "quintet", "demand", "divis", "band", "fanat", "subgenr", "faith", "read", "grand", "rapid", "posthardcor", "band", "music", "prophet", "dazzl", "mere", "songcraftto", "treat", "like", "literatur", "music", "panorama", "come", "year", "la", "disput", "recent", "record", "have", "fulfil", "new", "wave", "rite", "passag", "produc", "yip", "complet", "sign", "epitaph", "panorama", "userfriendli", "releas", "ask", "engag", "like", "bookwith", "undivid", "attent", "expect", "immedi", "gratif", "linger", "footnot", "later", "discuss", "rumin", "like", "peer", "la", "disput", "determinedli", "whittl", "away", "extrem", "2008", "debut", "river", "vega", "altair", "remain", "uniqu", "hardcor", "album", "centuryjordan", "dreyer", "mumbl", "hector", "caterwaul", "anachronist", "lyric", "inform", "annabel", "lee", "joanna", "newsom", "kurt", "vonnegut", "japanes", "folklor", "band", "dabbl", "jazz", "screamo", "progrock", "spoken", "word", "wildli", "pretenti", "guileless", "rare", "document", "band", "expect", "preced", "uncheck", "ambit", "dreyer", "express", "guilt", "bombast", "earli", "fan", "favorit", "obscur", "distort", "intent", "listen", "gloss", "thought", "survey", "race", "retribut", "fiction", "eyewit", "account", "fail", "drivebi", "shoot", "2011", "king", "park", "just", "zone", "big", "crescendo", "approach", "2014", "room", "hous", "mute", "fabric", "breakup", "album", "fairli", "tradit", "moment", "emot", "releas", "panorama", "skill", "subtli", "creep", "reson", "catharsi", "approach", "make", "colleagu", "sound", "like", "theyr", "tri", "cheat", "big", "releas", "la", "disput", "rock", "like", "theyr", "tri", "tipto", "frozen", "pond", "anxieti", "panorama", "view", "bedroom", "window", "plaintiv", "whip", "circl", "pit", "guitar", "nearli", "silent", "frostbitten", "northern", "michigan", "seep", "silenc", "like", "car", "exhaust", "close", "garag", "choru", "footstep", "pond", "find", "dreyer", "vocal", "drown", "guitar", "midrang", "time", "lyric", "obscur", "buri", "mixa", "curiou", "decis", "band", "reli", "heavili", "dreyer", "word", "reward", "evok", "halfrememb", "car", "convers", "murmur", "dream", "state", "panick", "awaken", "panorama", "find", "dreyer", "rumin", "rel", "tragedyfre", "31", "year", "life", "ask", "provid", "support", "who", "experienc", "far", "wors", "half", "need", "beg", "fulton", "street", "guidanc", "dreyer", "move", "forward", "good", "intent", "crippl", "fear", "make", "matter", "wors", "pictur", "fridgei", "rabbit", "toy", "kidsyou", "gave", "strength", "fix", "myselfi", "gave", "token", "toy", "gift", "dreyer", "offer", "rhodonit", "grief", "slinki", "diminish", "jazz", "chord", "mourn", "horn", "possibl", "sequel", "room", "hous", "woman", "mirrorit", "album", "death", "grief", "inabl", "commun", "said", "kill", "surpris", "againi", "dont", "want", "stay", "aliveto", "watch", "word", "like", "dreyer", "moan", "write", "perspect", "reallif", "partner", "choos", "way", "leavefil", "circl", "ballot", "sheetvot", "way", "gowhat", "dreyer", "ask", "lengthi", "aweinspir", "closer", "ascend", "cycl", "heavenli", "humdrum", "way", "die", "realiz", "crush", "truth", "someon", "go", "solut", "avoid", "grief", "pass", "live", "possibl", "end", "live", "forev", "buri", "best", "memori", "ask", "think", "drunken", "good", "time", "intim", "road", "trip", "make", "life", "beauti", "sweet", "despit", "end", "panorama", "love", "storyy", "just", "need", "read", "line"], "date_published": ["2019-03-15T05:00:00"], "sentiment": 0.12898601398601398, "content": "There is no middle ground between diehard fans of La Dispute and people who decide after five seconds it sounds like Fugazi doing books on tape. Over the past decade, La Dispute’s peers in the New Wave of Post-Hardcore (or just “The Wave”) have increasingly leaned into their underlying populist aspects—Touche Amore emerged as populist firebrands, the early screamo of Pianos Become the Teeth has burnished into silvery mope-rock, mewithoutYou’s folky mysticism has veered uncannily close to R.E.M.—but from the beginning, the Grand Rapids quintet have been the most demanding and divisive band in a fanatical subgenre. Their faithful read the Grand Rapids post-hardcore band’s music as prophetic, dazzling, beyond mere songcraft—to be treated like literature rather than music.\nPanorama comes five years after La Dispute’s most recent record. Having already fulfilled one New Wave rite of passage (being produced by Will Yip), they complete another by signing to Epitaph. But while Panorama is their most user-friendly release, it’s the one that asks most of all to be engaged with like a book—with undivided attention and without any expectation of immediate gratification, to linger on and to be footnoted for later discussion and rumination.\nLike their peers, La Dispute have determinedly whittled away at their extremities. Their 2008 debut Somewhere At the Bottom of the River Between Vega and Altair remains one of the most unique hardcore albums of the century—Jordan Dreyer mumbled, hectored and caterwauled anachronistic lyrics informed by Annabel Lee, Joanna Newsom, Kurt Vonnegut, and Japanese folklore, while the band dabbled in jazz, screamo, prog-rock and spoken word. Both wildly pretentious and guileless, it’s a rare document of a band with no expectations, no precedents, and unchecked ambition. Dreyer has expressed guilt over how the bombast of early fan favorites could obscure and distort their intentions; listeners could gloss over the thoughtful survey of race and retribution in his fictionalized eyewitness account of a failed drive-by shooting 2011’s “King Park” and just zone out during the big crescendo. Their approach on 2014’s Rooms of the House was more muted, but even a fabricated breakup album still has fairly traditional moments of emotional release.\nPanorama skillfully and subtly creeps towards resonance rather than catharsis, an approach that can make even their own colleagues sound like they’re trying to cheat towards the big release. Even when La Dispute rock, they do so like they’re trying to tiptoe on a frozen pond. “Anxiety Panorama” and “View From Our Bedroom Window” are too plaintive to whip up a circle pit. The guitars are nearly silent throughout the frostbitten “In Northern Michigan,” until they seep through the silence like car exhaust in a closed garage. The chorus of “Footsteps at the Pond” finds Dreyer’s vocals drowning in guitar midrange, one of the many times where his lyrics become obscured or buried in the mix—a curious decision for a band who relies so heavily on Dreyer’s words, but a rewarding one, evoking half-remembered car conversations, murmured dream states, panicked awakenings.\nPanorama finds Dreyer ruminating on the relatively tragedy-free 31 years of his life and asking how he can provide support to someone who’s experienced far worse. “Could I even be half of what you need?” he begs on “Fulton Street I.” Without guidance, Dreyer moves forward with good intentions and a crippling fear of making matters worse. “We keep her picture on the fridge/I keep a rabbit toy for kids/You gave me strength to fix myself/I gave you tokens, toys and gifts,” Dreyer offers on “Rhodonite and Grief.”  With its slinky, diminished jazz chords and mournful horns, it’s a possible sequel to Rooms of the House’s “Woman (in mirror)”—it’s an album about death and grief, but also about the inability to communicate.\n“You said ‘kill me by surprise’ again/‘I don’t want to stay alive’/To watch the words go first like hers,” Dreyer moans, writing from the perspective of his real-life partner. “If we could choose the way we leave/Fill out circles on a ballot sheet/Vote the way we’ll go...What would we do?,” Dreyer asks on the lengthy, awe-inspiring closer “You Ascendant,” cycling through heavenly and humdrum ways to die before realizing the crushing truth that someone’s going to have to go first.  Perhaps the only solution to avoiding this grief is passing together, or at least, living in the possibility that it might not have to end at all. “Or can we live forever here? Be buried in our best memories,” he asks, thinking over drunken good times, an intimate road trip, everything that makes “life too beautiful, too sweet, despite everything.” In the end, Panorama is a love story—you just need to read between the lines.\n", "pptitle": ["panorama"]}