{"id": "PF_84", "url": "https://pitchfork.com/reviews/albums/stella-donnelly-beware-of-the-dogs/", "name": ["Beware", "of", "the", "Dogs"], "description": ["stella", "donnelli", "arriv", "american", "shore", "messag", "cut", "noisi", "indierock", "landscap", "perthbas", "songwrit", "debut", "boy", "boy", "command", "song", "rape", "cultur", "land", "fall", "2017", "just", "metoo", "crescendo", "moment", "donnelli", "indict", "victimblam", "echo", "sentiment", "thousand", "women", "call", "publicli", "excav", "trauma", "singl", "introduc", "25yearold", "donnellywho", "follow", "ep", "thrush", "metal", "reissu", "year", "homea", "artist", "captiv", "voic", "power", "messag", "boy", "boy", "feel", "vital", "affect", "today", "came", "divulg", "just", "fraction", "make", "donnelli", "songwrit", "special", "bewar", "dog", "fulllength", "robust", "pictur", "emerg", "song", "complex", "surpris", "sharp", "corner", "pois", "bruis", "unsuspect", "limb", "trade", "humor", "gravita", "pull", "taut", "genuin", "pain", "snap", "wellplac", "punch", "line", "open", "old", "man", "donnelli", "inveigh", "abus", "set", "tone", "record", "weighti", "subject", "matter", "grate", "chipper", "guitar", "tone", "donnelli", "breezi", "deliveri", "song", "vivid", "line", "person", "trait", "dont", "count", "dick", "someon", "face", "go", "laugh", "cring", "sound", "like", "crass", "joke", "lay", "grim", "realiti", "sort", "ironi", "crux", "donnelli", "songwrit", "insert", "consist", "point", "view", "album", "song", "rang", "consider", "scope", "time", "contract", "singer", "idl", "thought", "expand", "bigger", "sociopolit", "topic", "donnelli", "love", "element", "surpris", "she", "built", "right", "track", "list", "write", "song", "demolish", "expect", "set", "titleslik", "die", "upbeat", "crumbl", "relationship", "liken", "partner", "inconsist", "errant", "drive", "end", "donnelli", "gleefulli", "chant", "dont", "wanna", "die", "pictur", "dropandrol", "ladi", "birdstyl", "passeng", "seat", "watch", "telli", "hand", "isnt", "titular", "activ", "jitteri", "synth", "number", "address", "men", "rob", "women", "corpor", "agenc", "tape", "dollar", "sign", "bodiesand", "tell", "skin", "way", "donnelli", "wield", "humor", "uplift", "empow", "listen", "leviti", "tough", "situat", "deepli", "unnerv", "devoid", "context", "line", "like", "mower", "morningi", "let", "resta", "legitim", "threat", "couch", "languag", "befit", "suburban", "dadsi", "hoot", "heard", "donnelli", "sing", "boy", "boy", "giggl", "squirm", "seat", "furiou", "have", "laugh", "aloud", "song", "rape", "just", "pointdiscomfort", "appropri", "sensat", "experi", "listen", "song", "way", "bewar", "dog", "feel", "like", "rel", "recent", "work", "donnelli", "countrywoman", "courtney", "barnett", "writer", "wander", "mundan", "moment", "showcas", "wit", "punkish", "attitud", "song", "known", "turn", "dime", "donnelli", "tool", "kit", "barnett", "lacksan", "impress", "dexter", "voic", "put", "work", "servic", "album", "winsom", "moment", "coax", "love", "vibrato", "allergi", "forlorn", "breakup", "tune", "unfold", "delic", "solo", "guitar", "yelp", "teas", "like", "doe", "trick", "cheer", "caricatur", "moron", "australian", "men", "donnelli", "got", "start", "cover", "band", "sing", "acdc", "aretha", "drunk", "pharmaceut", "rep", "lewd", "behavior", "incident", "inspir", "trick", "convent", "explain", "versatil", "rang", "that", "say", "donnelli", "imitatorwhat", "accomplish", "13", "track", "distinct", "fierc", "donnelli", "write", "empathet", "core", "concern", "vulner", "bodi", "surfac", "repeatedli", "sing", "friend", "suffer", "abus", "women", "feel", "pinch", "objectif", "album", "titl", "track", "countri", "nation", "popul", "injustic", "endur", "song", "dont", "contain", "promis", "resolutionhow", "reallybut", "offer", "solidar", "humor", "grace", "rampant", "unpredict", "perfectli", "human", "like", "way", "tell", "tale", "donnelli", "sing", "companion", "track", "kill", "listen", "bewar", "dog", "show", "singular", "talent", "arena"], "date_published": ["2019-03-11T05:00:00"], "sentiment": 0.1264623750734862, "content": "Stella Donnelly arrived on American shores with a message that cut through a noisy indie-rock landscape. In the U.S., the Perth-based songwriter’s debut was “Boys Will Be Boys,” a commanding song about rape culture that landed in the fall of 2017, just as #MeToo crescendoed. In that moment, Donnelly’s indictment of victim-blamers echoed the sentiment of the thousands of women called upon to publicly excavate their trauma. The single introduced then 25-year-old Donnelly—who already had a following and an EP (Thrush Metal, reissued in the U.S. last year) back at home—as an artist with a captivating voice and a powerful message.\n“Boys Will Be Boys” feels as vital and affecting today as when it first came out, but it divulges just a fraction of what makes Donnelly’s songwriting so special. On Beware of the Dogs, her first full-length, a more robust picture emerges. Her songs are complex and surprising, full of sharp corners poised to bruise unsuspecting limbs. Trading in humor as well as gravitas, they are often pulled taut with genuine pain and then snapped with a well-placed punch line. Opener “Old Man,” where Donnelly inveighs against abusers, sets the tone for the record. Its weighty subject matter grates against the chipper guitar tone and Donnelly’s breezy delivery of the song’s most vivid line: “Your personality traits don’t count if you put your dick in someone’s face.” Is she going for a laugh, or a cringe, or both? It sounds like a crass joke, even as it lays out a grim reality.\nThis sort of irony is the crux of Donnelly’s songwriting. It inserts a consistent point of view across an album whose songs range considerably in scope, at times contracting around the singer’s idle thoughts, at others expanding to bigger sociopolitical topics. Donnelly loves the element of surprise so much she’s built it right into the track list, writing songs that demolish the expectations set by their titles—like “Die,” an upbeat take on a crumbling relationship that likens a partner’s inconsistency to errant driving, and ends with Donnelly gleefully chanting, “I don’t wanna die!” You can picture her drop-and-rolling, Lady Bird-style, from the passenger seat. “Watching Telly,” on the other hand, isn’t at all about the titular activity; it’s a jittery synth number addressing men who rob women of corporeal agency (“They tape dollar signs to our bodies/And tell us not to show our skin”).\nThe way Donnelly wields her humor can be uplifting, empowering listeners to find the levity in tough situations. It can also be deeply unnerving. Devoid of context, the line “Like a mower in the morning/I will never let you rest”—a legitimate threat couched in language befitting suburban dads—is a hoot. When I first heard Donnelly sing it on “Boys Will Be Boys,” I giggled, then squirmed in my seat, furious at myself for having laughed aloud at a song about rape. Then again, that may just be the point—discomfort is perhaps the most appropriate sensation to experience while listening to this song.\nIn some ways, Beware of the Dogs feels like a relative of recent work by Donnelly’s countrywoman Courtney Barnett. Both writers wander between the mundane and the momentous; they showcase their wit and punkish attitudes in songs known to turn on a dime. Donnelly has one tool in her kit which Barnett lacks—an impressively dexterous voice, which she puts to work in service of some of her album’s most winsome moments. She can coax out a lovely vibrato, as on “Allergies,” a forlorn breakup tune that unfolds over delicate solo guitar; she can yelp and tease like she does on “Tricks,” a cheerful caricature of moronic Australian men. Donnelly got her start in cover bands, singing AC/DC and Aretha to drunk pharmaceutical reps (whose lewd behavior, incidentally, inspired “Tricks”) at conventions, which explains her versatility and range. That’s not to say that Donnelly’s an imitator—what she accomplishes with these 13 tracks is distinctive.\nFierce as Donnelly’s writing can be, it’s empathetic to the core. Her concern for vulnerable bodies surfaces repeatedly; she sings for friends who have suffered abuse, for women who feel the pinch of objectification, and, on the album’s title track, for her country’s First Nations population and the injustices they have endured. These songs don’t contain much promise of resolution—how could they, really—but they offer solidarity and, in their humor, grace, and rampant unpredictability, are perfectly human. “I like the way that you tell all your tales,” Donnelly sings to her companion on one track; “Would it kill you to listen for once?” With Beware of the Dogs, she shows off a singular talent in both arenas.\n", "pptitle": ["bewar", "dog"]}