{"id": "PF_76", "url": "https://pitchfork.com/reviews/albums/machina-archipelago/", "name": ["archipelago"], "description": ["true", "artist", "freedom", "rariti", "yeohe", "kim", "know", "invers", "korean", "artist", "nab", "viral", "attent", "2010", "thank", "pair", "youtub", "video", "upload", "appl", "girl", "cover", "beyonc", "irreplac", "ladi", "gaga", "poker", "face", "use", "iphon", "app", "instrument", "techiebait", "twee", "springboard", "kim", "career", "kpop", "industri", "known", "dazzl", "genrebend", "song", "particularli", "celebr", "yield", "creativ", "control", "perform", "she", "said", "deal", "demand", "prove", "problemat", "earli", "pop", "day", "thought", "peopl", "thought", "kim", "told", "harvard", "whrb", "radio", "station", "2018", "thing", "thing", "start", "say", "kim", "just", "decamp", "tokyo", "adopt", "artist", "machna", "go", "independ", "gradual", "shift", "bounci", "sound", "earli", "year", "electron", "palett", "give", "music", "newfound", "sens", "uneas", "she", "come", "long", "way", "quirki", "youtub", "upload", "perform", "partial", "improvis", "set", "appear", "alongsid", "wonki", "experiment", "produc", "foodman", "archipelago", "fulli", "realiz", "work", "date", "smartphon", "smooth", "pop", "day", "replac", "pivot", "song", "use", "modular", "synthes", "foundat", "unafraid", "sort", "direct", "earlier", "machna", "releas", "retain", "pop", "ident", "electron", "element", "mere", "rippl", "edg", "new", "analog", "focu", "defin", "archipelago", "touch", "nudg", "music", "pomplamooseian", "twist", "new", "form", "ad", "tension", "open", "moog", "monk", "modul", "set", "tone", "what", "come", "mutat", "synth", "squiggl", "wrap", "lockedin", "beat", "ether", "vocal", "sampl", "whizz", "up", "woozi", "feel", "way", "clamber", "ahead", "pull", "kim", "said", "fond", "modular", "synth", "deriv", "partial", "captur", "feel", "specif", "moment", "archipelago", "best", "stretch", "sound", "like", "theyv", "improvis", "spot", "315", "heda", "begin", "kind", "chilli", "minim", "techno", "climax", "burst", "synth", "melodi", "spray", "beat", "ultim", "wriggl", "sparser", "terrain", "pursu", "similarli", "morph", "approach", "busi", "track", "like", "fizzi", "reboot", "skelet", "one", "like", "creep", "dont", "love", "time", "machna", "misfir", "let", "passag", "burbl", "long", "sort", "payoff", "inujima", "echo", "build", "soft", "slightli", "soft", "just", "settl", "durat", "song", "kim", "sing", "rel", "restrain", "archipelago", "captiv", "adopt", "invent", "techniqu", "place", "emphasi", "squar", "vocal", "kpop", "day", "continu", "center", "initi", "machna", "releas", "she", "balanc", "blend", "synthes", "churn", "soar", "pasta", "song", "say", "loneli", "trip", "pari", "flesh", "field", "record", "citysh", "complement", "song", "industri", "chug", "pitchshift", "vocal", "lend", "pervad", "sens", "alien", "kim", "frequent", "manipul", "voic", "like", "tactic", "up", "headrush", "busi", "cut", "xxxpatchwork", "she", "happi", "present", "unadulter", "murasaki", "higherpitch", "sing", "break", "layer", "synth", "great", "dramat", "effect", "machna", "element", "coalesc", "neon", "highlight", "album", "set", "uneasi", "music", "backdrop", "scratchi", "blast", "white", "nois", "tumbl", "polyrhythm", "sing", "begin", "simpli", "grow", "distort", "throw", "strang", "glow", "final", "shoot", "regist", "deliv", "archipelago", "finest", "intens", "momentproof", "posit", "kim", "truli", "voic"], "date_published": ["2019-03-09T06:00:00"], "sentiment": 0.12940476190476188, "content": "True artistic freedom is a rarity, but Yeohee Kim knows its inverse all too well. The Korean artist nabbed viral attention in 2010 thanks to a pair of YouTube videos she uploaded under the name Apple Girl, covering Beyoncé’s “Irreplaceable” and Lady Gaga’s “Poker Face” using only iPhone apps as instruments. This techie-baiting twee springboarded Kim to a career in K-pop, an industry known for its dazzling and genre-bending songs but not particularly celebrated for yielding creative control to performers. She’s said that dealing with the demands of others proved problematic for her early pop days. “I always thought about what people thought about me,” Kim told Harvard’s WHRB radio station in 2018. “I had to find this thing that I could not give up, I had to find the thing that I had to do before I could start saying ‘no.’”\nKim found just that by decamping to Tokyo, adopting the artist name machìna, and going independent. She also gradually shifted from the bouncy sound of her early years to an electronic palette that gives her music a newfound sense of unease. She’s come a long way from quirky YouTube uploads. She now performs partially improvised sets and has appeared alongside the wonky experimental producer Foodman. archipelago is her most fully realized work to date. The smartphone smoothness of her pop days has been replaced by a pivot to songs that use modular synthesizer as their foundation and are unafraid to move in all sorts of directions.\nEarlier machìna releases retained their pop identity, with electronic elements merely rippling along the edges. Her new analog focus defines archipelago; the touches that once nudged her music towards the Pomplamoose-ian are twisted into new forms, adding tension throughout. Opener “moog, monk, modules” sets the tone for what’s to come, with mutating synth squiggles wrapping around a locked-in beat while ethereal vocal samples whizz by, upping the wooziness. Something feels off about the way it clambers ahead, but it still pulls you in.\nKim has said her fondness for modular synths derives partially from how they capture the feeling of a specific moment, and archipelago’s best stretches sound like they’ve been improvised on the spot. “315 Heda” begins as a kind of chilly minimal techno, climaxes with bursts of synth melodies spraying over the beat, and ultimately wriggles back to sparser terrain. She pursues a similarly morphing approach on both busy tracks, like the fizzy “Reboot,” and more skeletal ones, like the creeping “I Don’t Love You.” The few times machìna misfires are when she lets passages burble for too long without any sort of payoff: “Inujima Echo” builds from soft to slightly less soft, and then just settles for its duration.\nThat song is one of the few where Kim’s singing is relatively restrained; archipelago is more captivating when she adopts more inventive techniques. After placing the emphasis squarely on her vocals in her K-pop days, and continuing to put them front and center on initial machìna releases, she’s found a balance between blending in with her synthesized churn and soaring above it.\nIn “Past”—a song, she says, about the loneliness of a trip to Paris, fleshed out with field recordings from the city—she complements the song’s industrial chug by pitch-shifting her vocals, lending to a pervading sense of alienation. Kim frequently manipulates her voice like this, a tactic that only ups the headrush of busy cuts such as “XXX_patchwork,” though she’s also happy to present it unadulterated: On “Murasaki,” her higher-pitched singing breaks through thick layers of synth, to great dramatic effect.\nAll of machìna’s elements coalesce on “Neon,” a highlight of the album. She sets an uneasy musical backdrop with scratchy blasts of white noise and tumbling polyrhythms; her own singing begins simply, then grows distorted, throwing off a strange glow. Finally, she shoots up a register to deliver archipelago’s finest and most intense moment—proof positive that Kim has truly found her own voice.\n", "pptitle": ["archipelago"]}