{"id": "PF_24", "url": "https://pitchfork.com/reviews/albums/mary-lattimore-mac-mccaughan-new-rain-duets/", "name": ["New", "Rain", "Duets"], "description": ["mac", "mccaughan", "ambient", "album", "sound", "unthink", "base", "restiv", "pop", "punk", "indi", "icon", "superchunk", "long", "like", "tri", "tell", "paul", "bank", "interpol", "hiphop", "projoh", "shit", "actual", "happen", "mccaughan", "excurs", "popambi", "classier", "compel", "affair", "bank", "basement", "beat", "follow", "dauntless", "guid", "experiment", "harpist", "mari", "lattimor", "electroacoust", "wilder", "lattimor", "live", "lo", "angel", "compos", "improvis", "concert", "grand", "loop", "delay", "captur", "spellbind", "album", "like", "hundr", "day", "ghost", "forest", "meg", "baird", "lattimor", "deep", "connect", "mccaughan", "home", "base", "north", "carolina", "rais", "state", "western", "mountain", "work", "mccaughan", "label", "merg", "record", "nineti", "nc", "label", "lobe", "record", "previous", "releas", "live", "lattimor", "record", "raleigh", "put", "mistshroud", "harpandelectron", "record", "doe", "stint", "promis", "rain", "new", "rain", "duet", "structur", "improvis", "record", "live", "mccoll", "center", "charlott", "nc", "2017", "polish", "varieti", "easili", "pass", "studio", "work", "lengthi", "movement", "music", "cours", "rippl", "like", "rain", "sheet", "windowpan", "circuit", "purpos", "track", "meander", "space", "rock", "ambient", "pastor", "electrobaroqu", "mode", "lattimor", "scout", "trail", "find", "long", "thought", "rout", "harmon", "landscap", "exploit", "instrument", "broad", "express", "capac", "glimmer", "hum", "fullbodi", "sweep", "mccaughan", "follow", "alertli", "exploit", "voic", "vintag", "repro", "analog", "synth", "ad", "textur", "shade", "harp", "draw", "scatter", "harmon", "materi", "catchi", "melod", "scrap", "remind", "he", "pop", "musician", "atmospher", "track", "second", "shift", "modern", "classic", "center", "uncertain", "harp", "theme", "develop", "mccaughan", "gust", "low", "faintli", "jazzi", "harmoni", "movement", "descend", "tens", "quiet", "darkambi", "realm", "synth", "tone", "curl", "like", "scrape", "metal", "animalist", "nois", "whisper", "dark", "harp", "note", "drop", "ring", "like", "silver", "pin", "movement", "psychrock", "interlud", "inflat", "epic", "proport", "home", "territori", "lattimor", "new", "ground", "mccaughan", "prior", "excurs", "poprock", "punk", "easier", "account", "got", "littl", "weird", "rememb", "portastat", "cool", "indi", "rocker", "sort", "elev", "music", "add", "element", "surpris", "familiar", "electroacoust", "pleasur", "new", "rain", "duet", "interest", "cultur", "frame", "hear", "wise", "mccaughan", "doesnt", "sing", "he", "bad", "singer", "vocal", "timbr", "leastambi", "sound", "imaginableand", "import", "he", "intent", "listen"], "date_published": ["2019-03-28T05:00:00"], "sentiment": 0.08721473999251778, "content": "Mac McCaughan has made an ambient album. It sounds unthinkable based on the restive pop and punk the indie icon has made with Superchunk for so long. It’s like someone tried to tell you Paul Banks from Interpol had a hip-hop side proj—oh, shit. That actually happened. But McCaughan’s excursion into pop-ambient is a much classier, more compelling affair than Banks’ basement beats, as he follows a dauntless guide, the experimental harpist Mary Lattimore, off into the electro-acoustic wilderness.\nLattimore, who lives in Los Angeles, composes and improvises on a concert grand with loops and delays, as captured on spellbinding albums like Hundreds of Days and Ghost Forests with Meg Baird. Lattimore has deep connections to McCaughan’s home base, North Carolina: raised in the state’s western mountains, she worked at McCaughan’s label, Merge Records, in the nineties. Now, N.C. label Three Lobed Recordings, which previously released a live Lattimore recording from Raleigh, is putting out their mist-shrouded harp-and-electronics record, which does not stint on the promised rain.\nNew Rain Duets is a structured improvisation recorded live at the McColl Center in Charlotte, N.C., in 2017, though its polish and variety could easily pass as studio work. In four lengthy movements, the music courses and ripples like rain sheeting down a windowpane. Circuitous but purposeful, the first track meanders through space rock, ambient pastoral, and electro-baroque modes. Lattimore scouts the trail, finding long, thoughtful routes through both the harmonic landscape and exploiting her instrument’s broad expressive capacity, from glimmering hums to full-bodied sweeps. McCaughan follows alertly, exploiting the many voices of his vintage and repro analog synths, adding textures and shading to the harp and sometimes drawing the scattered harmonic material together in catchy melodic scraps that remind us he’s a pop musician.\nAfter the atmospheric first track, the second shifts toward modern classical, centering on an uncertain harp theme that develops as McCaughan gusts in low, faintly jazzy harmonies. The third movement descends into a tense, quiet dark-ambient realm: as synth tones curl up like scraped metal and animalistic noises whisper from the darkness, harp notes drop and ring like silver pins. And in the last movement, a psych-rock interlude inflates to epic proportions.\nThis is all home territory for Lattimore, but it’s new ground for McCaughan, whose prior excursions beyond pop-rock and punk have been easier to account for than this, even when they got a little weird. (Remember Portastatic, from when all the cool indie rockers were sort of into elevator music?) This adds an element of surprise to the familiar electro-acoustic pleasures of New Rain Duets, an interesting cultural frame through which to hear it. It’s wise that McCaughan doesn’t sing on it, not because he’s a bad singer, but because his vocal timbre might be the least-ambient sound imaginable—and, most important, because he’s too intent on listening.\n", "pptitle": ["new", "rain", "duet"]}