{"id": "PF_60", "url": "https://pitchfork.com/reviews/albums/koffee-rapture-ep/", "name": ["Rapture", "EP"], "description": ["open", "strain", "ultrainfecti", "toast", "singl", "jamaican", "teenag", "upstart", "mikayla", "koffe", "simpson", "demand", "repeat", "perfect", "tune", "lick", "backto", "pull", "rewind", "starta", "practic", "mobil", "discothequ", "soundsystem", "island", "build", "anticip", "beat", "drop", "koffe", "initi", "drew", "attent", "acoust", "tribut", "usain", "bolt", "crisp", "deliveri", "move", "forth", "rapidfir", "ragga", "grit", "drop", "consciou", "regga", "style", "refer", "portmanteau", "singjay", "combin", "singer", "deejay", "jamaican", "term", "mc", "there", "great", "deal", "talk", "upandcom", "women", "jamaican", "musicshenseea", "hoodcelebrityy", "couplebut", "fivesong", "ep", "indic", "koffe", "like", "singjay", "mark", "late", "1990", "earli", "2000", "sizzla", "capleton", "buju", "banton", "navig", "dancehal", "regga", "eas", "product", "ep", "reflect", "multipl", "genr", "travel", "jamaica", "toast", "call", "nearnaija", "stylingand", "surpris", "given", "walshi", "involv", "member", "major", "lazer", "outfit", "known", "constant", "controversi", "intern", "search", "rhythm", "walshi", "stranger", "afrobeat", "genr", "woefulli", "vagu", "there", "reggaefi", "throne", "oscil", "plaintiv", "choru", "sharp", "vers", "show", "koffe", "abil", "shift", "alto", "bariton", "sing", "thump", "blazin", "provid", "adequ", "back", "koffe", "rapidfir", "deliveri", "fellow", "newcom", "jane", "mcgizmo", "soprano", "choru", "float", "echo", "given", "woman", "initi", "career", "goal", "pharmacist", "hard", "think", "mix", "serious", "origin", "medicin", "tune", "just", "tower", "lot", "what", "releas", "day", "oneminut", "perform", "raptur", "bespok", "riddim", "uk", "toddla", "t", "led", "breathless", "twitter", "reaction", "longer", "version", "touch", "moodier", "boast", "choru", "koffe", "come", "like", "raptur", "everybodi", "captur", "sticki", "sticki", "sticki", "clearli", "constant", "strong", "song", "focu", "hooksit", "thing", "set", "apart", "mayb", "get", "chronixx", "breakout", "reggaereviv", "superstar", "penchant", "perfect", "hook", "rub", "young", "woman", "she", "obvious", "pay", "attent", "import", "memor", "melodi", "concern", "hard", "come", "away", "listen", "song", "like", "raggamuffin", "hum", "choru", "perform", "live", "legendari", "tuff", "gong", "studio", "bbc", "radio", "1xtra", "2018", "visit", "island", "chronixx", "ad", "bit", "piec", "choru", "watch", "video", "coupl", "moment", "grammi", "nomine", "break", "huge", "smile", "koffe", "casual", "spit", "lyric", "classic", "real", "rock", "riddim", "know", "he", "hear", "special", "raptur", "ep", "proof", "talent", "mix", "rhythm", "regga", "like", "tast", "what", "come"], "date_published": ["2019-03-18T05:00:00"], "sentiment": 0.16350165791655155, "content": "The opening strains of the ultra-infectious “Toast,” the first single from Jamaican teenage upstart Mikayla “Koffee” Simpson, demand a repeat. It’s the perfect tune to “lick back”—to pull back and rewind to the start—as is the practice of the mobile discotheque soundsystems on the island, building the anticipation for the beat to drop.\nKoffee, who initially drew attention with an acoustic tribute to Usain Bolt, has a crisp delivery that moves back and forth between rapid-fire ragga grit and one drop conscious reggae, a style referred to as the portmanteau “singjay” (combining “singer” and “deejay,” the Jamaican term for MC). There’s been a great deal of talk about up-and-coming women in Jamaican music—Shenseea and HoodCelebrityy, to name only a couple—but this five-song EP indicates that Koffee can, like many of the singjays who made their mark in the late 1990s and early 2000s (Sizzla, Capleton, Buju Banton), navigate between dancehall and reggae with ease.\nProduction on the EP reflects multiple genres and seems to travel in and out of Jamaica as well. “Toast” might be called near-Naija in its styling—and no surprise, given that Walshy Fire was involved. As a member of Major Lazer, the outfit known for its constant (and sometimes controversial) international search for rhythms, Walshy is no stranger to Afrobeats, that genre with a woefully vague name. And then there’s the much more reggaefied “Throne”: It oscillates between plaintive chorus and sharp verse, showing off Koffee’s ability to shift from “alto to baritone,” as she sings. The thump of “Blazin” provides adequate backing for Koffee’s rapid-fire delivery; fellow newcomer Jane McGizmo’s soprano chorus floats and echoes above.\nGiven that this is a woman whose initial career goal was to be a pharmacist, it’s hard not to think about her as mixing up some seriously original medicine, because some of these tunes just tower over a whole lot of what’s being released these days. A one-minute performance of “Rapture” on a bespoke riddim by the UK’s Toddla T led to a breathless Twitter reaction. The longer version here is a touch moodier, but the boastful chorus, “Koffee come in like a rapture, and everybody get capture,” is sticky, sticky, sticky. What is clearly constant throughout each of the strong five songs here is a focus on hooks—it’s another thing that sets her apart.\nMaybe she gets it from Chronixx. The breakout reggae-revival superstar has a penchant for perfect hooks that has rubbed off on this young woman; she’s obviously been paying attention to how important memorability is where melodies are concerned. It’s hard to come away from listening to a song like “Raggamuffin” and not be humming the chorus. When she performed it live at the legendary Tuff Gong studios as part of BBC Radio 1xtra’s 2018 visit to the island, Chronixx added bits and pieces to the chorus. Watching the video, there are a couple moments where the Grammy nominee breaks out in a huge smile as Koffee casually spits lyrics over the classic real rock riddim. He knows that he’s hearing something special. The Rapture EP is further proof of her talents, and its mix of rhythms and reggae seem likely to be but the first taste of what’s yet to come.\n", "pptitle": ["raptur", "ep"]}