{"id": "PF_56", "url": "https://pitchfork.com/reviews/albums/stephen-malkmus-groove-denied/", "name": ["Groove", "Denied"], "description": ["promo", "copi", "stephen", "malkmu", "eponym", "2001", "solo", "album", "began", "circul", "bore", "record", "work", "titl", "swedish", "regga", "obviou", "joke", "work", "level", "implicit", "contradict", "term", "preposter", "dialup", "world", "internet", "dissolv", "geograph", "music", "boundari", "gag", "root", "equal", "absurd", "notion", "stephen", "malkmu", "deign", "make", "music", "sound", "like", "primari", "singer", "guitarist", "pavement", "malkmu", "defin", "figur", "1990", "indi", "rock", "signatur", "mix", "skew", "fuzzcoat", "songcraft", "cryptic", "lyric", "practic", "subgenr", "unto", "postpav", "outfit", "jick", "song", "remain", "guitar", "solo", "gotten", "longer", "30th", "year", "record", "artist", "stephen", "malkmu", "good", "stephen", "malkmu", "mere", "prospect", "futz", "make", "electron", "music", "ableton", "live", "rais", "eyebrow", "plenti", "indierock", "titan", "vintag", "dabbl", "digit", "malkmu", "start", "write", "groov", "deni", "live", "berlin", "earli", "2010", "dj", "friend", "chaperon", "citi", "infam", "club", "scenebut", "ravement", "thrust", "foreign", "music", "territori", "album", "return", "malkmu", "murki", "soup", "lofi", "diy", "postpunk", "serv", "pavement", "petri", "dish", "he", "take", "cue", "primit", "protoindustri", "synthwav", "normal", "boiledera", "human", "leagu", "instead", "gnarl", "guitar", "swell", "map", "fall", "far", "record", "inspir", "berlin", "nightclub", "bender", "vibe", "danc", "like", "one", "watch", "mess", "like", "one", "listen", "groov", "deni", "channel", "circa1979", "postpunk", "just", "auster", "sound", "mindset", "hark", "era", "machin", "repres", "sound", "futur", "quit", "sure", "there", "palpabl", "sens", "doe", "button", "curios", "open", "belzig", "facepl", "jab", "synth", "note", "arrhythm", "spar", "sputter", "drummachin", "beat", "malkmu", "intrud", "aton", "croon", "like", "ham", "karaok", "booth", "fortifi", "rhythm", "tambourin", "effect", "circular", "policesiren", "refrain", "poke", "prod", "distort", "synth", "bleat", "check", "steak", "groov", "deni", "technic", "malkmu", "second", "proper", "solo", "album", "2001", "debut", "record", "realli", "trial", "run", "thenunbil", "jick", "stark", "contrast", "jick", "west", "coast", "openroad", "splendor", "groov", "deni", "true", "solitari", "effort", "sound", "afterhour", "homestudio", "tinker", "gear", "burst", "tangl", "wire", "cabinfev", "claustrophobia", "especi", "true", "forget", "place", "slowmot", "swirl", "ambient", "techno", "malkmu", "modul", "voic", "drowsi", "drone", "imagin", "futur", "robot", "come", "job", "overtur", "straightforward", "synth", "pop", "eventu", "start", "shortcircuit", "recent", "noisey", "featur", "malkmu", "sat", "listen", "lcd", "soundsystem", "album", "time", "fittingli", "viktor", "borgiawith", "neonlit", "kraftwerkian", "tone", "cluster", "minimalist", "disco", "groov", "archli", "deliv", "metalyr", "make", "beat", "connect", "walk", "clubthank", "heaven", "abovesound", "like", "malkmu", "tri", "make", "jame", "murphi", "song", "have", "read", "dancepunk", "icon", "stop", "short", "build", "track", "lcdlevel", "thumper", "he", "have", "fun", "switch", "drummachin", "set", "compar", "triumph", "2018", "jick", "effort", "sparkl", "hardan", "album", "featur", "endear", "incis", "write", "malkmu", "careergroov", "deni", "help", "feel", "like", "minor", "effort", "essenti", "answer", "mccartney", "iith", "sound", "veteran", "artist", "belov", "band", "belt", "revel", "freedom", "indulg", "latent", "fascin", "latest", "gadget", "like", "record", "groov", "deni", "tech", "fetish", "ultim", "limit", "hand", "track", "like", "togaparti", "velvet", "rumbl", "rush", "acid", "frat", "guitarbas", "onemanband", "rocker", "couldv", "easili", "retool", "jick", "jam", "groov", "deni", "slapdash", "kitchensink", "experiment", "rare", "overwhelm", "malkmu", "singular", "charm", "lonesom", "sitarspeckl", "lament", "come", "southern", "gothic", "progpop", "opu", "ocean", "reveng", "earworm", "choru", "melodi", "teas", "string", "arrang", "sparkl", "hard", "brethren", "album", "yield", "pair", "ace", "stand", "alongsid", "finest", "song", "90", "malkmu", "pavement", "lazi", "shorthand", "iron", "slacker", "reput", "that", "undersold", "emot", "distress", "subtl", "social", "commentari", "heart", "best", "write", "will", "irrever", "record", "put", "premium", "groov", "qualiti", "deni"], "date_published": ["2019-03-16T05:00:00"], "sentiment": 0.11887626262626264, "content": "When promo copies of Stephen Malkmus’ eponymous 2001 solo album began to circulate, they bore the record’s working title: Swedish Reggae. It was an obvious joke that worked on two levels. There was the implicit contradiction in terms, which seemed more preposterous in a dial-up world where the internet had yet to dissolve geographic and musical boundaries; the gag was also rooted in the equally absurd notion that Stephen Malkmus would deign to make music that sounded like anyone other than himself. As the primary singer and guitarist in Pavement, Malkmus had not only been one of the defining figures of 1990s indie rock; his signature mix of skewed, fuzz-coated songcraft and cryptic lyricism had practically become a subgenre unto itself. And with his post-Pavement outfit the Jicks, the song has more or less remained the same, even as the guitar solos have gotten longer.\nNow in his 30th year as a recording artist, Stephen Malkmus is so good at being Stephen Malkmus that the mere prospect of him futzing around and making electronic music with Ableton Live might raise eyebrows, even after plenty of indie-rock titans of his vintage have dabbled in digitalism. Malkmus started writing Groove Denied while he was living in Berlin in the early 2010s, after a DJ friend chaperoned him into the city’s infamous club scene—but Ravement this is not. Rather than thrust him into foreign musical territory, the album returns Malkmus to the murky soup of lo-fi, DIY post-punk that once served as Pavement’s petri dish. But now he’s taking his cues from the primitive, proto-industrial synthwave of the Normal and “Being Boiled”-era Human League instead of the gnarled guitars of Swell Maps and the Fall. As far as records inspired by Berlin nightclub benders go, the vibe here is less “Dance like no one’s watching” than “Mess around like no one’s listening.”\nGroove Denied channels circa-1979 post-punk not just in austere sound but in mindset, harking back to an era when machines represented the sound of the future but no one was quite sure of what do with them yet. There’s a palpable sense of “What does this button do?” curiosity to the opening “Belziger Faceplant,” where jabbing synth notes arrhythmically spar with a sputtering drum-machine beat while Malkmus intrudes with an atonal croon like someone hamming it up in a karaoke booth. Even as he fortifies the rhythm with tambourine effects and a circular police-siren refrain, he pokes and prods it with distorted synth bleats, as if checking to see if his steak is done.\nGroove Denied is technically Malkmus’ second proper solo album after his 2001 debut, but that record was really a trial run for the then-unbilled Jicks. In stark contrast to the Jicks’ West Coast open-road splendor, Groove Denied is a true solitary effort, the sound of after-hours home-studio tinkering, gear bursting with tangled wires, and cabin-fever claustrophobia. This is especially true of “Forget Your Place,” a slow-motion swirl of ambient techno where Malkmus modulates his voice down into a drowsy drone, imagining a future where the robots have come for his job. Even his overtures toward straightforward synth pop eventually start to short-circuit. For a recent Noisey feature, Malkmus sat down and listened to LCD Soundsystem’s first album for the first time; fittingly, “Viktor Borgia”—with its neon-lit Kraftwerkian tone clusters, minimalist disco groove, and archly delivered meta-lyrics about making a beat connection (“We walk into the club/Thank the heavens above”)—sounds like Malkmus trying to make a James Murphy song having only read about the dance-punk icon. But he stops short of building the track up into a LCD-level thumper, because he’s having too much fun switching up the drum-machine settings.\nCompared to the triumph of 2018’s Jicks effort Sparkle Hard—an album that featured some of the most endearing and incisive writing of Malkmus’ career—Groove Denied can’t help but feel like a minor effort. It’s essentially his answer to McCartney II—the sound of a veteran artist with two beloved bands under his belt reveling in the freedom to indulge a latent fascination with the latest gadgets. Like that record, Groove Denied’s tech fetishism ultimately has its limits. A handful of these tracks (like the toga-party Velvets rumble of “Rushing the Acid Frat”) are guitar-based one-man-band rockers that could’ve easily been retooled into Jicks jams. But Groove Denied’s slapdash kitchen-sink experimentation rarely overwhelms Malkmus’ singular charms. With the lonesome, sitar-speckled lament “Come Get Me” and the Southern Gothic prog-pop opus “Ocean of Revenge” (whose earworm chorus melody was teased in the string arrangement of Sparkle Hard’s “Brethren”), the album yields a pair of aces that can stand alongside his finest songs. Since the ’90s, Malkmus and Pavement have become lazy shorthand for “ironic slackers,” a reputation that’s always undersold the emotional distress and subtle social commentary at the heart of his best writing. But even on a willfully irreverent record that puts a premium on groove, those qualities can’t be denied.\n", "pptitle": ["groov", "deni"]}