{"id": "PF_68", "url": "https://pitchfork.com/reviews/albums/dis-fig-purge/", "name": ["PURGE"], "description": ["felicia", "chen", "usual", "associ", "spin", "intens", "electron", "dj", "set", "guis", "di", "fig", "point", "record", "debut", "album", "purg", "chen", "convey", "label", "boss", "geng", "run", "new", "york", "citybas", "ptp", "vibe", "music", "like", "anguish", "portishead", "meet", "bass", "swamp", "tendenc", "bug", "contextu", "music", "referenti", "way", "like", "happen", "lot", "listen", "ptp", "releas", "label", "origin", "name", "purpl", "tape", "pedigre", "honor", "purplecolor", "cassett", "copi", "raekwon", "1995", "hiphop", "standardbear", "built", "4", "cuban", "linx", "wont", "way", "90sinfluenc", "rap", "alli", "dusti", "soul", "sampl", "vault", "instead", "ptp", "mission", "annihil", "genr", "boundari", "revel", "brilliant", "debrislik", "releas", "muse", "rem", "sleep", "cycl", "flash", "moment", "seren", "scifi", "ambienc", "pummel", "video", "game", "techno", "nima", "aghiani", "rem", "present", "noiserock", "workout", "invok", "trancelik", "feel", "heal", "rock", "root", "raga", "run", "tapestri", "percuss", "field", "record", "tehran", "echochamb", "commentari", "chemic", "attack", "iraq", "saint", "abdullah", "star", "eye", "di", "fig", "purg", "fit", "snugli", "ptp", "credo", "record", "waver", "chen", "scorch", "vocal", "battl", "heard", "brutal", "electron", "product", "lumin", "minimalist", "moment", "word", "reson", "tender", "plea", "way", "album", "nod", "triphop", "techno", "nois", "punk", "soul", "influenc", "despit", "progress", "product", "emot", "heart", "challeng", "listen", "empath", "chen", "whip", "violent", "outburst", "quiet", "pocket", "respit", "album", "open", "drum", "fife", "bugl", "glitchi", "electron", "jab", "pair", "sound", "like", "fanfar", "panpip", "join", "sampl", "pant", "buzzsaw", "motorblad", "track", "frantic", "qualiti", "conjur", "imag", "chen", "escap", "wild", "overgrowth", "phosphoresc", "alien", "land", "emot", "battlefield", "follow", "aliv", "chen", "sound", "cage", "distress", "vocalsi", "came", "your", "alivear", "suppress", "wave", "murmur", "bass", "digit", "volcan", "ash", "sputter", "intens", "aliv", "come", "revit", "water", "ghostli", "quiet", "storm", "song", "consist", "lap", "wave", "digit", "nois", "vertigin", "setup", "continu", "maelstrom", "vocal", "electron", "product", "typifi", "song", "like", "u", "said", "u", "unleash", "sooth", "hymnal", "solitud", "hermit", "confession", "digisoul", "ebb", "flow", "drama", "reflect", "defin", "purg", "topographi", "word", "repress", "product", "isnt", "cri", "vainsh", "feel", "tear", "fabric", "creation", "come", "head", "purg", "30second", "interlud", "she", "heard", "listen", "tinni", "cantopop", "song", "putter", "home", "there", "shock", "domest", "unlock", "purg", "purg", "end", "rel", "instrument", "calm", "tree", "realiz", "chen", "selfinduc", "emot", "pain", "unstint", "soulsearch", "mechan", "just", "simpli", "feel", "secur"], "date_published": ["2019-03-14T05:00:00"], "sentiment": -0.03011363636363636, "content": "Felicia Chen is usually associated with spinning intense electronic DJ sets under the guise of Dis Fig. At one point during the recording of her debut album PURGE, Chen conveyed to her label boss, Geng, who runs the New York City-based PTP, that the vibe of the music was like anguished Portishead meeting the bass swamped tendencies of the Bug.\nContextualizing music in a referential way like this happens a lot when you listen to PTP releases: The label was originally named Purple Tape Pedigree in honor of purple-colored cassette copies of Raekwon's 1995 hip-hop standard-bearer Only Built 4 Cuban Linx..., but you won't find much in the way of ’90s-influenced raps allied to dusty soul samples in the vault. Instead, PTP's mission seems to be to annihilate genre boundaries and revel in the brilliant debris—like releasing a musing on the REM sleep cycle that flashes between moments of serene sci-fi ambience and pummeling video game techno (Nima Aghiani's REMS), presenting a noise-rock workout to invoke trance-like feelings of healing (Among The Rocks And Roots' Raga), or running tapestries of percussion and field recordings from Tehran through an echo-chamber as commentary on chemical attacks in Iraq (Saint Abdullah’s Stars Have Eyes).\nDis Fig's PURGE fits snugly into the PTP credo: The record wavers between Chen’s scorched vocals battling to be heard over brutal, electronic production and luminous, minimalist moments where her words resonate as tender pleas. Along the way, the album nods to trip-hop, techno, noise, punk and soul influences. But despite its progressive production, its emotional heart challenges the listener to empathize why Chen whips between violent outbursts and quiet pockets of respite.\nThe album opens with \"Drum Fife Bugle,” where glitchy electronic jabs are paired with what sounds like a fanfare of panpipes, before being joined by sampled panting and buzzsaw motor-blades. The track has a frantic quality, conjuring images of Chen escaping through wild overgrowth, phosphorescent alien lands, or an emotional battlefield. It’s followed by \"Alive,\" where Chen sounds caged: Her distressed vocals—“I came to see if you're alive”—are suppressed by waves of murmuring bass and digital volcanic ash sputtering around. After the intensity of “Alive” comes the revitalizing “Watering,” a ghostly quiet storm of a song consisting of lapping waves of digital noise. This vertiginous setup continues, with the maelstrom of vocals and electronic production typifying songs like “U Said U Were” and “Unleash” soothed by the hymnal solitude of “The Hermit” and the confessional digi-soul of “WHY.”\nThe ebb and flow between drama and reflection define PURGE’s topography. Her words are often repressed by the production, but she isn’t crying out in vain—she’s feeling for tears in a fabric of her own creation. This comes to a head between “Purge” and “WHY” via a 30-second interlude where she’s heard listening to a tinny Cantopop song while puttering around her home. There’s something shocking in the domesticity of it all and it unlocks PURGE. As PURGE ends with the relative instrumental calm of “I Am the Tree,” you realize all of Chen’s self-induced emotional pain and unstinting soul-searching has been a mechanism to just, simply, feel secure.\n", "pptitle": ["purg"]}