{"id": "PF_96", "url": "https://pitchfork.com/reviews/albums/sasami-sasami/", "name": ["SASAMI"], "description": ["indescrib", "melancholi", "shoegaz", "cours", "just", "beneath", "surfac", "music", "design", "overwhelm", "unnam", "feel", "sad", "listen", "loveless", "night", "facebook", "group", "ye", "lifestyl", "brightest", "song", "cocteau", "twin", "carri", "undertow", "sorrow", "sasami", "ashworth", "shoegaz", "invok", "similar", "feel", "lo", "angelesbas", "polymath", "year", "synth", "player", "cherri", "glazerr", "debut", "record", "sasami", "union", "synthes", "decay", "guitar", "reverb", "embodi", "shoegaz", "supernatur", "abil", "conjur", "sad", "void", "ashworth", "describ", "songwrit", "process", "akin", "draft", "long", "angri", "text", "note", "section", "iphon", "let", "simmeralthough", "listen", "record", "time", "that", "entir", "clear", "easi", "mistak", "sasami", "gentl", "sooth", "album", "word", "begin", "creep", "way", "ground", "ashworth", "dark", "heart", "begin", "reveal", "song", "like", "time", "blush", "bit", "benign", "smartli", "hem", "guitar", "part", "glow", "like", "asobi", "seksu", "track", "sasami", "sound", "uncannili", "like", "trish", "keenan", "crawl", "insid", "song", "reveal", "complex", "tri", "make", "work", "doesnteven", "time", "hurt", "moment", "sing", "arrang", "practic", "bleed", "spaceprismat", "guitar", "work", "ashworth", "brother", "joojoo", "stretch", "far", "corner", "mix", "percuss", "cameron", "allen", "sound", "weightless", "moth", "flutter", "attic", "moment", "ashworth", "comfort", "default", "pretti", "incred", "adept", "write", "love", "melodi", "synth", "part", "excit", "moment", "come", "threaten", "break", "loos", "free", "ashworth", "vocal", "quiver", "she", "contain", "broken", "heart", "citi", "held", "ownw", "walk", "far", "gow", "choos", "took", "shoe", "sing", "accompani", "grow", "noisier", "move", "spacerock", "territori", "singl", "callou", "burn", "cosmic", "energi", "souvlakiera", "slowdiv", "cycl", "memori", "explor", "especi", "gut", "lost", "callous", "youand", "didnt", "ask", "day", "track", "scan", "crowd", "pleaser", "like", "adult", "contemporari", "featur", "ensembl", "cast", "musician", "like", "soko", "hand", "habit", "meg", "duffi", "deepli", "person", "listen", "ashworth", "unpack", "relationship", "verg", "voyeur", "write", "sad", "suffer", "difficult", "especi", "space", "debut", "album", "figur", "say", "say", "dig", "beneath", "surfac", "song", "bitter", "secret", "buri", "bloom", "ashworth", "sound", "like", "she", "yearn", "startl", "music", "hypnot", "pleasant", "surfac", "time", "wonder", "gauzi", "shoegaz", "do", "disservic", "hide", "plain", "sight", "sasami", "power", "effort", "ashworth", "compel", "presenc", "shoegaz", "name", "practition", "supposedli", "meet", "eye", "spend", "long", "sasami", "ashworth", "stare", "right"], "date_published": ["2019-03-08T06:00:00"], "sentiment": 0.10084915084915083, "content": "There is an indescribable melancholy to shoegaze coursing just beneath the surface. The music seems designed to overwhelm you with unnamable feelings: I am sad and I listen to Loveless Every Night is the name of a Facebook group, yes, but it’s also a lifestyle. Even the brightest songs by the Cocteau Twins carry an undertow of sorrow. Sasami Ashworth’s shoegaze invokes similar feelings; the Los Angeles-based polymath has made her name over the years as the synth player in Cherry Glazerr. Her debut record, SASAMI, is a union of synthesizer decay and guitar reverb that embodies shoegaze’s supernatural ability to conjure sadness from the void.\nAshworth has described her songwriting process as akin to drafting a long, angry text in the Notes section of an iPhone and then letting it simmer—although when listening to this record the first few times that’s not entirely clear. It’s easy to mistake SASAMI as a gentle, soothing album, but then the words begin to creep their way out of the ground, and Ashworth’s dark heart begins to reveal itself.  Take a song like “Not the Time”; on first blush, it seems a bit benign. Its smartly hemmed guitar parts glow like an Asobi Seksu track while Sasami sounds uncannily like Trish Keenan. But as you crawl further inside, the song reveals complexities: “Even though we tried to make it work, it doesn’t/Even though each time it only hurts for a moment,” she sings. The arrangement practically bleeds empty space—prismatic guitar work from Ashworth’s brother, JooJoo, stretches out into the far corners of the mix, while the percussion from Cameron Allen sounds as weightless as a moth fluttering around an attic.\nThere are moments when Ashworth seems too comfortable with a default prettiness. She is incredibly adept at writing lovely melodies and synth parts, but the most exciting moments come when she threatens to break loose. On “Free,” Ashworth’s vocals quiver, as if she’s containing herself in front of someone who has broken her heart. “The city held us as its own/We walked as far as we could go/We had to choose, so we took off our shoes,” she sings as her accompaniment grows noisier, moving into space-rock territory. The first single, “Callous,” burns with the cosmic energy of Souvlaki-era Slowdive. The cycle of memories she explores here are especially gutting: “I lost my callouses for you/And you didn’t even ask me how my day was.” Even the tracks that scan as crowd pleasers, like “Adult Contemporary,” which features an ensemble cast of musicians like Soko and Hand Habits’ Meg Duffy, are deeply personal.\nListening to Ashworth unpack her relationships can verge on voyeurism. Writing about sadness and suffering is difficult to do, especially in the space of a debut album, when you are still figuring out what to say and how to say it. But dig beneath the surface of her songs, and the bitter secrets she has buried there bloom. Sometimes Ashworth sounds like she’s yearning to startle her own music’s hypnotically pleasant surface, and there are times you wonder if the gauziness of shoegaze is doing her a disservice, hiding her in plain sight. But SASAMI is a powerful first effort, and Ashworth is a compelling presence. Shoegaze was named because its practitioners supposedly couldn’t meet your eye, but if you spend long enough with SASAMI you will find Ashworth staring right out at you.\n", "pptitle": ["sasami"]}