{"id": "PF_52", "url": "https://pitchfork.com/reviews/albums/dave-psychodrama/", "name": ["Psychodrama"], "description": ["year", "ago", "dave", "start", "gain", "reput", "freestyl", "video", "young", "wordsmith", "known", "santan", "dave", "stare", "camera", "relay", "fierc", "reflect", "tumultu", "life", "use", "lyric", "crowbar", "pri", "open", "door", "keep", "voiceless", "london", "dark", "thiago", "silva", "prove", "hold", "grime", "tempo", "fan", "soon", "discov", "play", "piano", "difficult", "fathom", "teenag", "dave", "20", "debut", "album", "psychodrama", "signific", "bodi", "british", "rap", "music", "gener", "psychodrama", "form", "psychotherapi", "patient", "roleplay", "event", "past", "heal", "make", "sens", "dave", "use", "term", "cathart", "glue", "bind", "heavi", "theme", "bring", "listen", "therapi", "room", "grappl", "societ", "injustic", "industri", "contradict", "privat", "pain", "album", "start", "finish", "song", "psycho", "drama", "respect", "includ", "touch", "dialogu", "older", "brother", "serv", "life", "sentenc", "prison", "haunt", "backdrop", "long", "bled", "dave", "lyricismnev", "father", "need", "figur", "cri", "album", "close", "passagebut", "impact", "close", "examin", "psychodrama", "11", "song", "hypnot", "piano", "play", "dave", "set", "conceptu", "limit", "fill", "urban", "opera", "blend", "desir", "exorc", "demon", "oldsoul", "music", "wisdom", "youth", "perform", "singl", "black", "debut", "bbc", "radio", "1", "anni", "mac", "hottest", "record", "world", "garner", "backlash", "listen", "miss", "nuanc", "critiqu", "languag", "limit", "construct", "racial", "ident", "express", "divers", "songon", "dave", "share", "piano", "bench", "acclaim", "produc", "fraser", "t", "smith", "influenc", "heard", "albumi", "just", "proud", "race", "anthem", "polit", "media", "establish", "britain", "continu", "fall", "short", "repres", "ethnic", "minor", "experi", "recent", "case", "centrist", "politician", "unabl", "avoid", "basic", "faux", "pa", "black", "doubl", "manifesto", "respons", "phraseolog", "anachronist", "stereotyp", "kid", "die", "blacker", "killer", "sweeter", "newsand", "he", "white", "chanc", "he", "ill", "confusedif", "he", "black", "he", "probabl", "arm", "shoot", "dave", "assess", "song", "like", "screwfac", "capit", "streatham", "stick", "close", "dave", "formula", "consciou", "modern", "uk", "rap", "deliv", "hard", "emot", "avail", "ode", "cold", "citi", "birth", "highlight", "purist", "seek", "thump", "beat", "match", "dave", "anger", "vers", "lace", "string", "intric", "wordplay", "admissionssometim", "cheeki", "sullen", "tell", "know", "bag", "billsand", "mom", "cri", "say", "son", "itand", "stare", "mirror", "hourwith", "tear", "eye", "like", "gotta", "make", "spit", "softer", "poppier", "offer", "like", "purpl", "heart", "voic", "appeal", "dave", "increasingli", "divers", "audienc", "older", "fan", "newcom", "seek", "easi", "access", "london", "unforgivingli", "hardlin", "rap", "scene", "what", "team", "afrobeat", "star", "burna", "boy", "celebr", "britishghanaian", "hitmak", "jae5", "locat", "fellow", "london", "boundarypush", "j", "hu", "disast", "dave", "stretch", "album", "reach", "absorb", "upbeat", "diaspor", "influenc", "movement", "color", "gravit", "pull", "center", "magnum", "opu", "lesley", "11minut", "deep", "dive", "life", "abus", "relationship", "woman", "dave", "meet", "train", "collid", "differ", "world", "locat", "microcosm", "psychodrama", "refus", "contain", "work", "art", "instead", "reach", "emot", "intimaci", "therapeut", "reson", "end", "lesley", "passion", "calltoact", "dave", "put", "messag", "woman", "toxic", "man", "beg", "support", "your", "lost", "trap", "world", "crave", "artist", "use", "influenc", "good", "dave", "offer", "road", "map", "inspir", "musician", "inquisit", "listen", "alik", "lesley", "close", "disembodi", "voic", "dave", "fiction", "therapist", "express", "relief", "client", "near", "end", "album", "psychodramat", "cours", "im", "just", "happi", "your", "place", "feel", "understand", "emot", "control", "say", "differ", "kind", "hero", "journey", "music", "mind", "psychodrama", "feel", "like", "platform", "clout", "start", "point", "selfhelp", "paradigmat", "chang"], "date_published": ["2019-03-15T05:00:00"], "sentiment": 0.06685563114134543, "content": "Three years ago, Dave started to gain a reputation for his freestyle videos. The young wordsmith, also known as Santan Dave, would stare into the camera and relay fierce reflections about his tumultuous life, using them as a lyrical crowbar to pry open the doors keeping voiceless Londoners in the dark. On “Thiago Silva” he proved he could hold his own at a grime tempo, and fans soon discovered he played the piano, too. It was difficult to fathom that he was only a teenager. Now Dave is 20, and his debut album, Psychodrama, is one of the most significant bodies of British rap music in a generation.\nPsychodrama is a form of psychotherapy in which patients role-play events from their past to heal and make sense of themselves. Dave uses the term as a cathartic glue to bind heavy themes together, bringing listeners into his therapy room while he grapples with societal injustice, industry contradictions, and private pain. The album starts and finishes with songs “Psycho” and “Drama,” respectively, and the latter includes a touching dialogue with his older brother, who is serving a life sentence in prison. This haunting backdrop has long bled into Dave’s lyricism—“Never had a father and I needed you to be the figure,” he cries in the album’s closing passage—but its impact is more closely examined across Psychodrama than ever before. Over 11 songs and much hypnotic piano playing, Dave sets his conceptual limits, and then fills them with an urban opera that blends his desire to exorcize demons with old-soul musical wisdom and youthful performativity.\nWhen the single “Black” was debuted on BBC Radio 1 as Annie Mac’s Hottest Record in the World, it garnered backlash from listeners who missed its nuanced critique of language as a limiting construct on racial identity, expression, and diversity. But the song—on which Dave shares his piano bench with acclaimed producer Fraser T. Smith, whose influence can be heard throughout the album—is not just a proud race anthem. As political and media establishments in Britain continue to fall short in representing ethnic minority experiences (in one recent case, a centrist politician found herself unable to avoid even a basic faux pas), “Black” doubles as a manifesto for responsible phraseology, and against anachronistic stereotyping. “A kid dies, the blacker the killer, the sweeter the news/And if he’s white, you give him a chance, he’s ill and confused/If he’s black he’s probably armed, you see him and shoot,” Dave assesses.\nSongs like “Screwface Capital” and “Streatham” stick closely to Dave’s formula of conscious, modern UK rap, delivering hard yet emotionally available odes to the cold city that birthed him. These are highlights for purists seeking thumping beats to match Dave’s anger, and each verse is laced with its own string of intricate wordplay and admissions—sometimes cheeky, often sullen. “Tell me what you know about a bag full of bills/And your mom crying out, saying, ‘Son, I can’t take it,’/And then staring in the mirror for an hour/With a tear in your eye like, ‘I gotta go make it,’” he spits. Softer, poppier offerings like “Purple Heart” and “Voices” will appeal to Dave’s increasingly diverse audience of older fans and newcomers seeking easy access to London’s unforgivingly hardline rap scene. What’s more, by teaming up with afrobeat star Burna Boy and celebrated British-Ghanaian hitmaker Jae5 for “Location,” and fellow London boundary-pusher J Hus on “Disaster,” Dave stretches the album’s reach to absorb upbeat diasporic influence, movement, and color.\nBut the gravitational pull at the center of this magnum opus is “Lesley,” an 11-minute deep dive into the life and abusive relationship of a woman Dave meets on a train, as if colliding “two different worlds in the same location.” It is a microcosm of Psychodrama’s refusal to contain itself as a work of art, instead reaching for emotional intimacy and therapeutic resonance. By its end, “Lesley” becomes a passionate call-to-action; as Dave puts it, “a message to a woman with a toxic man” who he is “begging… to get support if you’re lost or trapped.” In a world craving artists who use their influence for good, Dave offers a road map for inspired musicians and inquisitive listeners alike.\n“Lesley” closes on the disembodied voice of Dave’s fictional therapist, who expresses relief as his client nears the end of the album’s psychodramatic course. “I’m just happy you’re at a place now where you feel you understand your emotions, and are in control,” he says. A different kind of hero’s journey through the musical mind, Psychodrama feels less like a platform for clout than a starting point for self-help and paradigmatic change.\n", "pptitle": ["psychodrama"]}