{"id": "PF_92", "url": "https://pitchfork.com/reviews/albums/lomelda-m-for-empathy/", "name": ["M", "for", "Empathy"], "description": ["past", "year", "hannah", "read", "constant", "motion", "long", "drive", "routin", "live", "smalltown", "silsbe", "tx", "isol", "mobil", "extens", "tour", "lomelda", "led", "inspir", "2017", "album", "thx", "road", "just", "mean", "physic", "destinationit", "cultiv", "fixat", "commun", "understand", "hefti", "theme", "thx", "continu", "provid", "fodder", "new", "song", "transplant", "lo", "angel", "read", "take", "contempl", "turn", "embrac", "breviti", "modest", "product", "newest", "album", "m", "empathi", "album", "short", "sixteen", "minut", "read", "remind", "intricaci", "nuanc", "empathi", "task", "understand", "arduou", "read", "empathi", "polit", "magic", "bullet", "person", "explor", "open", "talk", "mention", "golden", "state", "she", "move", "build", "need", "state", "step", "way", "sing", "care", "voic", "make", "1700mile", "trek", "commun", "she", "move", "closer", "she", "travel", "farther", "read", "cultiv", "cozi", "pocket", "sound", "choic", "topic", "delic", "natur", "piano", "key", "cascad", "bust", "glint", "m", "mush", "acoust", "guitar", "strum", "round", "woodi", "tell", "bright", "steadi", "bad", "2", "care", "help", "brother", "tommi", "read", "stretch", "calm", "tone", "comfort", "sentiment", "instrument", "lyricist", "read", "use", "small", "poignant", "sentenc", "fragment", "repetit", "wordplay", "incred", "precis", "captur", "intim", "snapshot", "tini", "framework", "despit", "song", "short", "lifespana", "minut", "half", "averagethey", "feel", "expans", "shapeshift", "like", "shadow", "puppet", "wall", "thought", "thing", "say", "youbut", "read", "wonder", "aloud", "bust", "repeat", "fragment", "time", "tag", "subtl", "semant", "layer", "underscor", "twoway", "mirror", "effect", "tri", "understand", "els", "perspect", "take", "wild", "lyric", "risk", "stun", "m", "mush", "make", "mold", "hold", "mushin", "magic", "merci", "mind", "sing", "empathi", "pliabl", "play", "playdoh", "m", "empathi", "potent", "moment", "read", "travel", "vast", "space", "instrument", "transit", "existenti", "concern", "misunderstand", "obstacl", "empathydeath", "troublesom", "way", "interveningwhat", "die", "know", "ya", "ask", "m", "voic", "fragil", "read", "understand", "way", "empathi", "complet", "possibl", "simpl", "say", "understand", "reach", "possibl", "save", "someon", "lifeon", "slide", "read", "sing", "depress", "friend", "phone", "save", "doesnt", "perform", "empathi", "investig", "eras", "extran", "lyric", "leav", "space", "imagin", "room", "insert"], "date_published": ["2019-03-07T06:00:00"], "sentiment": 0.0928056070913214, "content": "For the past few years, Hannah Read has been in constant motion. Long drives were a part of her routine when living in small-town Silsbee, TX., and the isolating mobility of her extensive touring as Lomelda led to the inspiration for her 2017 album Thx. But the road is more than just a means to her physical destination—it cultivated a fixation with communication and understanding, which were hefty themes on Thx and have continued to provide fodder for new songs. Now, after transplanting herself to Los Angeles, Read takes a more contemplative turn, embracing brevity and modest production on her newest album M for Empathy.\nWithin her album’s very short sixteen minutes, Read reminds us of the intricacies and nuances of empathy. The task of understanding others is arduous: Read’s empathy is not a political magic bullet, but a personal exploration. On the opener “Talk,” she mentions her move to the Golden State as if she’s moving a few buildings down. “I need to be over there, four states a step a way,” she sings carefully. Her voice will make the 1,700-mile trek, communicating with those she’s moving closer to and those she’s traveling farther from.\nRead cultivates a cozy pocket of sound for her choice topic’s delicate nature. Piano keys cascade during “Bust” and then glint on “M for Mush”; acoustic guitar strums are round and woody on “Tell” and then are bright and steady on “So Bad 2, Care.” With the help of her brother Tommy, Read stretches the calming tones and comforting sentimentality of these two instruments.  As a lyricist, Read uses small, poignant sentence fragments, repetition, and wordplay with incredible precision, capturing intimate snapshots within tiny frameworks. Despite the songs’ short lifespan—a minute and half on average—they feel expansive, shapeshifting like shadow puppets on a wall. “I thought of so many things to say to you/But what were they,” Read wonders aloud on “Bust.”  She repeats the latter fragment three times before tagging on “to you,” a subtle semantic layer that underscores the two-way mirror effect of trying to understand someone else’s perspective.\nShe takes some wild lyrical risks on the stunning “M for Mush”: “Must make myself a mold to hold my mushin magic mercy mind,” she sings.  Here, empathy is as pliable as playing with Play-Doh. But, M for Empathy’s most potent moments are when Read travels vast space, whether through an instrumental transition or an existential concern. Misunderstanding is not the only obstacle to empathy—death also has a troublesome way of intervening.“What If I die before I get to know ya more?” she asks on “M for Me,” her voice fragile.\nRead understands that in many ways empathy is not completely possible. It’s not as simple as saying “I understand,” but reaching out to others and possibly saving someone’s life—on “Slide,” Read sings about depression and a friend’s phone call that saved her. She doesn’t perform empathy here; she investigates it. By erasing the extraneous detail from her lyrics, she leaves space for our imagination and even some room for us to insert ourselves.\n", "pptitle": ["m", "empathi"]}