{"id": "PF_104", "url": "https://pitchfork.com/reviews/albums/angel-ho-death-becomes-her/", "name": ["Death", "Becomes", "Her"], "description": ["cape", "town", "produc", "angelho", "use", "music", "medium", "articul", "recur", "violenc", "nonwhit", "bodi", "violenc", "method", "symptom", "centuri", "coloni", "observ", "reflect", "philosophi", "non", "worldwid", "transcontinent", "label", "cofound", "richmond", "chino", "amobi", "london", "nkisi", "interest", "dialogu", "countri", "consid", "coloni", "histori", "angelho", "told", "fader", "creat", "music", "that", "resist", "non", "creat", "borderless", "network", "african", "artist", "diaspora", "set", "counter", "oppress", "coloni", "forc", "angelho", "explor", "theme", "instrument", "2015", "debut", "ep", "ascens", "set", "viscer", "postindustri", "beat", "debut", "album", "death", "add", "necksnap", "rap", "product", "use", "voic", "tool", "quest", "dislodg", "gender", "binari", "power", "hierarchi", "black", "tran", "woman", "hyperdub", "emerg", "pop", "star", "shapeshift", "artist", "just", "comfort", "toy", "experiment", "sound", "invok", "missi", "elliott", "death", "angelho", "beauti", "transmut", "past", "anguish", "color", "network", "global", "sonic", "bold", "statement", "tran", "feminin", "ralli", "resist", "angelho", "shatter", "binari", "encompass", "dualiti", "apocalypt", "drum", "crash", "sampl", "muse", "recal", "brutal", "jag", "beat", "electron", "envelopepush", "rabit", "arca", "angelho", "collabor", "track", "clearli", "meant", "danc", "industri", "sampl", "flutter", "pulsat", "groov", "angelho", "spit", "sear", "bar", "beat", "pose", "move", "queer", "rapper", "le1f", "mykki", "blanco", "respons", "break", "barrier", "respect", "hiphop", "scene", "angelho", "pull", "past", "challeng", "moment", "referenc", "reflect", "turnofthemillenium", "rb", "mirror", "cadenc", "aaliyah", "tri", "live", "interpol", "lumide", "intern", "hit", "leav", "incorpor", "diwali", "riddim", "pose", "dispar", "sourc", "stem", "african", "diaspora", "collect", "encompass", "broader", "experi", "share", "queer", "peopl", "color", "world", "flip", "mean", "familiar", "song", "electrifi", "deliveri", "angelho", "bend", "old", "pop", "trope", "repurpos", "classic", "hook", "bee", "gee", "stayin", "aliv", "live", "point", "decis", "consid", "tran", "peopl", "persecut", "stagger", "rate", "globe", "angelho", "screech", "lyric", "urgenc", "contrast", "gibb", "cool", "white", "falsetto", "high", "triumphantli", "yell", "notori", "referenc", "duran", "duran", "song", "biggi", "famous", "sampl", "queenli", "declar", "angelho", "find", "power", "put", "pedest", "constantli", "compar", "icon", "women", "she", "symphon", "bjrk", "danc", "like", "britney", "marilyn", "monro", "wish", "boast", "underneath", "desir", "rever", "idol", "need", "respect", "muse", "pound", "hous", "beat", "angelho", "regal", "announc", "longer", "beaten", "abusedy", "girl", "paid", "duesyou", "muse", "echo", "sentiment", "share", "tran", "women", "avoid", "target", "violenc", "publicli", "pass", "ci", "woman", "fuel", "aspir", "embodi", "femal", "fantasi", "idea", "basi", "like", "girl", "singsong", "choru", "reiter", "simpl", "sentiment", "infinit", "pop", "song", "girlin", "lone", "world", "sung", "angelho", "radic", "statement", "face", "dont", "believ", "tran", "womanhood", "deserv", "regard", "womanhood", "want", "girl"], "date_published": ["2019-03-04T06:00:00"], "sentiment": 0.14502719502719505, "content": "Cape Town producer Angel-Ho uses music, as she once put it, as a “medium to articulate the recurring violence on non-white bodies.” That violence is both the method and symptom of centuries of colonialism, an observation reflected in the philosophy of NON Worldwide, the transcontinental label she co-founded with Richmond’s Chino Amobi and London’s Nkisi. “It was interesting for me to have this dialogue between [these countries], considering our colonial histories,” Angel-Ho told The Fader. “And creating music that’s in resistance.” NON has created a borderless network of African artists and those of the diaspora, all set on countering oppressive colonial forces.\nAngel-Ho explored these themes instrumentally on her 2015 debut EP, Ascension, a set of visceral, post-industrial beats. On her debut album, Death Becomes Her, she adds neck-snapping rap to the production, using her voice as a tool in her quest to dislodge gender binaries and power hierarchies. A black trans woman, she is Hyperdub’s first emerging pop star, a shape-shifting artist who is just as comfortable toying with experimental sounds as she is invoking Missy Elliott. On Death Becomes Her, Angel-Ho beautifully transmutes any past anguish into a colorful network of global sonics, a bold statement of trans femininity, and a rallying cry for resistance. At once, Angel-Ho shatters binaries and encompasses dualities.\nThe apocalyptic drums and crashing samples of “Muse to You” recall the most brutal, jagged beats from electronic envelope-pushers Rabit and Arca, both Angel-Ho collaborators. But these tracks are clearly meant for dancing, their industrial samples fluttering over pulsating grooves. And when Angel-Ho spits searing bars over these beats, as on “Pose,” she moves toward queer rappers Le1f and Mykki Blanco, both responsible for breaking barriers in their respective hip-hop scenes.\nAngel-Ho also pulls the past into this challenging moment, referencing and reflecting turn-of-the-millenium R&B. She mirrors the cadence of Aaliyah’s “Try Again” during “Live” and interpolates Lumidee’s international hit “Never Leave You” (which itself incorporates the Diwali Riddim) for “Pose.” All these disparate sources stem from the African diaspora, collectively encompassing a broader experience shared by queer people of color around the world. Flipping meanings of familiar songs with her electrifying delivery, Angel-Ho bends old pop tropes, too. She repurposes the classic hook of the Bee Gees’ “Stayin’ Alive” for “Live,” a pointed decision considering that trans people are persecuted at staggering rates around the globe. Angel-Ho screeches the lyrics with urgency, the contrast with the Gibbs’ cool white falsettos high. Elsewhere, she triumphantly yells “Notorious!,” referencing the Duran Duran song that Biggie famously sampled. It becomes a queenly declaration.\nAngel-Ho finds power from putting herself on a pedestal, constantly comparing herself to iconic women. She’s “symphonically Björk” or dancing around like Britney. Marilyn Monroe wishes she were her, she boasts. But underneath the desire to be revered and idolized is the need to be respected. During “Muse to You,” over a pounding house beat, Angel-Ho regally announces, “No longer beaten and abused/You are the girl who paid her dues/You are the muse.” It echoes a sentiment shared by many trans women who can only avoid being targeted for violence when they publicly pass as a cis woman, fueling their aspirations to embody a female fantasy.\nThis idea is the basis of “Like a Girl,” whose sing-song chorus reiterates the simple sentiment of infinite pop songs before it: “I can be your girl/In this lonely world.” Sung by Angel-Ho, though, it becomes a radical statement in the face of the those who don’t believe that trans womanhood deserves to be regarded as womanhood. If she wants to be “your girl,” she can.\n", "pptitle": ["death"]}