{"id": "RS_48", "url": "https://www.rollingstone.com/music/music-album-reviews/futures-the-wizrd-album-review-781487/", "name": ["Future’s", "‘The", "Wizrd’", "Is", "A", "Fitting", "End", "To", "A", "Seven-Album", "Journey", "–", "Rolling", "Stone"], "description": ["futur", "reign", "unsustain", "nearli", "decad", "nayvadiu", "wilburn", "play", "kirkwood", "atlanta", "underdogturnedvillain", "name", "super", "futur", "futur", "hendrix", "marshal", "futur", "astronaut", "kid", "pluto", "alter", "ego", "sang", "rap", "growl", "stori", "drug", "addict", "poverti", "proud", "misogyni", "toxic", "allur", "mixtur", "spoke", "million", "fan", "intens", "devot", "love", "song", "pharmaceut", "codein", "crazi", "perki", "call", "beef", "song", "past", "lover", "collect", "throw", "away", "tryna", "make", "pop", "star", "monster", "infam", "rap", "2015", "year", "later", "selfdiagnosi", "get", "sixthgrad", "did", "influenc", "drink", "lean", "futur", "told", "roll", "stone", "recent", "interview", "discuss", "revel", "music", "inspir", "collabor", "juic", "wrld", "tri", "lean", "child", "shit", "realli", "fuck", "minut", "think", "like", "damn", "peopl", "did", "question", "suggest", "futur", "remors", "afterglow", "phase", "career", "make", "wizrd", "reportedli", "kick", "lean", "took", "year", "make", "music", "recalibr", "album", "result", "turn", "dark", "cocki", "measur", "angri", "20", "song", "sound", "like", "final", "gasp", "futur", "past", "deprav", "undercut", "need", "solidifi", "stand", "influenti", "artist", "decad", "futur", "spend", "album", "demand", "proper", "credit", "rap", "like", "bitter", "father", "disgust", "music", "progeni", "im", "god", "niggasi", "work", "hard", "just", "spoil", "niggasy", "need", "pay", "respect", "say", "krazi", "true", "offer", "list", "he", "given", "ungrat", "flock", "rang", "inan", "sock", "ring", "detail", "mixtap", "rollout", "plan", "adlib", "rocket", "ship", "devot", "line", "choru", "assur", "listen", "poppin", "demo", "hyperbol", "touch", "say", "reason", "wizrd", "culmin", "chapter", "futur", "discographi", "attempt", "write", "definit", "version", "stori", "he", "told", "time", "line", "sleep", "floor", "child", "get", "shot", "day", "drug", "dealer", "arent", "new", "discographi", "instead", "feel", "like", "flashback", "new", "listen", "speed", "ask", "credit", "he", "underlin", "unlik", "younger", "self", "surviv", "remak", "popular", "rap", "imag", "major", "differ", "futur", "earlier", "work", "album", "sens", "equilibrium", "past", "clear", "delin", "rb", "album", "honest", "hndrxx", "rap", "album", "ds2", "futur", "longer", "serv", "purpos", "temptat", "featur", "futur", "croon", "sweet", "chirp", "sampl", "provid", "drake", "produc", "tay", "keith", "hard", "hard", "perki", "sane", "sing", "dawg", "dawg", "em", "lock", "cage", "song", "end", "futur", "sampl", "swirl", "falsetto", "line", "ayi", "2013", "song", "honest", "employ", "similar", "tactic", "baptiiz", "sampl", "metro", "boomin", "beat", "ds2", "slave", "master", "callback", "reward", "longtim", "fan", "harken", "futur", "bestlov", "malign", "project", "wizrd", "persona", "magic", "come", "mine", "past", "place", "context", "present", "20track", "run", "order", "wizrd", "song", "start", "blend", "especi", "subject", "matter", "center", "futur", "interest", "topic", "wealth", "tell", "futur", "sound", "revit", "work", "alongsid", "upandcom", "produc", "like", "tay", "keith", "atl", "jacob", "stop", "rocket", "ship", "he", "share", "spotlight", "young", "thug", "gunna", "unicorn", "purp", "album", "devot", "sell", "legend", "worth", "note", "standout", "moment", "come", "peopl", "manag", "use", "futur", "blueprint", "escap", "massiv", "shadow", "wizrd", "album", "futur", "current", "majorlabel", "deal", "effect", "reinforc", "qualiti", "turn", "star", "outlin", "ragstorich", "stori", "time", "werent", "pay", "attent", "plenti", "rapper", "futur", "mold", "2019", "duplic", "pain", "heartach", "turmoil", "turn", "demon", "captiv", "creativ", "asset", "thing", "wizrd", "doesnt", "quit", "manag", "kill", "selfproclaim", "monster", "ident", "offer", "clear", "indic", "creativ", "phase", "entail", "instead", "suggest", "stori", "need", "clear", "resolut", "futur", "got", "far", "give", "impuls", "right", "end", "era", "way", "start"], "date_published": ["2019-01-22T19:49:40+00:00"], "sentiment": 0.08746097652347652, "content": "Future's reign was always unsustainable. For nearly a decade, Nayvadius Wilburn played a Kirkwood, Atlanta, underdog-turned-villain with many names: Super Future, Future Hendrix, Fire Marshal Future, Astronaut Kid, Pluto. His alter egos sang, rapped and growled stories of drug addiction, poverty and proud misogyny, a toxic but alluring mixture that spoke to millions of fans. At his most intense, he devoted his love songs to pharmaceuticals (“Codeine Crazy,” “Perkys Calling”) and his beef songs to past lovers (“My Collection,” “Throw Away”). “Tryna make a pop star and they made a monster,” he infamously rapped in 2015. Less than four years later, that self-diagnosis seems to be getting to him.\r\n\r\n“How many other sixth-graders did I influence to drink lean?” Future told Rolling Stone in a recent interview, discussing the revelation that his music inspired collaborator Juice WRLD to try lean as a child. “This shit really fucked me up for a minute. It’s all I could think about. Like, ‘Damn, what have I done? What have I done to other people? What I did to myself?'”\r\n\r\nAs those questions suggest, Future is now in the remorseful afterglow phase of his career. Before making The Wizrd, he reportedly kicked lean, took most of a year off from making music, and recalibrated. Yet the album that resulted is by turns dark, cocky, measured and angry. Its 20 songs sound like the final gasp of Future's past depravity, undercut by his need to solidify his standing as one of the most influential artists of the last decade.\r\n\r\nFuture spends much of this album demanding proper credit, rapping like a bitter father disgusted with his musical progeny. \"I'm god to you niggas/I worked too hard just to spoil you niggas?/You need to pay me my respects,\" he says on \"Krazy But True.\" Then he offers a list of everything he's given his ungrateful flock, ranging from the inane (socks, rings) to the more detailed (mixtape rollout plans, ad-libs). On \"Rocket Ship,\" he devotes the first line of the chorus to assuring listeners that he was \"poppin' since my demos.\" It's a hyperbolic touch, but he says it for a reason. The Wizrd is a culminating chapter in Future's discography, an attempt to write the definitive version of a story he's told many times before. Lines about sleeping on floors as a child or getting shot during his days as a drug dealer aren’t new in his discography — instead, they feel like flashbacks to get new listeners up to speed. When he asks for credit, he's underlining how unlikely it was for his younger self not only to survive, but to remake popular rap in his image.\r\n\r\nOne major difference from Future's earlier work is this album's sense of equilibrium. In the past, he made clear delineations between his R&B albums (Honest, HNDRXX) and his rap albums (DS2, FUTURE), but that no longer serves his purpose. \"Temptation\" features Future crooning over a sweet, chirping sample provided by Drake producer Tay Keith. \"It's so hard, it's so hard, these Perkys keep me sane,\" he sings. \"All my dawgs, all my dawgs, found 'em locked up in the cage.\" Before the song ends, Future samples the swirling falsetto line \"Ayy, what it do\" from his 2013 song \"Honest.\" He employs a similar tactic on \"Baptiize,\" which samples Metro Boomin's beat from DS2's \"Slave Master.\" These callbacks reward longtime fans, harkening back to some of Future's best-loved and most maligned projects. His Wizrd persona's magic comes from mining his past and placing it in the context of his present.\r\n\r\nWith a 20-track running order, The Wizrd's songs start to blend together, especially when the subject matter centers on Future’s least interesting topic: his wealth. It’s telling that Future sounds most revitalized when working alongside up-and-coming producers like Tay Keith and ATL Jacob (“Never Stop,” “Rocket Ship”), or when he's sharing the spotlight with Young Thug and Gunna on “Unicorn Purp.” For an album so devoted to selling his own legend, it’s worth noting that the standout moments often come from people who managed to use Future's blueprint to escape from under his massive shadow.\r\n\r\nThe Wizrd is the last album in Future's current major-label deal, and it's effective at reinforcing the qualities that turned him into a star, as well as outlining his rags-to-riches story one more time for those who weren’t paying attention. Plenty of rappers are made in Future’s mold in 2019, but few of them can duplicate the pain, heartache and turmoil that turned his demons into his most captivating creative asset. One thing the The Wizrd doesn’t quite manage to do is kill off his self-proclaimed monster identity — or offer a clear indication of what his next creative phase might entail. Instead, it suggests that this part of his story might not need a clear resolution. Future got this far giving into his impulses; it’s only right he ends an era the way it started.", "pptitle": ["futur", "wizrd", "fit", "end", "sevenalbum", "journey", "roll", "stone"]}