{"id": "UN_28", "url": "https://www.uncut.co.uk/news/anne-briggs-never-empowered-important-109678", "name": ["Anne", "Briggs:", "\"I", "was", "never", "empowered", "to", "be", "important\"", "-", "Uncut"], "description": ["wildest", "talent", "gener", "ann", "brigg", "retir", "music", "1973", "leav", "hand", "record", "rare", "remark", "interview", "latest", "issu", "uncut", "shop", "avail", "order", "onlin", "elus", "folk", "singer", "talk", "frankli", "jim", "wirth", "extraordinari", "life", "brief", "indel", "career", "end", "soonord", "latest", "issu", "uncut", "onlin", "sent", "homeiv", "outsid", "kind", "person", "say", "brigg", "ive", "profession", "garden", "form", "ive", "spent", "past", "20", "year", "outdoor", "contract", "forestri", "commiss", "crown", "prosecut", "servic", "help", "guy", "do", "commun", "servic", "keep", "client", "occupiedin", "11", "year", "singer", "brigg", "releas", "ep", "fulllength", "album", "record", "track", "topic", "record", "compil", "album", "1963", "iron", "muse", "1966", "sauci", "bird", "bush", "1963", "1964", "edinburgh", "folk", "festiv", "lp", "factor", "sing", "song", "song", "recent", "ep", "piec", "scaveng", "old", "radio", "session", "live", "tape", "entir", "record", "output", "amount", "bare", "hour", "music", "extraordinari", "power", "voic", "supernatur", "clear", "etern", "distant", "given", "brigg", "abid", "appeal", "like", "contemporari", "love", "dispassion", "deliveri", "anni", "stark", "modern", "folk", "polymath", "eliza", "carthi", "tell", "uncut", "direct", "deliveri", "puriti", "voic", "like", "dagger", "cut", "right", "youit", "album", "add", "steve", "ashley", "brigg", "longterm", "friend", "onetim", "collabor", "hear", "magic", "complet", "unpredictableon", "bad", "night", "brigg", "dissolv", "stage", "forget", "lyric", "abandon", "song", "battl", "profoundli", "ambival", "attitud", "perform", "sang", "eye", "tight", "shut", "make", "attempt", "reach", "crowd", "transcend", "night", "one", "manag", "blank", "audienc", "entir", "sing", "say", "momentarili", "cheeri", "hate", "audienc", "nervou", "just", "fuck", "nervou", "im", "fuck", "nervou", "didnt", "like", "watch", "didnt", "like", "have", "photograph", "taken", "felt", "empow", "importanti", "resent", "huge", "age", "11", "way", "girl", "treat", "wasnt", "allow", "wear", "trouser", "real", "outdoor", "girl", "wood", "time", "havent", "got", "trouser", "just", "end", "scratch", "legsin", "villag", "came", "known", "bohemian", "say", "roll", "eye", "quit", "hard", "work", "uncl", "aunt", "littl", "villag", "commun", "wasnt", "behav", "right", "way", "didnt", "way", "just", "saw", "inevit", "pursu", "possibl", "particularli", "piss", "role", "life", "workingclass", "girl", "piss", "aw", "twist", "finger", "hairdress", "clever", "girl", "hairdress", "aspir", "littl", "salonsuch", "unworldli", "spent", "summer", "1967", "live", "beach", "west", "ireland", "experi", "recount", "stark", "signatur", "tune", "live", "water", "key", "line", "need", "compani", "make", "enemi", "did", "live", "beach", "say", "week", "total", "happi", "didnt", "want", "tie", "anybodi", "put", "pressur", "didnt", "want", "ityou", "read", "extraordinari", "encount", "ann", "brigg", "current", "issu", "uncut", "shop", "john", "lennon", "coversubscrib", "uncut", "make", "huge", "save", "cover", "price", "click", "like", "facebook", "follow", "twitter", "date", "latest", "news", "uncutth", "april", "2019", "issu", "uncut", "sale", "uk", "john", "lennon", "cover", "insid", "youll", "keith", "richard", "ann", "brigg", "edwyn", "collin", "lou", "reed", "humbl", "pie", "robert", "forster", "jenni", "lewi", "jame", "brown", "15track", "cd", "showcas", "best", "month", "new", "music", "includ", "pond", "ex", "hex", "hand", "habit", "lambchop", "stephen", "malkmu", "kel", "assouf", "patti", "griffinuncut", "past", "present", "futur", "great", "music"], "date_published": ["2019-03-01T12:38:31+00:00", "2019-03-01T12:38:31+00:00"], "sentiment": 0.06707447644947645, "content": "One of the wildest talents of her generation, Anne Briggs retired from music in 1973, leaving only a handful of recordings behind her. In a rare and remarkable interview in the latest issue of Uncut – in shops now and available to order online here – this most elusive of folk singers talks frankly with Jim Wirth about her extraordinary life, her brief but indelible career, and why it had to end so soon.Order the latest issue of Uncut online and have it sent to your home!“I’ve always been an outside kind of person,” says Briggs. “I’ve been a professional gardener in one form and another. I’ve spent the past 20 years outdoors; \u2028I had a contract with the Forestry Commission and then with the Crown Prosecution Service, helping the guys who are doing community service – keeping their \u2028clients occupied.”In 11 years as a singer, Briggs released an EP and two full-length albums, as well as recording tracks for two Topic Records compilation albums – 1963’s The Iron Muse and 1966’s saucy The Bird In The Bush – and 1963 and 1964’s Edinburgh Folk Festival LPs. Even factoring in Sing A Song For You and “Four Songs” – a more recent EP of pieces scavenged from old radio sessions and a live tape – her entire recorded output amounts to barely three hours of music. However, the extraordinary power of her voice, supernaturally clear and eternally distant, has given Briggs an abiding appeal like few of her contemporaries. “I love the almost dispassionate delivery of Annie, and the starkness,” modern folk polymath Eliza Carthy tells Uncut. “The directness of the delivery and the purity of her voice – it’s like \u2028a dagger. It cuts right through you.”“It’s all there on the albums,” adds Steve Ashley, Briggs’ long-term friend and one-time collaborator. “You can still hear that magic. She was also completely unpredictable.”On bad nights, Briggs dissolved on stage, forgetting lyrics and abandoning songs as she battled with her profoundly ambivalent attitude to performing. She always sang with her eyes tight shut, making no attempt to reach out to the crowd; her transcendent nights might be the ones when she managed to blank the audience out entirely. “I was always singing to myself,” she says, momentarily cheery. “I hated being in front of an audience. I was nervous. I was just so fucking nervous. I’m so fucking nervous being here with you. \u2028I didn’t like being watched. I didn’t like having my photograph taken. Perhaps I felt that I was never empowered to be important.”“I resented hugely, from the age of about 11, the way that girls were treated. I wasn’t allowed to wear trousers! I was a real outdoor girl, out in the woods all the time, and if you haven’t got trousers you just end up with scratched legs.“In the village I came from I was known as ‘the Bohemian’,” she says, rolling her eyes. “I was quite hard work for my uncle and aunt, because we were in this little \u2028village community and I wasn’t behaving in the right way. I didn’t \u2028see it that way. I just saw there was an inevitability that I had to pursue all possibilities, and I was particularly pissed off with the \u2028role in life for working-class girls. So pissed off. It was awful.” She twists her fingers. “That I would be a hairdresser. I was a clever girl! \u2028A hairdresser! That was the aspiration: your own little salon.”Such was her unworldliness that she spent part of the summer of 1967 living alone on a beach in the west of Ireland, an experience she recounted on her stark signature tune “Living By The Water” – key line: “Because I need no company, I make no enemies.” “I did live on a beach,” she says. “Alone. For several weeks. I was totally happy with that. I didn’t want \u2028to be tied down; anybody putting pressure on me, \u2028I didn’t want it.”You can read much more from this extraordinary encounter with Anne Briggs in the current issue of Uncut, in shops now with John Lennon on the cover.Subscribe to Uncut and make huge savings on the cover price – find out by clicking here! Like us on Facebook or follow us on Twitter to keep up to date with the latest news from Uncut.The April 2019 issue of Uncut is now on sale in the UK – with John Lennon on the cover. Inside, you’ll find Keith Richards, Anne Briggs, Edwyn Collins, Lou Reed, Humble Pie, Robert Forster, Jenny Lewis, James Brown and much more. Our 15-track CD also showcases the best of the month’s new music, including Pond, Ex Hex, Hand Habits, Lambchop, Stephen Malkmus, Kel Assouf and Patty Griffin.Uncut: the past, present and future of great music.", "pptitle": ["ann", "brigg", "empow", "import", "uncut"]}