{"id": "PF_15", "url": "https://pitchfork.com/reviews/albums/jenny-lewis-on-the-line/", "name": ["On", "the", "Line"], "description": ["good", "storytel", "detail", "long", "fourth", "solo", "album", "line", "jenni", "lewi", "introduc", "narcolept", "poet", "duluth", "spar", "elliott", "smith", "grenadin", "father", "use", "sing", "littl", "ditti", "year", "threw", "away", "heroin", "east", "girl", "call", "carolin", "lover", "bitterli", "lost", "there", "mention", "candi", "crush", "slipn", "slide", "rambo", "marlboro", "meryl", "streep", "tear", "dorothi", "rubi", "slipper", "don", "quixot", "rivalri", "beatl", "roll", "stone", "bridg", "la", "cross", "wisconsin", "coupl", "differ", "kind", "fanci", "car", "disgustingsound", "drink", "truli", "stagger", "illeg", "drug", "burst", "specif", "fuel", "vivid", "scene", "impressionist", "turn", "phrase", "alik", "line", "usher", "long", "gestat", "creator", "bit", "bit", "doe", "love", "rabbit", "fur", "coat", "aloha", "john", "jenni", "lewi", "reach", "troubadour", "phase", "she", "tell", "tale", "like", "sing", "live", "studio", "charismat", "lead", "band", "includ", "elder", "statesmen", "like", "benmont", "tench", "don", "mention", "cameo", "ringo", "starr", "beck", "ryan", "adam", "record", "alleg", "emerg", "acid", "tongu", "2008", "2014", "voyag", "shed", "twee", "sensibl", "lewi", "rilo", "kiley", "day", "edg", "littl", "closer", "skeptic", "stevi", "nick", "old", "millenni", "journey", "continu", "line", "consist", "wonder", "jenni", "lewi", "music", "go", "rilo", "kiley", "quickli", "allow", "protagonist", "carri", "away", "daydream", "tangent", "emot", "imagin", "declar", "manifest", "music", "like", "song", "goe", "lofi", "black", "white", "technicolor", "cinemat", "flash", "sprawl", "ballad", "dogwood", "start", "quiet", "hear", "ambient", "studio", "nois", "entertain", "moodi", "johnni", "marrish", "guitar", "interlud", "float", "stop", "song", "just", "gotta", "sang", "moment", "complet", "warm", "layer", "vocal", "percuss", "emit", "kind", "subtl", "boom", "poof", "memori", "fall", "away", "she", "just", "piano", "faraway", "voic", "simpl", "observ", "dogwood", "tree", "bloom", "natur", "sound", "lewi", "play", "piano", "carol", "king", "record", "tapestri", "quietli", "resign", "fact", "human", "bodi", "motion", "stay", "motion", "bullshit", "damn", "flip", "line", "coupl", "song", "trade", "stark", "lucid", "abstract", "frivol", "stand", "precis", "posit", "strongest", "songwrit", "lewi", "career", "track", "preced", "dogwood", "si", "split", "differ", "tame", "impala", "modernday", "beck", "produc", "find", "catchi", "sweet", "spot", "music", "lyric", "laps", "non", "sequitur", "dont", "entir", "land", "aint", "ghetto", "joyour", "payrol", "close", "track", "rabbit", "hole", "feel", "slightli", "clichd", "central", "metaphor", "go", "alic", "rabbit", "hole", "ex", "familiar", "unplac", "melodi", "poprock", "product", "style", "halfdecad", "late", "certain", "skeptic", "surround", "lewi", "overt", "attempt", "hitmak", "2007", "blacklight", "stem", "uncanni", "abil", "write", "classic", "pop", "song", "forev", "lodg", "brain", "pepper", "lyric", "aesthet", "marker", "like", "emo", "sensibl", "chintzi", "drum", "machin", "unshak", "specif", "proxim", "concern", "half", "just", "doesnt", "especi", "lewi", "give", "album", "best", "moment", "wast", "youth", "hand", "song", "reckon", "famili", "demon", "light", "lewi", "estrang", "drugaddict", "mother", "battl", "cancer", "plucki", "pianopop", "tune", "haunt", "rock", "weari", "soul", "manifest", "catchi", "slightli", "eeri", "choru", "addict", "wast", "youth", "poppi", "doo", "doo", "doo", "doo", "doo", "doo", "just", "fun", "sing", "lewi", "stretch", "falsetto", "disarm", "delic", "time", "album", "toughest", "scene", "lewi", "stay", "cool", "importantli", "funki", "littl", "white", "dove", "relaxedfit", "bass", "groov", "stutter", "drum", "propel", "surreal", "hospit", "visit", "daughter", "bigger", "person", "forgiv", "ail", "mother", "im", "heroin", "sing", "littl", "detach", "lean", "homonym", "kind", "seemingli", "simpl", "line", "jenni", "lewi", "wring", "emot", "truth", "sign", "good", "storytel"], "date_published": ["2019-03-25T05:00:00"], "sentiment": 0.11625130270963603, "content": "Good storytelling is in the details. Not long into her fourth solo album, On the Line, Jenny Lewis introduces a narcoleptic poet from Duluth, with whom she spars over everything from Elliott Smith to grenadine; a father who used to sing a little ditty about all the years he threw away on heroin; an East Side girl called Caroline, to whom a lover is bitterly lost. There’s mention of Candy Crush, Slip’N Slides, Rambo, Marlboros, Meryl Streep’s tears, Dorothy’s ruby slippers, Don Quixote, the rivalry between the Beatles and the Rolling Stones, the bridge in La Crosse, Wisconsin, a couple different kinds of fancy cars, one disgusting-sounding drink, and a truly staggering amount of illegal drugs.\nBursting with all this specificity, which fuels vivid scenes and impressionistic turns of phrase alike, On the Line ushers in something that has long been gestating in its creator, bit by bit with every “Does He Love You,” “Rabbit Fur Coat,” and “Aloha & the Three Johns”: Jenny Lewis has reached her troubadour phase. She’s telling tales like never before, singing live in the studio while charismatically leading a band that includes elder statesmen like Benmont Tench and Don Was, not to mention cameos from Ringo Starr, Beck, and Ryan Adams (recorded before the allegations against him emerged). Acid Tongue, from 2008, and 2014’s The Voyager shed more of that twee sensibility from Lewis’ Rilo Kiley days, edging her a little closer to a skeptical Stevie Nicks for old millennials. That journey continues with On the Line.\nSomething consistently wonderful about Jenny Lewis’ music, going back to Rilo Kiley, is how quickly she allows her protagonists to get carried away into daydreams, tangents of emotion, and imagined declarations. Sometimes this manifests musically, like when a song goes from lo-fi black and white to technicolor and cinematic in a flash. On the sprawling ballad “Dogwood,” she starts off so quiet you can hear ambient studio noises. She entertains a moody, Johnny Marr-ish guitar interlude, then floats into a stop the song, I just gotta sang moment, complete with warm layers of her own vocals and the percussion emitting a kind of subtle “boom.” Then poof, the memory falls away, and she’s back to just her piano and her far-away voice and her simple observation that the dogwood trees are in bloom again. How natural it sounds, Lewis playing the piano that Carole King recorded Tapestry on, quietly resigned to the fact that two human bodies in motion will stay in motion, bullshit be damned.\nOn the flip side of On the Line, there are a couple of songs that trade stark lucidity for abstraction, and their frivolity stands out precisely because of their position next to some of the strongest songwriting of Lewis’ career. The track preceding “Dogwood,” “Do Si Do,” splits the difference between Tame Impala and modern-day Beck (he produced it, along with two others here) and finds a catchy sweet spot musically, but the lyrics lapse into non sequiturs that don’t entirely land (“This ain’t no ghetto, Jo/You’re on the payroll!”). And closing track “Rabbit Hole” feels slightly clichéd, from the central metaphor of going down Alice’s rabbit hole with an ex to the familiar but unplaceable melody to the pop-rock production style that seems a half-decade or so too late.\nThere has always been a certain amount of skepticism surrounding Lewis’ more overt attempts at hit-making (see: 2007’s Under the Blacklight), and part of that stems from her uncanny ability to do both: write classic pop songs that will forever lodge themselves into your brain and pepper them with lyrics (and aesthetic markers like an emo sensibility or a chintzy drum machine) that are unshakeable in their specificity and proximity to your own concerns. Half just doesn’t seem enough, especially since Lewis gives it all in the album’s best moments. “Wasted Youth,” among the handful of songs that reckon with family demons in light of Lewis’ estranged drug-addict mother’s battle with cancer, is a plucky piano-pop tune haunted by rock’s weary soul. This manifests in a catchy, slightly eerie chorus about addiction: “I wasted my youth on a poppy, doo doo doo doo doo doo just for fun,” sings Lewis, stretching into her falsetto with a disarming delicateness.\nWhen it’s time for the album’s toughest scene, though, Lewis stays cool and more importantly, funky. On “Little White Dove,” relaxed-fit bass grooves and stuttering drums propel a surreal hospital visit, wherein the daughter must be the bigger person and forgive the ailing mother. “I’m the heroin,” she sings, a little detached, leaning into the homonym. It is from this kind of seemingly simple line that Jenny Lewis often wrings the most emotional truth. That, too, is another sign of good storytelling.\n", "pptitle": ["line"]}