{"id": "PF_83", "url": "https://pitchfork.com/reviews/albums/townes-van-zandt-sky-blue/", "name": ["Sky", "Blue"], "description": ["town", "van", "zandt", "indiffer", "record", "careeror", "resembl", "career", "realli", "certainli", "gave", "music", "busi", "best", "shot", "travel", "nativ", "texa", "nashvil", "cut", "seri", "album", "tini", "label", "poppi", "1968", "1972", "frequent", "collabor", "jack", "clement", "produc", "decid", "ostentati", "augment", "songwrit", "eccentr", "instead", "accentu", "wasnt", "win", "formula", "commerci", "lack", "success", "prolif", "period", "help", "fate", "decad", "wander", "margin", "countri", "americana", "hit", "came", "peoplemerl", "haggard", "willi", "nelson", "took", "pancho", "lefti", "billboard", "countri", "chart", "1987but", "van", "zandt", "wound", "amass", "bodi", "work", "deep", "vari", "songbook", "brought", "life", "singer", "sky", "blue", "posthum", "album", "releas", "week", "wouldv", "turn", "75", "underscor", "notion", "songbook", "town", "van", "zandt", "rifl", "draft", "recent", "work", "punctuat", "origin", "work", "cover", "van", "zandt", "record", "11", "track", "compris", "sky", "blue", "1973", "hedgepeth", "journalist", "singersongwrit", "buddi", "time", "van", "zandt", "just", "wrap", "run", "poppi", "late", "great", "town", "van", "zandt", "knew", "time", "kernel", "truth", "titl", "took", "year", "return", "action", "1978", "flyin", "shoesth", "span", "time", "churn", "record", "poppi", "long", "gap", "album", "standard", "oper", "procedur", "van", "zandt", "singersongwrit", "buy", "time", "gener", "cash", "put", "occasion", "live", "album", "celebr", "1977", "lp", "live", "old", "quarter", "houston", "texa", "set", "captur", "live", "old", "quarter", "record", "1973", "year", "van", "zandt", "cut", "materi", "wound", "sky", "blue", "album", "outset", "van", "zandt", "year", "rambl", "share", "sens", "fresh", "immediaci", "he", "hardli", "brim", "optim", "he", "harden", "alcohol", "later", "took", "life", "live", "old", "quarter", "he", "bless", "addit", "audienc", "presenc", "cajol", "van", "zandt", "display", "wri", "sens", "play", "that", "overlook", "work", "there", "chanc", "underst", "humor", "surfac", "sky", "blue", "record", "lonesom", "hedgepeth", "home", "studio", "van", "zandt", "sing", "run", "risk", "unexpect", "digress", "unless", "choic", "song", "count", "sky", "blue", "offer", "surpris", "chief", "unheard", "van", "zandt", "origin", "need", "open", "album", "soft", "wist", "note", "achiev", "comfort", "melancholi", "sway", "that", "counter", "delic", "bruis", "sky", "blue", "bare", "keep", "sad", "bay", "major", "item", "that", "appeal", "theyr", "finelyetch", "modest", "product", "songwrit", "remain", "dedic", "craft", "light", "easi", "hear", "cover", "richard", "dobson", "forev", "certain", "tom", "paxton", "thing", "mind", "tradit", "folk", "tune", "hill", "roan", "counti", "roundabout", "inspir", "song", "van", "zandt", "began", "explor", "idea", "hed", "later", "develop", "context", "sky", "blue", "help", "make", "album", "feel", "bit", "like", "intim", "live", "set", "van", "zandt", "play", "punter", "he", "play", "song", "suit", "small", "attent", "crowd", "balanc", "cover", "favorit", "pancho", "lefti", "new", "like", "classic", "newer", "song", "sky", "blue", "charm", "deriv", "doesnt", "quit", "slide", "particular", "categori", "live", "album", "album", "set", "demo", "forthcom", "record", "instead", "vivid", "snapshot", "particular", "moment", "preserv", "time", "fritter", "away", "good", "captur", "town", "van", "zandt", "like", "verg", "great", "thing"], "date_published": ["2019-03-11T05:00:00"], "sentiment": 0.13733267828662565, "content": "Townes Van Zandt often seemed indifferent to his recording career—or anything resembling a career, really. He certainly gave the music business his best shot, traveling from his native Texas to Nashville to cut a series of albums for the tiny label Poppy between 1968 and 1972, frequently collaborating with Jack Clement, a producer who decided to ostentatiously augment the songwriter’s eccentricities instead of accentuate them. It wasn’t a winning formula commercially, and his lack of success during his only prolific period helped fate him to decades of wandering on the margins of country and Americana. Hits came for other people—Merle Haggard and Willie Nelson took “Pancho and Lefty” to the top of Billboard’s country charts in 1987—but not for Van Zandt, who wound up amassing not so much a body of work as a deep, varied songbook, which could be brought to life either by himself or other singers.\nOn Sky Blue, a posthumous album released the week he would’ve turned 75, underscores the notion of a songbook, Townes Van Zandt rifles through his drafts and recent work, punctuating his original work with covers. Van Zandt recorded the 11 tracks that comprise Sky Blue in 1973 with Bill Hedgepeth, a journalist who also was one of the singer-songwriter’s buddies. At the time, Van Zandt had just wrapped up his run at Poppy with The Late Great Townes Van Zandt. Nobody knew it at the time, but there was more than a kernel of truth in that title. It took him five years to return to action with 1978’s Flyin’ Shoes—the same span of time in which he had churned out six records for Poppy. Such long gaps between albums became standard operating procedure for Van Zandt, with the singer-songwriter buying time and generating cash by putting out the occasional live album, such as the celebrated 1977 LP Live at the Old Quarter, Houston, Texas.\nThe set captured on Live at the Old Quarter was recorded in 1973, the same year Van Zandt cut the material that wound up on Sky Blue. Both albums were made at the outset of Van Zandt’s years of rambling, so they share a sense of freshness and immediacy; he’s hardly brimming with optimism but he’s yet to be hardened by the alcoholism that later took his life. On Live at the Old Quarter, he’s blessed by the addition of an audience, whose very presence cajoles Van Zandt to display the wry sense of playfulness that’s so often overlooked within his work. There’s no such chance of such understated humor surfacing on Sky Blue, however. Recorded on his lonesome at Hedgepeth’s home studio, Van Zandt is singing to himself. He runs no risk of unexpected digressions, unless the choice of songs counts.\nOn that front, Sky Blue offers a few surprises, chief among them two unheard Van Zandt originals. “All I Need” opens the album on a soft, wistful note, achieving a comforting melancholy sway that’s countered by the delicate, bruised “Sky Blue,” which barely keeps the sadness at bay. Neither are major items but that’s their appeal: They’re finely-etched yet modest, the product of a songwriter who remains dedicated to the craft. In that light, it’s easy to hear his covers of Richard Dobson’s “Forever for Always for Certain” and Tom Paxton’s “The Last Thing on My Mind,” along with the traditional folk tune “Hills of Roane County,” as roundabout inspirations, song where Van Zandt began exploring ideas he’d later develop on his own, but within the context of Sky Blue, they help make the album feel a bit like an intimate live set. Van Zandt may not be playing for punters but he’s playing songs that would suit a small, attentive crowd, balancing covers, favorites (“Pancho and Lefty,” then new but already seeming like a classic) and newer songs.\nMuch of Sky Blue’s charm derives from how it doesn’t quite slide into any particular category. It’s neither a live album nor an album of its own, yet it’s also not a set of demos for a forthcoming record. Instead, it’s a vivid snapshot of a particular moment, preserving a time when he had yet to fritter away his good will, and capturing Townes Van Zandt when it still seemed like he was on the verge of great things.\n", "pptitle": ["sky", "blue"]}