{"id": "PF_3", "url": "https://pitchfork.com/reviews/albums/lambchop-this-is-what-i-wanted-to-tell-you/", "name": ["This", "(Is", "What", "I", "Wanted", "to", "Tell", "You)"], "description": ["there", "trick", "frank", "ocean", "return", "blond", "smother", "voic", "kind", "effect", "long", "stretch", "hell", "cut", "switch", "present", "voic", "nake", "time", "satisfi", "swipe", "wiper", "blade", "raini", "windshield", "lambchop", "kurt", "wagner", "pull", "just", "latest", "album", "want", "tell", "make", "count", "wait", "final", "track", "flower", "big", "reveal", "natur", "60yearold", "voic", "treat", "complet", "album", "begin", "forget", "default", "digit", "croon", "wagner", "trade", "altcountri", "electron", "soul", "2016", "flotusa", "radic", "swap", "execut", "grace", "lovingli", "feel", "like", "natur", "progress", "anybodi", "miss", "record", "surpris", "wagner", "gone", "allin", "vocod", "mutter", "he", "reconfigur", "songwrit", "accommod", "trim", "away", "chamberpop", "adorn", "merri", "excess", "distinguish", "lambchop", "record", "center", "song", "gentl", "prose", "artist", "came", "electron", "music", "late", "life", "remark", "astut", "impuls", "areand", "impress", "consid", "wagner", "background", "altcountri", "genr", "rare", "prone", "innov", "play", "reinvent", "sound", "want", "tell", "wagner", "opt", "tast", "restraint", "track", "cushion", "pillowi", "piano", "massag", "basslin", "album", "boldest", "idea", "underst", "light", "acid", "jazz", "groov", "call", "us3", "earli", "90", "stapl", "cantaloop", "flip", "fantasiayoul", "rememb", "hear", "itbut", "pat", "clever", "occasion", "echo", "bon", "iver", "promin", "indi", "act", "use", "vocal", "manipul", "instrument", "unto", "arent", "entir", "accident", "bon", "iver", "matthew", "mccaughan", "produc", "album", "cowrot", "part", "unlik", "justin", "vernon", "use", "digit", "effect", "push", "voic", "edg", "decay", "22", "million", "wagner", "process", "voic", "obscur", "draw", "warmth", "like", "music", "vocal", "treatment", "fragil", "unpretenti", "obscur", "ask", "decod", "sound", "servic", "intimaci", "lyric", "suggest", "wisdom", "medit", "uncertainti", "air", "heavi", "listen", "reliv", "coupl", "argument", "break", "bout", "sunday", "hous", "clean", "air", "fill", "lemonsc", "displeasur", "recal", "write", "fragment", "mundan", "juxtapos", "direct", "thought", "halfcomplet", "one", "pad", "imageri", "port", "televis", "cabl", "news", "man", "nixon", "tattoo", "presum", "roger", "stone", "random", "unshak", "visual", "serv", "marker", "precis", "moment", "time", "crossword", "say", "lose", "partner", "airport", "enjoy", "moment", "bar", "like", "use", "larger", "right", "observ", "specifi", "modest", "album", "suprem", "pleasur", "wagner", "sound", "humbl", "world", "technolog", "he", "adopt", "flower", "end", "record", "plea", "loveif", "gave", "dollar", "record", "just", "word", "make", "perfect", "song", "singsh", "disarm", "case", "understand", "hard", "imagin", "pull", "set", "master", "intim", "wagner", "quartercenturi", "track", "record", "lambchop", "underscor", "gem", "he", "great", "record", "excit", "unexpect", "one", "comfort", "compassion"], "date_published": ["2019-03-28T05:00:00"], "sentiment": 0.18144132653061226, "content": "There’s a trick Frank Ocean returns to throughout Blonde. After smothering his voice with all kinds of effects for long stretches, he’ll cut the switch and present his voice naked, and every time it’s as satisfying as the first swipe of a wiper blade across a rainy windshield. Lambchop’s Kurt Wagner pulls that move just once on his latest album This (is what I wanted to tell you), but he makes it count, waiting until the final track “Flowers” for the big reveal: His natural, 60-year-old voice, treated so completely throughout the album you begin to forget that he hasn’t always defaulted to a digitalized croon.\nWagner traded alt-country for electronic soul on 2016’s FLOTUS—a radical swap executed so gracefully and lovingly that he somehow made it feel like a natural progression. Still, anybody who missed that record is in for a surprise. Wagner has gone all-in on his vocoded mutter, and he’s reconfigured his songwriting to accommodate it, trimming away the chamber-pop adornments and merry excesses that once distinguished Lambchop’s records to center each song around his gentle prose.\nFor an artist who came to electronic music so late in life, it’s remarkable how astute his impulses are—and even more impressive still considering Wagner’s background in alt-country, a genre that is rarely prone to innovation. Rather than playing up his reinvented sound on This (is what I wanted to tell you), Wagner opts for tasteful restraint. Every track is cushioned with pillowy pianos and massaging basslines. Even the album’s boldest ideas are understated. With its light, acid jazz groove, “Everything is You” calls back to Us3’s early ’90s staple “Cantaloop (Flip Fantasia)”—you’ll remember it when you hear it—but never pats itself on the back for its own cleverness.\nThe occasional echoes of Bon Iver, the most prominent indie act to use vocal manipulation as an instrument unto itself, aren’t entirely accidental, since Bon Iver’s Matthew McCaughan produced the album and co-wrote parts of it. But unlike Justin Vernon, who used digital effects to push his voice to the edge of decay on 22, A Million, Wagner processes his voice not to obscure it but to draw warmth from it. Like the music itself, his vocal treatments are fragile and unpretentious. Nothing is obscured, nothing asks to be decoded. Everything about this sound is done in the service of intimacy.\nAnd so it is with his lyrics, which suggest wisdom even as they meditate on uncertainty. On “The Air is Heavy and I Should Be Listening to You,” he relives a couple’s argument that breaks out during a bout of Sunday house cleaning. “The air is filled with lemon-scented displeasure,” he recalls. He writes in fragments of the mundane, juxtaposing direct thoughts with half-completed ones, then padding them with imagery ported from television and cable news (among them “the man with the Nixon tattoo,” presumably Roger Stone, one of those random, unshakable visuals that will serve as a marker for this precise moment in time). On “Crosswords, or What This Says About You,” he loses his partner at the airport, so he enjoys a moment at the bar. “Seems like they used to be much larger than they are right now,” he observes, never specifying what “they” might be.\nIt’s such a modest album, and yet such it’s a supremely pleasurable one. Wagner sounds humbled by the world, if not the very technology he’s adopted. Before “Flowers” ends the record with a plea for love—“If I gave you a hundred dollars to record just three words, I could make the perfect song,” he sings—he’s made a disarming case for understanding that it’s hard to imagine him pulling off in a setting less masterfully intimate. Wagner’s quarter-century track record with Lambchop only underscores what a gem This is. He’s made great records before, even exciting and unexpected ones, but never one so comforting and compassionate.\n", "pptitle": ["want", "tell"]}