{"id": "PF_23", "url": "https://pitchfork.com/reviews/albums/duster-capsule-losing-contact/", "name": ["Capsule", "Losing", "Contact"], "description": ["recent", "duster", "fan", "felt", "like", "listen", "record", "lost", "memori", "late", "1990", "earli", "2000", "san", "jose", "california", "trio", "craft", "downcast", "lofi", "lent", "introspect", "theyv", "call", "slowcor", "deliber", "pace", "style", "pioneer", "codein", "low", "bedhead", "space", "rock", "genr", "psychedel", "textual", "experiment", "sadcor", "nebul", "scene", "celebr", "experiment", "depress", "music", "multiinstrumentalist", "clay", "parton", "describ", "band", "duster", "fed", "sens", "mysteri", "shi", "away", "press", "avoid", "contextu", "music", "biographi", "began", "hiatu", "2001", "inevit", "faint", "star", "fade", "black", "surpris", "duster", "music", "resurfac", "thank", "combin", "internet", "cratedig", "music", "cultur", "duster", "unexpect", "cult", "favorit", "copi", "debut", "album", "stratospher", "bare", "blip", "radar", "releas", "1998", "began", "command", "200", "discog", "younger", "band", "like", "girlpool", "snail", "mail", "cite", "duster", "influenc", "final", "april", "2018", "duster", "began", "show", "sign", "life", "new", "instagram", "page", "teas", "new", "music", "month", "later", "band", "announc", "concert", "18", "year", "duster", "renaiss", "swing", "numero", "group", "releas", "retrospect", "capsul", "lose", "contact", "compil", "duster", "fulllength", "releas", "ep", "variou", "compil", "track", "unreleas", "loosi", "sleepi", "box", "set", "duster", "selfmytholog", "capsul", "lose", "contact", "doe", "littl", "illumin", "biographi", "present", "band", "progress", "bar", "whirli", "1996", "singl", "east", "reed", "lost", "record", "duster", "proper", "output", "begin", "1997", "transmiss", "flux", "7", "song", "turbul", "fuzzi", "4track", "experiment", "plant", "themat", "seed", "duster", "fascin", "cosmo", "orbitron", "friend", "cosmonaut", "light", "year", "taken", "follow", "year", "apex", "trancelik", "7", "further", "lunar", "motif", "companion", "piec", "hour", "duster", "push", "melancholi", "express", "intens", "desir", "human", "connect", "silent", "float", "figur", "human", "1998", "opu", "stratospher", "duster", "explor", "depth", "astronaut", "melancholia", "like", "atmospher", "layer", "take", "band", "debut", "fulllength", "vast", "expans", "encourag", "mind", "unravel", "endless", "contempl", "use", "simplist", "cyclic", "guitar", "melodi", "thickli", "woven", "electron", "textur", "song", "spiral", "state", "sublim", "half", "17", "track", "atmospher", "instrument", "parton", "bandmat", "canaan", "dove", "amber", "manag", "murmur", "cryptic", "poetic", "vers", "disconnect", "anxieti", "voic", "muffl", "gauz", "near", "end", "stagger", "earth", "moon", "transit", "doe", "clear", "emot", "point", "emerg", "wonder", "think", "like", "youat", "night", "record", "larg", "4track", "cassett", "machin", "product", "assist", "pacif", "northwest", "indi", "rock", "legend", "phil", "ek", "stratospher", "radiat", "intimaci", "starkest", "moment", "overal", "effect", "like", "rest", "beneath", "weight", "blanket", "cocoon", "intrus", "outsid", "world", "open", "track", "stratospher", "establish", "tempo", "wax", "wane", "drone", "gloom", "dreami", "bliss", "duster", "moon", "age", "blippi", "synth", "instrument", "convey", "cosmic", "innoc", "major", "tom", "float", "peculiar", "way", "detach", "tranquil", "immedi", "counter", "stratospher", "upbeat", "song", "head", "door", "gold", "dust", "record", "headi", "introspect", "closest", "duster", "come", "approxim", "happen", "1998", "indi", "rock", "riff", "sound", "like", "wist", "earworm", "cook", "pavement", "year", "earlier", "slowbuild", "standout", "echo", "bravo", "begin", "frenzi", "strungout", "tape", "distort", "burst", "sludgi", "meltdown", "fade", "quiver", "drone", "effect", "immedi", "counter", "listless", "constel", "stratospher", "goe", "undul", "soft", "harsh", "song", "climax", "sevenminut", "titl", "track", "begin", "haze", "rippl", "feedback", "stratospher", "build", "layer", "layer", "disson", "abstract", "fizzl", "accord", "moment", "track", "declin", "arriv", "emot", "destin", "instead", "embrac", "inexplic", "near", "end", "record", "stratospher", "parton", "amber", "brought", "drummer", "jason", "albertini", "origin", "queen", "stone", "age", "member", "end", "join", "duster", "fulltim", "1999", "band", "record", "1975", "ep", "bridg", "stratospher", "hush", "lethargi", "access", "bandmat", "quietli", "work", "spacier", "project", "shortliv", "valium", "aggelein", "includ", "song", "ep", "memphi", "sophist", "thing", "ghost", "unexpectedli", "lucid", "motion", "pictur", "august", "rel", "disappear", "stratospher", "cloudi", "embrac", "close", "track", "want", "light", "shine", "begin", "delic", "reveri", "synthes", "string", "give", "way", "meander", "piano", "melodi", "whisper", "san", "jose", "traffic", "rumbl", "background", "door", "record", "space", "prop", "open", "let", "light", "fulllength", "record", "2000", "contemporari", "movement", "duster", "return", "earth", "compress", "stratospher", "atmospher", "sprawl", "tight", "songori", "packag", "contemporari", "movement", "retain", "predecessor", "escap", "tone", "heavier", "grungi", "time", "overal", "cadenc", "remain", "slow", "allow", "song", "unspool", "patient", "vocal", "consider", "buri", "beneath", "wash", "heavi", "guitar", "analog", "squall", "songwrit", "given", "spotlightalbeit", "dim", "unlik", "stratospher", "orbit", "high", "true", "contact", "unlik", "contemporari", "movement", "long", "emot", "connect", "feel", "hope", "goddamn", "wish", "littl", "bit", "smarter", "goe", "humoursli", "earnest", "line", "breakup", "suit", "moment", "parton", "amber", "gravelli", "warbl", "echo", "nasal", "selfdeprec", "labelm", "modest", "mous", "earli", "droner", "oper", "diamond", "trudg", "blurri", "guitar", "friction", "brood", "drum", "quit", "lift", "ground", "cook", "pick", "mood", "bit", "swirl", "bit", "sunshin", "amidst", "cloud", "euphoria", "freewheel", "stratospher", "feel", "firmli", "tether", "earth", "duster", "went", "extend", "hiatu", "contemporari", "movement", "bandmat", "stop", "collabor", "amber", "parton", "play", "albertini", "project", "helvetia", "parton", "found", "label", "static", "cult", "releas", "helvetia", "record", "eiafuawn", "bandmat", "move", "music", "duster", "retain", "ineff", "qualiti", "band", "sought", "defin", "time", "contemporari", "movement", "conclud", "express", "uncertainti", "audienc", "find", "feetclap", "screambut", "doe", "mean", "duster", "reunion", "concert", "decemb", "2018", "line", "felt", "eerili", "salient", "strang", "hear", "intens", "privat", "person", "music", "crowd", "end", "song", "awkward", "uncertainti", "clap", "end", "did", "peopl", "scream", "unspeak", "linger", "long", "band", "left", "stage", "capsul", "lose", "contact", "welcom", "survey", "duster", "legaci", "opportun", "appreci", "modest", "band", "mean", "differ"], "date_published": ["2019-03-27T05:00:00"], "sentiment": 0.04164177489177489, "content": "Until very recently, being a Duster fan felt much like listening to their records: being lost in a memory. From the late 1990s to the early 2000s, the San Jose, California trio crafted downcast lo-fi that lent itself to introspection. They’ve been called slowcore, the deliberately paced style pioneered by Codeine, Low, and Bedhead; space rock, a genre of psychedelic textual experimentations; and sadcore, the nebulous scene that celebrated nothing. “Experimental depressive music” is how multi-instrumentalist Clay Parton once described his band. Duster fed a sense of mystery by shying away from press and avoiding contextualizing their music with biography. When they began a hiatus in 2001, it seemed inevitable that their faint star would fade to black.\nBut much to their surprise, Duster’s music resurfaced. Thanks to some combination of the internet and crate-digging music culture, Duster became an unexpected cult favorite. Copies of their debut album, Stratosphere, barely a blip on the radar when it was first released in 1998, began to command as much as $200 on Discogs. Younger bands like Girlpool and Snail Mail cited Duster as an influence. Finally, in April 2018, Duster began showing signs of life. A new Instagram page teased new music, and a few months later, the band announced their first concert in 18 years. With the Duster Renaissance in full swing, Numero Group has released the retrospective Capsule Losing Contact, which compiles Duster’s two full-length releases, three EPs, various compilation tracks, and unreleased loosies into a sleepy box set.\nDuster have never been self-mythologizing, and Capsule Losing Contact does little to illuminate their biography beyond presenting the band’s progression. Barring the whirly 1996 single “East Reed,” and other lost recordings, Duster’s proper output begins with 1997’s Transmission, Flux 7\". Its five songs are turbulent, fuzzy 4-track experimentations that plant the thematic seeds for Duster’s fascination with the cosmos (see “Orbitron” and “My Friends Are Cosmonauts”). “Light Years,” taken from the following year’s Apex, Trance-Like 7\", furthers the lunar motif, while on its companion piece “Four Hours,” Duster push through their melancholy to express an intense desire for human connection. That silently floating figure was a human all along.\nOn their 1998 opus Stratosphere, Duster further explored the depths of the astronaut’s melancholia. Like the atmospheric layer from which it takes its name, the band’s debut full-length is a vast expanse that encourages the mind to unravel in endless contemplation. Using simplistic, cyclical guitar melodies and thickly woven electronic textures, the songs spiral into a state of sublimity. About half of these 17 tracks are atmospheric instrumentals; when Parton or bandmate Canaan Dove Amber do manage to murmur some cryptically poetic verses about disconnect and anxiety, their voices are muffled as if by thick gauze. Only near the end of the staggering “Earth Moon Transit” does a clear emotional point emerge: “I wonder if you think about me like I do of you/At night.” Recorded largely on 4-track cassette machines with production assistance from Pacific Northwest indie rock legend Phil Ek, Stratosphere radiates intimacy even in its starkest moments. The overall effect is like that of resting beneath a weighted blanket, cocooned from the intrusions of the outside world.\nFrom the opening track, Stratosphere establishes a tempo that waxes and wanes from droning gloom to dreamy bliss. Duster take off with “Moon Age,” a blippy synth instrumental that conveys the cosmic innocence of Major Tom, floating in that “most peculiar way.” Its detached tranquility is immediately countered by Stratosphere’s most upbeat songs, “Heading for the Door” and “Gold Dust.” On a record full of heady introspection, this is the closest Duster come to approximating what was happening elsewhere in 1998 indie rock; the latter riff sounds like the wistful earworm cooked up by Pavement a few years earlier. Slow-building standout “Echo, Bravo,” begins with a frenzy of strung-out tape distortion that bursts into a sludgy meltdown before fading into quivering drone, an effect immediately countered by the listless “Constellations.” So Stratosphere goes, undulating between soft and harsh, often within one song, climaxing with the seven-minute title track. Beginning with a haze of rippling feedback, “Stratosphere” builds layer upon layer of dissonance until the abstraction fizzles out of its own accord. It’s less momentous than other tracks, declining to arrive at any emotional destination, instead embracing the inexplicable.\nNear the end of the recording of Stratosphere, Parton and Amber brought in drummer Jason Albertini (an original Queens of the Stone Age member), who ended up joining Duster full-time. In 1999, the band recorded the 1975 EP, which bridges Stratosphere’s hushed lethargy with accessibility. (In between, the three bandmates quietly worked on an even spacier side project, the short-lived Valium Aggelein, not included here). Some songs on the EP (“Memphis Sophisticate,” “And Things (Are Mostly Ghosts)”) are unexpectedly lucid, while others (“The Motion Picture,” “August Relativity”) disappear back into Stratosphere’s cloudy embrace. Closing track “Want No Light to Shine” begins with a delicate reverie of synthesizers and strings that gives way to meandering piano melody. Whispers of San Jose traffic rumble in the background, as if the door of the recording space was propped open to let in some light.\nOn their last full-length record, 2000’s Contemporary Movement, Duster return to earth. Though it compresses Stratosphere’s atmospheric sprawl into a tight, song-oriented package, Contemporary Movement retains its predecessor’s escapism. The tone is heavier, almost grungy at times, but the overall cadence remains slow, allowing songs to unspool patiently. While the vocals are still considerably buried beneath washes of heavy guitars and analog squall, the songwriting is given more of a spotlight—albeit a dim one. Unlike Stratosphere, which orbited so high that true contact seemed unlikely, Contemporary Movement’s longing for emotional connection feels hopeful. “Goddamn, I wish I was a little bit smarter,” goes one humoursly earnest line of “The Breakup Suite”; in that moment, Parton and Amber’s gravelly warbles echo the nasally self-deprecation of their former label-mates Modest Mouse. Early droners “Operations” and “Diamond” trudge along, all blurry guitar friction and brooding drums that never quite lift off the ground. “Cooking” picks the mood up a bit, a swirling bit of sunshine amidst the clouds. The euphoria is never as freewheeling as on Stratosphere, but here it feels firmly tethered to earth.\nThough Duster went on an extended hiatus after Contemporary Movement, the bandmates never stopped collaborating. Both Amber and Parton have played on Albertini’s project Helvetia, and Parton founded a label, the Static Cult, to release Helvetia records (and his own, under the name Eiafuawn). As the bandmates moved on, their music as Duster retained its ineffable quality, one the band themselves sought to define at the time. Contemporary Movement concludes with an expression of that uncertainty: “The audience finds their feet/Clap and scream/But what does it mean?” At a Duster reunion concert in December 2018, the line felt eerily salient. It’s strange to hear such intensely private and personal music in a crowd, and at the end of each song, there was almost an awkward uncertainty: Do we clap? In the end we did, and some people screamed, but something unspeakable lingered long after the band left the stage. Capsule Losing Contact is a welcome survey of Duster’s legacy, and an opportunity to appreciate a modest band that means something different to everyone.\n", "pptitle": ["capsul", "lose", "contact"]}