{"id": "PF_87", "url": "https://pitchfork.com/reviews/albums/hozier-wasteland-baby/", "name": ["Wasteland,", "Baby!"], "description": ["like", "desper", "magician", "guess", "card", "card", "arriv", "hand", "andrew", "hozierbyrn", "spend", "second", "album", "stumbl", "simpl", "trick", "kick", "fulllength", "year", "platinumsel", "irish", "singersongwrit", "celebr", "legend", "spoke", "truth", "power", "shout", "verit", "vh1", "marathon", "worth", "great", "nina", "simon", "billi", "holiday", "john", "lennon", "jame", "brown", "joni", "mitchel", "mavi", "stapl", "patti", "smith", "marvin", "gay", "namecheck", "open", "song", "nina", "cri", "power", "messag", "simpl", "peopl", "differ", "probabl", "mean", "dwell", "hopeless", "join", "choir", "wellmean", "action", "that", "paid", "dividend", "past", "church", "titl", "hozier", "careermak", "2013", "singl", "imagin", "purpos", "songwritera", "purveyor", "good", "packag", "radio", "anthem", "design", "sung", "lung", "music", "interview", "softspoken", "28yearold", "passion", "nobl", "caus", "lgbtq", "awar", "irish", "nurs", "strike", "opioid", "crisi", "stand", "sixfootf", "chisel", "featur", "occasion", "manbun", "mononym", "singer", "kind", "christlik", "aura", "downmarket", "russel", "brand", "mother", "visual", "artist", "rain", "hozierbyrn", "design", "latest", "album", "cover", "process", "involv", "submerg", "son", "underwat", "extend", "period", "time", "said", "mum", "joke", "dryli", "just", "tri", "think", "album", "sale", "die", "shoot", "thing", "he", "got", "gorgeou", "voic", "boom", "effervesc", "instrument", "commun", "passion", "adventur", "wisdom", "extent", "transcrib", "lyric", "somewhat", "miss", "point", "there", "reason", "peopl", "didnt", "realiz", "church", "protest", "song", "cathol", "church", "like", "foster", "peopl", "similarli", "outofnowher", "smash", "pump", "kick", "ascend", "chart", "sole", "hummabl", "hook", "crowdpleas", "adrenalin", "strength", "sweet", "elus", "currenc", "analyz", "beauti", "day", "14", "track", "roughli", "hour", "wasteland", "babi", "fall", "prey", "humdrum", "power", "wrung", "dri", "record", "pitfal", "new", "majorlabel", "artist", "attempt", "follow", "surpris", "hit", "nearli", "element", "church", "isol", "recycl", "hope", "crown", "successor", "god", "hous", "aid", "gospel", "choir", "doesnt", "make", "awkward", "oneword", "refrain", "nois", "make", "sing", "sound", "like", "worth", "sing", "just", "slowbuild", "stompclap", "murk", "movement", "invit", "avert", "eye", "contact", "room", "just", "central", "refrain", "songss", "nowsuggest", "unbecom", "direct", "rock", "star", "make", "want", "join", "fun", "wed", "singer", "youth", "group", "leader", "demand", "hozier", "subtl", "dark", "streak", "sens", "tri", "wield", "mood", "new", "way", "deal", "spacier", "arrang", "heavier", "guitar", "harsher", "lyric", "plan", "take", "aim", "scream", "heav", "fuckeri", "world", "hooah", "success", "ballad", "call", "shrike", "appear", "year", "nina", "cri", "power", "ep", "stark", "fingerpick", "gestur", "tradit", "irish", "folk", "music", "bellow", "vocal", "exud", "downhom", "intimaci", "make", "consid", "strang", "path", "led", "pop", "music", "sound", "like", "mayb", "begin", "black", "key", "danger", "mous", "lite", "psychedel", "blue", "weav", "lumin", "audienceparticip", "folkpop", "ride", "sidecar", "adel", "torch", "ballad", "supernova", "stop", "just", "short", "alabama", "shake", "riotou", "pearli", "gate", "want", "badli", "sound", "timeless", "feel", "like", "moment", "that", "pass", "ed", "sheeran", "jame", "bay", "hozier", "peer", "attempt", "evolv", "write", "fake", "rihanna", "song", "cut", "hair", "respect", "hozier", "uneas", "futur", "palpabl", "way", "hozier", "tell", "wrote", "wasteland", "babi", "titl", "track", "read", "threat", "nuclear", "war", "caus", "bulletin", "atom", "scientist", "doomsday", "clock", "ahead", "30", "secondsan", "event", "result", "bbc", "use", "word", "apocalyps", "headlin", "see", "littl", "light", "fear", "end", "world", "sing", "gentli", "happen", "time", "boy", "fall", "love", "girl", "he", "songwrit", "lament", "small", "apocalyps", "occur", "day", "love", "tempor", "natur", "make", "special", "hear", "sing", "ithi", "voic", "coat", "unearthli", "burbl", "atop", "humbl", "fingerpick", "acoust", "guitari", "hear", "acknowledg", "limit", "church", "celebr", "life", "fieri", "begin", "end", "truth", "spend", "time", "middl", "consum", "earnest", "unglamor", "everyday", "kind", "search", "mean", "direct", "given", "voic", "sound", "like"], "date_published": ["2019-03-06T06:00:00"], "sentiment": 0.11673288334472548, "content": "Like a desperate magician guessing card after card until he arrives at the one in your hand, Andrew Hozier-Byrne spends much of his second album stumbling through a simple trick. To kick off his first full-length in five years, the platinum-selling Irish singer-songwriter celebrates the legends who spoke truth to power, as he shouts out a veritable VH1 marathon’s worth of greats: Nina Simone, Billie Holiday, John Lennon, James Brown, Joni Mitchell, Mavis Staples, Patti Smith, Marvin Gaye, and more are name-checked during the opening song “Nina Cried Power.” The message is simple. All of these people made a difference, and, whoever you are, wherever you are, at least one of them probably means something to you. Why dwell in hopelessness when you can join the choir?\nIt’s a well-meaning call to action that’s paid dividends in the past. “Take Me to Church” is both the title of Hozier’s career-making 2013 single and also his imagined purpose as a songwriter—a purveyor of good will, packaged in radio anthems designed to be sung at the top of your lungs. In his music and interviews, the soft-spoken 28-year-old is passionate about noble causes, from LGBTQ awareness to the Irish nurses’ strike and the opioid crisis. Standing at six-foot-five, with chiseled features and the occasional man-bun, the mononymic singer even has a kind of Christ-like aura, or at least downmarket Russell Brand. His mother, the visual artist Raine Hozier-Byrne, designed his latest album cover in a process that involved submerging her son underwater for extended periods of time: “I had said to mum,” he joked dryly, “Just try to think of the album sales if I do die on this shoot!”\nAnother thing: he’s got a gorgeous voice. Booming and effervescent, it’s an instrument that communicates passion, adventure, and wisdom, all to the extent that transcribing his lyrics seems to be somewhat missing the point. There’s a reason why most people didn’t realize that “Take Me to Church” is a protest song about the Catholic Church. Like Foster the People’s similarly out-of-nowhere smash “Pumped Up Kicks,” it seemed to ascend the charts solely on hummable hooks and crowd-pleasing adrenaline. Such strengths are a sweet but elusive currency. Analyze a beautiful day and it’s already over. At 14 tracks in roughly an hour, Wasteland, Baby! falls prey to the humdrum, all its power wrung dry.\nThe record’s pitfalls are nothing new for major-label artists attempting to follow a surprise hit. Nearly every element of “Take Me to Church” is isolated and recycled here in the hopes of crowning a successor: God is not in the house. The aid of a gospel choir doesn’t make the awkward one-word refrain of “To Noise Making (Sing)” sound like something worth singing along to, just as the slow-build, stomp-clap murk of “Movement” mostly invites you to avert eye contact from the back of the room. Even just the central refrains of these songs—Sing! Move! Now!—suggest an unbecoming directness. Rock stars make us want to join in on the fun; wedding singers and youth group leaders demand it.\nHozier has always had a subtle dark streak, and you can sense him trying to wield his moods in new ways. He now deals in spacier arrangements, heavier guitars, and harsher lyrics. (“No Plan” takes aim at the “screaming, heaving fuckery of the world.” Hoo-ah!) Most successful is a ballad called “Shrike” that also appeared on last year’s Nina Cried Power EP. It’s stark and fingerpicked, with gestures toward traditional Irish folk music. His bellowed vocals exude a down-home intimacy that makes me consider the strange path that led us toward pop music that sounds like this. It maybe begins with the Black Keys and Danger Mouse’s lite psychedelic blues and weaves through the Lumineers’ audience-participation folk-pop; it rides in the sidecar of Adele’s torch ballad supernovas and stops just short of Alabama Shakes’ riotous pearly gates. It wants badly to sound timeless but it already feels like a moment that’s passed. Ed Sheeran and James Bay, two of Hozier’s peers, have attempted to evolve by writing fake Rihanna songs and cutting their hair, respectively. Hozier’s unease about the future is palpable.\nThe way Hozier tells it, he wrote Wasteland, Baby!’s title track after reading how threats of nuclear war caused the Bulletin of the Atomic Scientists to move our doomsday clock ahead 30 seconds—an event that resulted in the BBC using the word “apocalypse” in a headline. And yet, he sees a little light. “All the fear and fire of the end of the world,” he sings gently, “Happens each time a boy falls in love with a girl.” He’s not the first songwriter to lament the small apocalypses that occur every day, or how love’s temporal nature is also what makes it special. And to hear him sing it—his voice coated in an unearthly burble atop humble, fingerpicked acoustic guitar—is to hear him acknowledge his limitations. After all, churches are where we celebrate life’s fiery beginnings and endings, but the truth is, we spend most of our time somewhere in the middle, consumed by an earnest and unglamorous everyday kind of searching. Without meaning or direction, it might, given a voice, sound something like this.\n", "pptitle": ["wasteland", "babi"]}