{"id": "PF_39", "url": "https://pitchfork.com/reviews/albums/rian-treanor-ataxia/", "name": ["ATAXIA"], "description": ["rian", "treanor", "music", "mo", "best", "sum", "titl", "second", "ep", "pattern", "damag", "young", "british", "produc", "visual", "artist", "use", "asymmetr", "rhythm", "pattern", "modul", "pri", "open", "sound", "electro", "bleep", "techno", "speed", "garag", "scatter", "compon", "new", "shape", "dazzl", "danceabl", "result", "2018", "standout", "positionb1", "resembl", "danc", "music", "curl", "form", "unsteadi", "sequenc", "human", "brain", "just", "process", "treanor", "said", "rhythmic", "structur", "ataxia", "debut", "album", "stricter", "focus", "previou", "work", "explor", "appar", "contradictori", "idea", "irregular", "symmetri", "artist", "smash", "whigfield", "eurod", "hit", "saturday", "night", "unlik", "underground", "sensat", "shift", "puzzl", "ataxia", "weaker", "track", "suffer", "certain", "academ", "dryness", "ataxia", "a2", "ataxia", "c1", "combin", "fussili", "obtus", "drum", "rhythm", "spars", "machin", "melodi", "spin", "opaqu", "everchang", "circl", "ataxia", "a1", "wast", "wonder", "disjoint", "beat", "synth", "melodi", "underst", "exist", "line", "success", "failur", "cigarettepap", "treanor", "productiona", "tightli", "coil", "spring", "asymmetr", "machin", "beat", "dab", "electron", "melodyi", "distinct", "aesthet", "littl", "separ", "album", "weaker", "track", "outandout", "banger", "ataxia", "b1", "sonic", "sibl", "ataxia", "a2", "preced", "b1", "rhythm", "itchili", "intens", "polyrhythm", "vigor", "play", "central", "synth", "riff", "like", "murder", "ballet", "build", "electr", "frenzi", "moment", "like", "ataxia", "feel", "wonder", "aliv", "appar", "studious", "treanor", "music", "method", "say", "music", "intend", "make", "peopl", "bodi", "unpredict", "way", "goal", "reflect", "littl", "insensit", "album", "titl", "common", "symptom", "ataxia", "includ", "lack", "coordin", "deterior", "fine", "motor", "skill", "accord", "nation", "ataxia", "foundat", "certainli", "imagin", "track", "like", "ataxia", "d1", "pit", "distress", "uk", "garag", "swing", "nag", "riff", "vein", "dj", "mujava", "township", "funk", "work", "wonder", "clubber", "irregular", "symmetri", "concern", "queue", "bar", "best", "ataxia", "d3", "track", "dispens", "drum", "favor", "cutup", "vocal", "insouci", "organ", "stab", "nod", "new", "jersey", "garag", "don", "daft", "punk", "collabor", "todd", "edward", "album", "final", "come", "air", "nobl", "way", "treanor", "music", "flirt", "failur", "human", "be", "essenti", "patternfind", "machin", "michael", "shermer", "argu", "book", "believ", "mess", "structur", "power", "effect", "posit", "neg", "treanor", "told", "resid", "advisor", "human", "abil", "recogn", "pattern", "music", "thing", "funki", "thing", "hyster", "thing", "bore", "ataxia", "moment", "run", "gamut", "funk", "feverish", "entertain", "frustratingli", "dryey", "experi", "remain", "startlingli", "originala", "power", "piec", "work", "sonic", "adventur", "rare", "intellectu", "clariti"], "date_published": ["2019-03-19T05:00:00"], "sentiment": 0.032878787878787896, "content": "Rian Treanor’s musical M.O. might best be summed up by the title of his second EP, Pattern Damage. The young British producer and visual artist uses asymmetrical rhythms and pattern modulation to pry open the sounds of electro, bleep techno, and speed garage, scattering the components into new shapes that are dazzling and danceable. The results, as on the 2018 standout “Position_B1,” resemble dance music that has curled back in on itself, forming unsteady sequences that the human brain can just about process.\nTreanor has said that the rhythmic structures on ATAXIA, his debut album, are stricter and more focused than his previous work, exploring apparently contradictory ideas such as “irregular symmetry.” For an artist who once smashed Whigfield’s Eurodance hit “Saturday Night” into an unlikely underground sensation, this shift seems puzzling, and ATAXIA’s weaker tracks suffer from a certain academic dryness. “ATAXIA A2” and “ATAXIA C1” combine fussily obtuse drum rhythms with sparse machine melodies that spin around in opaque, ever-changing circles, while “ATAXIA A1” wastes a wonderfully disjointed beat on a synth melody so understated that it might as well not exist.\nYet the line between success and failure here is cigarette-paper thin. Treanor’s production—a tightly coiled spring of asymmetrical machine beats and dabs of electronic melody—is so distinctive that, aesthetically, little separates the album’s weaker tracks from its out-and-out bangers. “ATAXIA B1” is a sonic sibling to “ATAXIA A2,” which precedes it. But on “B1” the rhythm is itchily intense, its polyrhythmic vigor playing off against the central synth riff like a murderous ballet that builds in an electrical frenzy.\nAt moments like these, ATAXIA feels wonderfully alive. For all the apparent studiousness in Treanor’s musical methods, he says his music is “intended to make people’s bodies move in unpredictable ways,” a goal reflected, perhaps a little insensitively, in the album’s title. (Common symptoms of ataxia include a lack of coordination and the deterioration of fine motor skills, according to the National Ataxia Foundation.) Certainly, you can imagine a track like “ATAXIA D1,” which pits distressed UK garage swing against a nagging riff in the vein of DJ Mujava’s “Township Funk,” working wonders among clubbers for whom irregular symmetry is less of a concern than the queue for the bar. Best of all, though, is “ATAXIA D3,” a track that dispenses with drums in favor of cut-up vocals and insouciant organ stabs that nod to New Jersey garage don (and Daft Punk collaborator) Todd Edwards. It’s here that the album finally comes up for air.\nThere is something rather noble about the way Treanor’s music flirts with failure. If human beings are essentially pattern-finding machines, as Michael Shermer argues in his book How We Believe, then messing with these structures has powerful effects, both positive and negative. Treanor told Resident Advisor that the human ability to recognize patterns in music “might be why we find some things funky or some things hysterical or some things boring.” ATAXIA has moments of all three, running the gamut across funk, feverish entertainment, and frustratingly dry-eyed experiments. Throughout, however, it remains startlingly original—a powerful piece of work from a sonic adventurer of rare intellectual clarity.\n", "pptitle": ["ataxia"]}