{"id": "PF_91", "url": "https://pitchfork.com/reviews/albums/sofia-kourtesis-sofia-kourtesis-ep/", "name": ["Sofia", "Kourtesis", "EP"], "description": ["year", "studio", "barnhu", "volym", "1", "fulllength", "compil", "cheer", "leftfield", "stockholm", "danc", "label", "group", "portrait", "popul", "larg", "class", "clown", "loveabl", "misfit", "cofound", "kornl", "kovc", "pedrodollar", "axel", "boman", "deliv", "reliabl", "offkilt", "take", "twinkl", "brand", "hous", "music", "kompakt", "superpitch", "jumpstart", "senior", "center", "radio", "help", "batter", "drum", "machin", "baba", "stiltz", "did", "stone", "lothario", "bit", "virtual", "recordeven", "dj", "koze", "ambient", "beat", "took", "unusu", "opalesc", "glowwa", "upstag", "sofia", "kourtesi", "bewitch", "winwin", "san", "easylisten", "vocal", "harmoni", "loop", "dreamili", "garbl", "voic", "decept", "bassheavi", "hous", "groov", "song", "swirl", "like", "cottoncandi", "kaleidoscop", "kourtesi", "appear", "wax", "save", "guest", "vocal", "gold", "panda", "half", "live", "2013", "just", "month", "later", "peruvianborn", "berlinbas", "musician", "return", "debut", "ep", "that", "bit", "magic", "easi", "studio", "barnhu", "label", "hear", "like", "imprint", "foundersand", "like", "koze", "offbeat", "lowkey", "sensibl", "provid", "blueprint", "stockholm", "crew", "aestheticsh", "make", "hous", "music", "skirt", "convent", "renounc", "rote", "function", "forget", "purpos", "make", "peopl", "track", "bound", "place", "steadi", "kick", "drum", "suddenli", "buckl", "knee", "scrappi", "accent", "tug", "beat", "lopsid", "center", "graviti", "drum", "program", "cobbl", "mismatch", "drummachin", "hit", "ricketi", "break", "percuss", "abstract", "amount", "hyperkinet", "hodgepodg", "clink", "clank", "zap", "powsa", "verit", "comic", "book", "worth", "onomatopoeia", "sens", "mysteri", "run", "song", "begin", "cloudi", "circumst", "genesi", "there", "tell", "exactli", "sound", "larg", "samplebas", "lana", "gay", "dramat", "strip", "harmon", "vocal", "chop", "upposs", "backward", "hard", "tell", "sureov", "beat", "rattl", "like", "stick", "washboard", "train", "airport", "halfsung", "halfshout", "callandrespons", "refrain", "trigger", "memori", "ricardo", "villalobo", "christian", "vandersampl", "enfant", "chant", "wordless", "vocal", "loop", "overstuf", "bed", "tone", "incident", "element", "bounc", "like", "quarter", "toss", "lumpi", "mattress", "there", "just", "earshot", "just", "past", "limit", "comprehens", "garbl", "street", "nois", "snatch", "overheard", "dialogu", "languag", "yelp", "hiccup", "io", "santo", "ep", "placid", "cut", "market", "vendor", "briefli", "harmon", "song", "melod", "element", "inspir", "bit", "collag", "reveal", "music", "hidden", "everyday", "life", "kourtesi", "say", "sound", "come", "travelsth", "din", "amazon", "shout", "children", "sell", "papa", "y", "quesowhil", "come", "movi", "old", "record", "children", "toy", "flea", "market", "techniqu", "new", "put", "servic", "express", "melodi", "surpris", "arrang", "make", "wholli", "play", "spirit", "hous", "music", "get", "say", "make", "peopl", "kourtesi", "song", "make", "compel", "argument", "real", "purpos", "danc", "music", "make", "peopl", "dream"], "date_published": ["2019-03-07T06:00:00"], "sentiment": 0.15057171089779786, "content": "Last year’s Studio Barnhus Volym 1, the first full-length compilation from the cheerfully leftfield Stockholm dance label, was a group portrait populated in large part by class clowns and loveable misfits. Co-founders Kornél Kovács, Pedrodollar, and Axel Boman all delivered reliably off-kilter takes on their twinkling brand of house music; Kompakt’s Superpitcher jumpstarted a senior center’s AM radio with some help from a battered drum machine; and Baba Stiltz did his stoned lothario bit. But virtually everyone on the record—even DJ Koze, whose ambient beats took on an unusually opalescent glow—was upstaged by Sofia Kourtesis’ bewitching “WinWin San.” With easy-listening vocal harmonies looping dreamily above garbled voices and a deceptively bass-heavy house groove, the song swirled like a cotton-candy kaleidoscope.\nThat was Kourtesis’ first appearance on wax, save for a guest vocal on Gold Panda’s “Half of Where You Live,” in 2013; now, just six months later, the Peruvian-born, Berlin-based musician returns with a debut EP that’s every bit as magical. It’s easy to see what the Studio Barnhus label hears in her. Like the imprint’s founders—and like Koze himself, whose offbeat, low-key sensibility provided the blueprint for the Stockholm crew’s whole aesthetic—she makes house music that skirts convention and renounces rote functionality without ever forgetting that its purpose is to make people move.\nHer tracks bound all over the place. Steady kick drums suddenly buckle at the knees; scrappy accents tug at the beat’s already lopsided center of gravity. Her drum programming, which seems to have been cobbled together from mismatched drum-machine hits, rickety breaks, and percussive abstractions, amounts to a hyperkinetic hodge-podge of clinks, clanks, zaps, and pows—a veritable comic book’s worth of onomatopoeia.\nA sense of mystery runs through all four songs, beginning with the cloudy circumstances of their very genesis. There’s no telling exactly how they were made, but they sound largely sample-based. In “Lana Gaye,” a dramatic strip of harmonized vocals is chopped up—possibly backwards, though it’s hard to tell for sure—over a beat that rattles like a stick against a washboard. In “Trains & Airports,” a half-sung, half-shouted call-and-response refrain triggers memories of Ricardo Villalobos’ Christian Vander-sampling “Enfants (Chants).” Often, a wordless vocal loop becomes an overstuffed bed of tone that incidental elements get bounced off of, like quarters tossed on a lumpy mattress.\nThere’s always something just out of earshot, just past the limits of comprehension: garbled street noise, a snatch of overheard dialogue in another language, a yelp that might be a hiccup. In “Ios Santos,” the EP’s most placid cut, what might be a market vendor’s cry briefly harmonizes with the song’s melodic elements, an inspired bit of collage that reveals the music hidden in everyday life.\nKourtesis says that many of her sounds come from her travels—the din of the Amazon, the shouts of children selling papa y queso—while others come from movies, old records, or children’s toys from the flea market. None of these techniques are new, but, putting them in the service of such expressive melodies and surprising arrangements, she makes them wholly her own. This is as playful and as spirited as house music gets. It’s not enough, she seems to say, to make people move; Kourtesis’ songs make a compelling argument that the real purpose of dance music is to make people dream.\n", "pptitle": ["sofia", "kourtesi", "ep"]}