{"id": "PF_95", "url": "https://pitchfork.com/reviews/albums/sun-kil-moon-i-also-want-to-die-in-new-orleans/", "name": ["I", "Also", "Want", "to", "Die", "in", "New", "Orleans"], "description": ["there", "special", "kind", "panic", "set", "your", "trap", "onesid", "convers", "powerless", "realiz", "fidget", "make", "stori", "volunt", "hear", "end", "sooner", "matter", "eye", "dart", "room", "parti", "come", "rescu", "songwrit", "induc", "feel", "uncannili", "halfdecad", "sun", "kil", "moon", "mark", "kozelek", "2014", "widerang", "discurs", "benji", "he", "doubl", "talk", "talk", "sake", "share", "everlong", "monologu", "increasingli", "devoid", "ironi", "comic", "coincid", "payoff", "takeaway", "deliv", "slumber", "pace", "15", "minut", "marc", "maron", "podcast", "everybodi", "skip", "build", "audaci", "banal", "year", "dinner", "kozelek", "latest", "90minut", "dispatch", "unedit", "thought", "want", "die", "new", "orlean", "goe", "step", "frame", "rambl", "kind", "free", "jazz", "record", "dirti", "drummer", "jim", "white", "donni", "mccaslin", "saxophonist", "help", "drive", "david", "bowi", "blackstar", "transcend", "record", "limber", "latenight", "session", "vibe", "set", "apart", "predecessor", "anybodi", "come", "tast", "play", "accompanist", "serious", "overestim", "kozelek", "restraint", "hardli", "second", "goe", "isnt", "usurp", "drone", "indiscrimin", "runon", "narrat", "seven", "song", "feel", "like", "jim", "journal", "comic", "stretch", "length", "tolstoy", "novel", "15minut", "day", "america", "open", "news", "marjori", "stoneman", "dougla", "high", "school", "shoot", "grave", "backdrop", "give", "way", "pedestrian", "account", "musician", "sit", "kozelek", "trio", "play", "evan", "song", "kozelek", "think", "brilliant", "he", "furiou", "learn", "cover", "imagin", "fallout", "hed", "unknowingli", "releas", "call", "said", "rip", "evan", "goe", "minut", "reason", "evan", "sound", "like", "bob", "evan", "kozelek", "detail", "bad", "night", "chain", "restaur", "18", "goe", "minut", "song", "end", "dream", "sequenc", "amazingli", "that", "event", "song", "new", "orlean", "23minut", "bay", "kotor", "pet", "sickli", "kitten", "imit", "variou", "anim", "cri", "bark", "cow", "consid", "relationship", "meat", "cow", "flesh", "entir", "complet", "stage", "life", "im", "afraid", "hard", "mefor", "half", "centuri", "ive", "enjoy", "tasti", "flavor", "cow", "meatit", "tast", "good", "mom", "chop", "suey", "song", "puls", "couch", "potato", "squander", "flutteri", "jazzedout", "modest", "mous", "groov", "kozelek", "orneri", "polit", "muse", "unpopularopinion", "sure", "trump", "terribl", "maintain", "obama", "separ", "immigr", "children", "parent", "mind", "fact", "checker", "beg", "differ", "factcheck", "song", "includ", "dicey", "asid", "obama", "light", "skin", "wast", "energi", "despit", "period", "flirtat", "lofti", "subject", "song", "deliber", "inconsequenti", "flimsi", "excus", "kozelek", "assault", "superflu", "detail", "circuit", "dialogu", "deadend", "asid", "individu", "part", "rare", "mean", "mean", "benji", "great", "trick", "song", "meanderingit", "wind", "tale", "gave", "way", "emot", "revel", "move", "kozelek", "sound", "like", "process", "real", "time", "songwrit", "style", "brave", "album", "feel", "like", "cowardli", "cheat", "want", "die", "new", "orlean", "preemptiv", "attempt", "artist", "run", "short", "idea", "shield", "critic", "feign", "indiffer", "fail", "realli", "tri", "blurri", "photo", "cat", "cover", "afterthought", "titl", "lift", "poster", "saw", "year", "uicideboy", "album", "miser", "slog", "song", "kozelek", "stop", "telegraph", "littl", "care"], "date_published": ["2019-03-08T06:00:00"], "sentiment": 0.0649436327561328, "content": "There’s a special kind of panic that sets in when you’re trapped in a one-sided conversation, the powerlessness of realizing that no amount of fidgeting will make the story you never volunteered to hear end any sooner and that, no matter how much your eyes dart across the room, nobody else at the party will come to rescue you. No songwriter has induced that feeling as uncannily over the last half-decade as Sun Kil Moon’s Mark Kozelek. Since 2014’s wide-ranging and discursive Benji, he’s doubled down on talk for talk’s sake, sharing ever-longer monologues increasingly devoid of irony, comic coincidence, payoffs, or takeaways, all delivered at the slumberous pace of those first 15 minutes of Marc Maron’s podcast that everybody skips.\nBuilding on the audacious banality of last year’s This Is My Dinner, Kozelek’s latest 90-minute dispatch of unedited thoughts I Also Want To Die in New Orleans goes a step further by framing his ramblings as a kind of free jazz. Recorded with Dirty Three drummer Jim White and Donny McCaslin, the saxophonist who helped drive David Bowie’s Blackstar to transcendence, the record has a limber, late-night session vibe that sets it apart from its predecessors, but anybody coming for the tasteful playing of those accompanists is seriously overestimating Kozelek’s restraint. Hardly a second goes by that isn’t usurped by the drone of his indiscriminate, run-on narration.\nEach of these seven songs feels like a Jim’s Journal comic stretched to the length of a Tolstoy novel. The 15-minute “Day in America” opens with news of the Marjory Stoneman Douglas High School shooting, but that grave backdrop gives way to a pedestrian account of a show: Some musicians sit in with Kozelek’s trio, one of them plays a Bill Evans song that Kozelek thinks is brilliant, but he’s furious when he learns it’s a cover, imagining the fallout if he’d unknowingly released it as his own (“Someone would have called me out and said, ‘You ripped off Bill Evans!’”). This goes on for minutes. And then, for no other reason than Bill Evans sounds like Bob Evans, Kozelek details a bad night he had at that chain restaurant when he was 18, which also goes on for minutes. The song ends with a dream sequence.\nAnd amazingly that’s the most eventful song on New Orleans. On the 23-minute “Bay of Kotor” he pets some sickly kittens, and imitates various animal cries and barks. “Cows” considers his relationship with meat: “To give up cow flesh entirely, completely, at this stage in my life, I’m afraid would be very hard for me/For half a century I’ve enjoyed the tasty flavor of cow meat/It tastes so good in my mom’s chop suey.” One of the few songs with a pulse, “Couch Potato” squanders a fluttery, jazzed-out Modest Mouse groove on Kozelek’s ornery political musings and #UnpopularOpinions. Sure, Trump is terrible, he maintains, but Obama separated immigrant children from their parents, too. Never mind that fact checkers beg to differ; fact-checking a song that also includes a dicey aside about Obama’s light skin is wasted energy.\nDespite their periodic flirtations with lofty subjects, these songs are deliberately inconsequential, flimsy excuses for Kozelek’s assault of superfluous details, circuitous dialogue, and dead-end asides. The individual parts rarely mean anything, and the whole means even less. Benji’s great trick was its songs only seemed meandering—its winding tales gave way to emotional revelations that were all the more moving because Kozelek sounded like he was processing them in real time. But the songwriting style that seemed so brave on that album feels more than ever like a cowardly cheat on I Also Want To Die in New Orleans, a preemptive attempt by an artist running short on ideas to shield himself from criticism by feigning indifference. After all, you can’t fail if you were never really trying, and from the blurry photo of a cat on its cover to its afterthought of a title, lifted from a poster he saw for last year’s $uicideboy$ album, and the miserable slog of the songs themselves, Kozelek never stops telegraphing how little he cares.\n", "pptitle": ["want", "die", "new", "orlean"]}