{"id": "PF_11", "url": "https://pitchfork.com/reviews/albums/various-artists-cruising-ost/", "name": ["Cruising", "OST"], "description": ["music", "cruis", "soundtrack", "jukebox", "mineshaft", "anvil", "ramrod", "new", "york", "leather", "bar", "william", "friedkin", "1980", "thriller", "set", "liner", "note", "elabor", "vinyl", "reissu", "waxwork", "record", "director", "note", "night", "bar", "reverber", "pop", "disco", "music", "mineshaft", "danc", "club", "gay", "straight", "discodonna", "summer", "giorgio", "morod", "delfon", "villag", "peopl", "kc", "sunshin", "band", "jackson", "pointer", "sister", "play", "club", "scene", "start", "film", "summer", "1979", "didnt", "think", "fit", "mood", "film", "decid", "replac", "use", "instead", "tough", "taut", "hardcor", "punk", "hard", "funk", "act", "like", "willi", "devil", "crippl", "mutini", "germ", "friedkin", "decis", "make", "certain", "kind", "narr", "sens", "cruis", "follow", "straight", "cop", "play", "deerinheadlight", "intens", "al", "pacino", "goe", "undercov", "new", "york", "poststonewallpreaid", "gay", "commun", "kind", "stori", "involv", "catch", "killeror", "possibl", "multipl", "killerskc", "sunshin", "band", "sound", "welcom", "devil", "sinewi", "bluesrock", "groov", "germ", "smeari", "attack", "help", "establish", "fetid", "atmospher", "dread", "danger", "film", "gun", "that", "film", "controversi", "releas", "gay", "right", "activist", "object", "depict", "leatherbar", "scene", "violent", "deprav", "villag", "voic", "writer", "arthur", "bell", "pen", "seri", "articl", "partli", "inspir", "script", "call", "oppress", "ugli", "bigot", "look", "homosexu", "present", "screen", "protestor", "sabotag", "shot", "blow", "whistl", "film", "unplug", "light", "cabl", "cruis", "flop", "releas", "film", "enjoy", "long", "curiou", "afterlif", "constantli", "reconsid", "reinterpret", "hail", "today", "revil", "depict", "particular", "subcultur", "cruis", "soundtrack", "live", "just", "outsid", "ongo", "debat", "partli", "music", "complet", "incongru", "film", "milieu", "partli", "pretti", "kickass", "punk", "album", "friedkin", "work", "produc", "jack", "nitzsch", "corral", "bicoast", "roster", "act", "surviv", "project", "creat", "mood", "constant", "antagon", "heat", "moment", "dont", "forget", "thing", "havent", "devil", "sing", "open", "heat", "moment", "hard", "tell", "he", "talk", "fuck", "fight", "relentless", "band", "groov", "crippl", "loneli", "frontman", "disabl", "right", "activist", "shawn", "casey", "obrien", "cerebr", "palsi", "took", "stage", "crutch", "bark", "bray", "like", "he", "tri", "parodi", "bluesrock", "machismo", "madelynn", "von", "ritz", "make", "androgyn", "snarl", "swagger", "glamswamp", "stomp", "close", "eye", "blood", "lump", "obvious", "danceabl", "track", "light", "pop", "disco", "mineshaft", "jukebox", "bounci", "funk", "number", "mutini", "shortliv", "group", "head", "parliamentfunkadel", "drummer", "jerom", "brailey", "song", "claustrophob", "frantic", "edg", "expand", "version", "cruis", "show", "versatil", "mutini", "punk", "funk", "avantgard", "jazz", "mesh", "nitzsch", "collabor", "mutini", "bassist", "barr", "phillip", "guitarist", "ralph", "towner", "omit", "origin", "soundtrack", "releas", "aia", "sound", "like", "ghost", "new", "york", "longgon", "bohemia", "phillip", "basslin", "veer", "springi", "hypnot", "menac", "mourn", "movi", "just", "minut", "germ", "soundtrack", "fascin", "punk", "fan", "legendari", "littleheard", "cach", "song", "band", "record", "nitzsch", "just", "releas", "debut", "gi", "session", "legendarili", "fraught", "frontman", "darbi", "crash", "struggl", "write", "new", "song", "argu", "pressur", "drove", "deeper", "drug", "later", "kill", "similarli", "band", "produc", "difficult", "work", "dismiss", "punk", "gener", "quit", "happi", "result", "song", "appear", "rough", "form", "1993", "antholog", "mia", "time", "theyv", "properli", "master", "vinyl", "releas", "hesit", "crash", "germ", "evid", "song", "like", "tunnel", "go", "sustain", "attack", "band", "launch", "gi", "best", "caustic", "catchi", "alright", "reveal", "wit", "imagin", "music", "crash", "stretch", "melodi", "uncomfort", "repeat", "phrase", "desper", "pat", "smear", "play", "guitar", "like", "he", "shovel", "dirt", "shallow", "grave", "songsal", "sequenc", "sidessound", "like", "germ", "mythic", "second", "album", "reissu", "play", "like", "altern", "histori", "punk", "rock", "canadian", "protoqueercor", "band", "rough", "trade", "exert", "immens", "influenc", "crippl", "obrien", "take", "place", "scene", "poet", "laureat", "film", "leatherbar", "scene", "doesnt", "gain", "punk", "soundtrack", "punk", "gain", "lot", "proxim", "leather", "especi", "heteronorm", "influenc", "mtvera", "poppunk", "90", "2000", "good", "remind", "safe", "haven", "misfit", "outcast", "flock", "big", "citi", "seek", "likemind", "commun", "creat", "scene", "cruis", "give", "megaphon", "artist", "voic", "squelch", "mainstream", "rock", "certainli", "mainstream", "filmmak"], "date_published": ["2019-03-30T05:00:00"], "sentiment": 0.10903110276604251, "content": "The music on the Cruising soundtrack would not have been found on the jukeboxes at the Mineshaft, the Anvil, Ramrod, or any of the other New York leather bars where much of William Friedkin’s 1980 thriller is set. In the liner notes for this elaborate vinyl reissue by Waxwork Records, the director notes that most nights these bars would have reverberated with pop and disco: “The music in the Mineshaft was the same in all the dance clubs, gay and straight: Disco—Donna Summer, Giorgio Moroder, the Delfonics, the Village People, KC and the Sunshine Band, the Jacksons, the Pointer Sisters. That is what was playing in the club scenes when we started filming in the summer of 1979 but I didn’t think it fit the mood of the film so I decided to replace it.”\nWhat he used instead was tough, taut hardcore punk and hard funk by acts like Willy Deville, the Cripples, Mutiny, and the Germs. Friedkin’s decision makes a certain kind of narrative sense, as Cruising follows a straight cop (played with deer-in-headlights intensity by Al Pacino) who goes undercover in New York’s post-Stonewall/pre-AIDS gay community. For the kind of story that involves catching a killer—or possibly multiple killers—KC and the Sunshine Band might have sounded too welcoming. But DeVille’s sinewy blues-rock grooves and the Germs’ smeary attack helped establish the fetid atmosphere of dread and danger the film was gunning for.\nAnd that’s what made the film so controversial even before its release. Gay rights activists objected to its depiction of the leather-bar scene as violent and depraved, and Village Voice writer Arthur Bell (who penned a series of articles that partly inspired the script) called it “the most oppressive, ugly, bigoted look at homosexuality ever presented on the screen.” Protestors sabotaged shots, blowing whistles during filming and unplugging lighting cables. Cruising was a flop upon release, but it’s one of those films that has enjoyed a long and curious afterlife, constantly reconsidered and reinterpreted, as hailed today as it is reviled for its depiction of this particular subculture.\nThe Cruising soundtrack lives just outside that ongoing debate, partly because the music is so completely incongruous with the film’s milieu and partly because on its own, it is a pretty kickass punk album. Friedkin worked with producer Jack Nitzsche to corral a bicoastal roster of acts, only a few of which survived beyond this project. Together, they create a mood of constant antagonism: “In the heat of the moment, don’t you forget all the things we haven’t done yet,” DeVille sings on opener “Heat of the Moment.” It’s hard to tell if he’s talking about fucking or fighting, such is the relentlessness of the band’s groove. On the Cripples’ “Loneliness,” frontman and disabled rights activist Shawn Casey O’Brien, who had cerebral palsy and took the stage on crutches, barks and brays like he’s trying to parody blues-rock machismo, and Madelynn Von Ritz makes the most of her androgynous snarl on the swaggering glam-swamp stomp “When I Close My Eyes I See Blood.”\n“Lump” is the most obviously danceable track here, but it’s not as light as the pop and disco on the Mineshaft jukebox. A bouncy funk number by Mutiny, a short-lived group headed by former Parliament-Funkadelic drummer Jerome Brailey, the song has a claustrophobic, even frantic edge. This expanded version of Cruising shows not only how versatile Mutiny could be, but how well punk and funk and even avant-garde jazz meshed. Nitzsche’s collaborations with Mutiny bassist Barre Phillips and guitarist Ralph Towner were omitted from the original soundtrack release, but “A-I-A” sounds like the ghost of New York’s long-gone bohemias, Phillips’ bassline veering from springy to hypnotic to menacing to mournful. It’s a full movie in just under ten minutes.\nAnd then there are the Germs. What has made the soundtrack such a fascination for punk fans is the legendary but little-heard cache of songs the band recorded with Nitzsche just after the release of their debut, GI. The sessions were legendarily fraught, with frontman Darby Crash struggling to write new songs; some have argued that the pressure drove him deeper into the drugs that would later kill him. Similarly, the band found the producer difficult to work with and dismissive of punk in general, so they were never quite happy with the results. Those songs appeared in very rough form on the 1993 anthology MIA, but this is the first time they’ve been properly mastered for a vinyl release. Any hesitation on the part of Crash or the other Germs is not evident in songs like “My Tunnel” and “Going Down,” which sustain the attack the band launched on GI. Best of all is the caustically catchy “Not Alright,” which reveals the wit and imagination in their music: Crash stretches out the melody uncomfortably, repeating phrases desperately, while Pat Smear plays his guitar like he’s shoveling dirt into a shallow grave.\nIf those five songs—all sequenced together on one of six sides—sound like the Germs’ mythic second album, then this whole reissue plays like an alternate history of punk rock, one where the Canadian proto-queercore band Rough Trade exerts immense influence and the Cripples’ O’Brien takes his place as the scene’s poet laureate. In the film the leather-bar scene doesn’t gain much from punk, but on the soundtrack punk gains a lot from its proximity to leather: Especially after the heteronormalizing influence of MTV-era pop-punk in the ‘90s and well into the 2000s, it’s good to be reminded that it was once a safe haven for the misfits and outcasts who flocked to big cities seeking like-minded communities and creating their own scenes. Cruising gives a megaphone to artists whose voices were often squelched in mainstream rock and certainly in mainstream filmmaking.\n", "pptitle": ["cruis", "ost"]}