{"id": "PF_71", "url": "https://pitchfork.com/reviews/albums/vijay-iyer-craig-taborn-the-transitory-poems/", "name": ["The", "Transitory", "Poems"], "description": ["jazz", "pianist", "vijay", "iyer", "craig", "taborn", "lot", "common", "surfac", "theyr", "late", "40", "theyv", "play", "peopl", "includ", "rosco", "mitchel", "steve", "coleman", "wadada", "leo", "smith", "past", "decad", "theyv", "releas", "piano", "trio", "album", "help", "reinvigor", "tradit", "oper", "describ", "avantgard", "theyr", "differ", "musician", "iyer", "mathemat", "keyboard", "precis", "percuss", "touch", "taborn", "figur", "thinker", "get", "suggest", "metaphor", "sound", "rumin", "spaciou", "qualiti", "set", "apart", "arent", "opposit", "aptli", "titl", "album", "transitori", "poem", "improvis", "duo", "record", "document", "live", "perform", "march", "franz", "liszt", "academi", "music", "budapest", "style", "mesh", "difficult", "distinguish", "set", "hand", "fourarm", "taken", "seat", "piano", "decid", "play", "hour", "quarter", "track", "half", "homag", "dedic", "respect", "pianist", "muhal", "richard", "abram", "geri", "allen", "cecil", "taylor", "die", "past", "coupl", "year", "record", "take", "typic", "philosoph", "taylor", "quotat", "track", "appropri", "elegiac", "lumin", "brew", "taylor", "tribut", "rumbl", "mourn", "like", "quiet", "storm", "clear", "monolith", "dedic", "abram", "end", "seri", "lush", "tender", "chord", "eman", "peac", "concert", "hall", "album", "isnt", "seren", "listen", "experi", "measureand", "that", "best", "raw", "gestur", "stuff", "ponder", "moment", "iyer", "taborn", "appear", "feel", "moment", "peck", "tent", "line", "pianist", "maintain", "sens", "forward", "motion", "occasion", "spasmic", "like", "cell", "mutat", "microscop", "engag", "track", "sens", "narr", "kair", "build", "forc", "climax", "disson", "highregist", "chord", "pound", "repeatedli", "sound", "kind", "like", "jerri", "lee", "lewi", "hed", "school", "arnold", "schoenberg", "homag", "album", "sensorium", "clock", "minut", "shortest", "track", "far", "nod", "visual", "artist", "jack", "whitten", "die", "2018", "claim", "influenc", "john", "coltran", "tune", "abstract", "portrait", "abstract", "painter", "slither", "contrapunt", "passag", "bring", "mind", "whitten", "collagelik", "approach", "layer", "dri", "piec", "acryl", "paint", "canva", "creat", "kind", "rough", "mosaic", "way", "song", "transitori", "poem", "mosaic", "sort", "iyer", "taborn", "layer", "idea", "method", "dexter", "build", "expand", "differ", "chord", "phrase", "album", "open", "life", "line", "seven", "tension", "best", "exampl", "textur", "approach", "featur", "seri", "tortuou", "solo", "stopandstart", "chordal", "pattern", "incident", "track", "sound", "bit", "like", "turkish", "mambo", "tune", "great", "pianist", "lenni", "tristano", "overdub", "line", "creat", "sens", "mesmer", "densiti", "perform", "probabl", "best", "experienc", "livewhat", "jazz", "isntit", "mesmer", "hear", "gift", "pianist", "improvis", "real", "time", "creat", "fresh", "singular", "new", "sound", "taborn", "releas", "fine", "piano", "duo", "album", "octopu", "kri", "davi", "year", "twopiano", "tradit", "jazz", "rel", "scant", "record", "histori", "cours", "memor", "contributionsmari", "lou", "william", "cecil", "taylor", "jaki", "byard", "tommi", "flanagan", "marian", "mcpartland", "number", "import", "player", "iyertaborn", "mind", "meld", "set", "high", "standard", "futur", "entri", "canon"], "date_published": ["2019-03-14T05:00:00"], "sentiment": 0.1889665252780007, "content": "The jazz pianists Vijay Iyer and Craig Taborn have a lot in common, at least on the surface. They’re in their late 40s. They’ve played with many of the same people, including Roscoe Mitchell, Steve Coleman, and Wadada Leo Smith. In the past decade or so, they’ve each released piano trio albums that have helped reinvigorate the tradition. They both operate in what might be described as the avant-garde. But they’re also different musicians. Iyer is mathematical at the keyboard, with a precise, percussive touch, while Taborn, who is more of a figurative thinker, gets by on suggestion and metaphor. His sound is ruminative and spacious.\nThe qualities that set them apart aren’t in opposition on their first, aptly titled album together, The Transitory Poems, an improvised duo recording that documents a live performance from last March at the Franz Liszt Academy of Music in Budapest. Their styles mesh so well that it can be difficult to distinguish one set of hands from the other, as though a four-armed being had taken a seat at the piano and decided to play for an hour and a quarter.\nOf the eight tracks, half are homages. Three are dedicated, respectively, to the pianists Muhal Richard Abrams, Geri Allen, and Cecil Taylor, all of whom died within the past couple of years. (The record takes its name from a typically philosophical Taylor quotation.) These tracks are appropriately elegiac. “Luminous Brew,” the Taylor tribute, rumbles mournfully like a quiet storm, while “Clear Monolith,” which is dedicated to Abrams, ends with a series of lush, tender chords that emanate peacefully into the concert hall.\nBut the album isn’t a serene listening experience by any measure—and that’s for the best. This is raw, gestural stuff. Though there are some ponderous moments in which Iyer and Taborn appear to be feeling each other out in the moment, pecking out tentative lines here and there, the pianists always maintain a sense of forward motion, even if it occasionally seems spasmic, like a cell mutating under a microscope. The most engaging tracks are those that have a sense of narrative, such as “Kairòs,” which builds to a forceful climax in which a dissonant, high-register chord is pounded out repeatedly. It sounds kind of like Jerry Lee Lewis, if he’d been schooled by Arnold Schoenberg.\nThe other homage on the album is “Sensorium,” clocking in at about four minutes, the shortest track by far. It’s a nod to the visual artist Jack Whitten, who died in 2018 and claimed to have been influenced by John Coltrane. The tune, an abstract portrait of an abstract painter, is full of slithering, contrapuntal passages that bring to mind Whitten’s collage-like approach, in which he layered dried pieces of acrylic paint onto a canvas to create a kind of rough mosaic.\nIn a way, all of the songs on The Transitory Poems are mosaics of a sort. Iyer and Taborn layer their ideas methodically, dexterously building and expanding on different chords and phrases. The album opener, “Life Line (Seven Tensions),” is the best example of this textured approach, featuring a series of tortuous solos over stop-and-start chordal patterns. Incidentally or not, the track sounds a bit like “Turkish Mambo,” a tune by the great pianist Lennie Tristano, who overdubbed his lines to create a sense of mesmerizing density.\nAnd while this performance would probably have been best experienced live—what jazz isn’t?—it’s still mesmerizing to hear these two gifted pianists improvising together, in real time, to create a fresh and singular new sound. Although Taborn released a fine piano duo album, Octopus, with Kris Davis last year, the two-piano tradition in jazz has a relatively scant recorded history. There have, of course, been memorable contributions—Mary Lou Williams and Cecil Taylor, Jaki Byard and Tommy Flanagan, Marian McPartland and any number of important players. But the Iyer-Taborn mind meld sets a high standard for future entries in the canon.\n", "pptitle": ["transitori", "poem"]}