{"id": "PF_79", "url": "https://pitchfork.com/reviews/albums/david-crosby-if-i-could-only-remember-my-name/", "name": ["If", "I", "Could", "Only", "Remember", "My", "Name"], "description": ["60", "david", "crosbi", "live", "boat", "asid", "record", "studio", "59foot", "schooner", "name", "mayan", "place", "thing", "sens", "crosbi", "11", "parent", "decid", "enrol", "son", "sail", "class", "wildey", "giggl", "california", "kid", "antiauthoritarian", "streak", "start", "troubl", "time", "dock", "imagin", "disciplin", "place", "spend", "summer", "sail", "came", "natur", "like", "captain", "vessel", "previou", "life", "uncanni", "feel", "comfort", "strang", "decad", "came", "close", "crosbi", "wrote", "titl", "track", "crosbi", "still", "nash", "young", "blockbust", "album", "dj", "vu", "sensat", "time", "experienc", "major", "loss", "1969", "way", "cat", "vet", "crosbi", "girlfriend", "christin", "hinton", "swerv", "van", "crash", "school", "bu", "die", "instantli", "griefstricken", "depress", "crosbi", "stood", "start", "long", "spiral", "consum", "decad", "watch", "david", "die", "day", "bandmat", "graham", "nash", "wrote", "wonder", "aloud", "univers", "do", "turn", "hard", "drug", "year", "later", "prison", "unrecogniz", "creativ", "spark", "defin", "dissip", "crosbi", "exist", "past", "tens", "beauti", "tragic", "comedi", "classic", "rock", "radio", "david", "crosbi", "protagonist", "he", "like", "stone", "sidekickcolor", "lovabl", "just", "kind", "take", "lead", "voic", "remain", "recogniz", "middlefirst", "byrd", "csn", "csni", "said", "egoand", "crosbi", "himselfbut", "artist", "content", "legaci", "defin", "peopl", "surround", "friend", "happi", "seen", "anybodi", "joy", "spontan", "reaction", "grace", "slick", "said", "encount", "crosbi", "60", "just", "look", "face", "delight", "human", "get", "childlik", "excit", "stuff", "like", "sail", "music", "came", "natur", "young", "crosbi", "awaken", "arriv", "age", "mother", "took", "symphoni", "orchestra", "park", "transfix", "save", "composit", "sat", "awe", "chaotic", "murmur", "musician", "tune", "instrument", "syncop", "danc", "elbow", "kick", "action", "vast", "bodi", "voic", "unit", "suddenli", "harmoni", "notic", "way", "sound", "nearli", "power", "just", "broke", "like", "wave", "reflect", "thread", "follow", "career", "1971", "rememb", "releas", "credit", "crosbi", "solo", "artistand", "long", "time", "releaseit", "album", "defin", "harmoni", "commun", "togeth", "back", "band", "compos", "member", "grate", "dead", "jefferson", "airplan", "notabl", "appear", "neil", "young", "joni", "mitchel", "graham", "nash", "time", "releas", "popular", "name", "music", "nearli", "come", "respect", "careerbest", "commerci", "peak", "sound", "glorious", "abstract", "music", "feel", "way", "dream", "sound", "tri", "retel", "morn", "foggi", "loos", "coher", "dissolv", "real", "time", "david", "crosbi", "fingerprint", "look", "earliest", "song", "hear", "artist", "fight", "confin", "popular", "music", "play", "guitar", "strang", "way", "opt", "odd", "tune", "carri", "song", "lyric", "unexpect", "place", "great", "song", "byrd", "everybodi", "burn", "sound", "littl", "like", "standard", "bass", "solo", "entir", "thing", "later", "cut", "call", "what", "happen", "sang", "sound", "like", "bare", "contain", "laughter", "like", "exasper", "say", "realiz", "word", "fail", "deepest", "vision", "band", "bare", "stori", "goe", "crosbi", "kick", "byrd", "reason", "pain", "work", "taken", "indulg", "long", "rant", "stage", "veer", "conspiraci", "theori", "assassin", "john", "f", "kennedi", "written", "troublesom", "littl", "song", "threesom", "continu", "nonmonogam", "streak", "accept", "role", "play", "stephen", "still", "buffalo", "springfield", "monterey", "pop", "festiv", "bandmat", "took", "sign", "disloyaltyor", "mayb", "just", "excus", "abandon", "soon", "dismiss", "byrd", "crosbi", "still", "began", "work", "holli", "graham", "nash", "new", "project", "focus", "tight", "songwrit", "threepart", "harmoni", "nash", "crosbi", "natur", "consist", "partner", "laugh", "joke", "provid", "comfort", "wisdom", "need", "join", "mayan", "long", "trek", "california", "coast", "near", "end", "rememb", "nash", "crosbi", "duet", "gorgeou", "wordless", "piec", "music", "scat", "best", "melodi", "crosbi", "wrote", "call", "song", "word", "announc", "proudli", "1970", "gestur", "nash", "call", "tree", "leav", "show", "he", "audienc", "laugh", "sleev", "record", "song", "titl", "nash", "parenthes", "symbol", "compromis", "speak", "group", "mental", "record", "music", "crosbi", "heard", "sketch", "friend", "forc", "natur", "creation", "album", "involv", "crosbi", "spend", "idl", "time", "studio", "lean", "wall", "collaps", "tear", "collabor", "arriv", "elev", "mood", "enliven", "music", "jerri", "garcia", "pedal", "steel", "joni", "mitchel", "harmoni", "vocal", "turn", "laugh", "convent", "song", "record", "psychfolk", "ideal", "lazi", "sunset", "gain", "reson", "subdu", "kaleidoscop", "open", "music", "love", "just", "plaintiv", "guitar", "riff", "choir", "turn", "commun", "everybodi", "say", "music", "love", "sing", "creat", "world", "true", "crosbi", "adam", "let", "pain", "defin", "record", "got", "understand", "ant", "doe", "pull", "leg", "told", "roll", "stone", "grief", "spoke", "desir", "sad", "himselfit", "horribl", "trip", "life", "need", "itso", "music", "remain", "escap", "album", "end", "middl", "peac", "broken", "sound", "song", "narr", "arc", "cowboy", "movi", "tell", "thinli", "veil", "stori", "csni", "dissip", "interest", "hippycomedown", "mytholog", "depict", "narrat", "find", "desper", "pass", "minut", "stori", "music", "gnarl", "paranoid", "skeleton", "young", "1969", "song", "river", "crackl", "fade", "like", "die", "campfir", "crosbi", "voic", "rag", "usual", "im", "die", "albuquerqu", "sing", "end", "sorriest", "sight", "saw", "record", "close", "song", "crosbi", "record", "cappella", "voic", "layer", "sound", "angel", "vast", "sit", "kind", "goof", "said", "experi", "sudden", "wasnt", "goof", "titl", "id", "swear", "somebodi", "close", "song", "identifi", "crosbi", "elegi", "christin", "record", "includ", "point", "write", "polit", "name", "loss", "traction", "rain", "clearest", "statement", "sound", "helpless", "haunt", "70", "crosbi", "slowli", "fell", "focu", "nash", "strong", "record", "duo", "csn", "hit", "drift", "apart", "nash", "knew", "band", "saw", "crosbi", "abandon", "jam", "crack", "pipe", "fell", "amp", "thing", "got", "wors", "point", "crosbi", "board", "mayan", "attempt", "flee", "cop", "eventu", "turn", "fbi", "left", "prison", "year", "later", "hair", "cut", "short", "icon", "mustach", "shave", "newli", "sober", "health", "began", "deterior", "nearli", "die", "liver", "failur", "90", "recov", "diabet", "heart", "diseas", "follow", "way", "rememb", "garner", "bigger", "reput", "unlik", "crosbi", "catalog", "misunderstood", "gener", "critic", "rediscov", "folk", "artist", "2000", "similarli", "cosmic", "work", "jude", "sill", "vashti", "bunyan", "notabl", "student", "crosbi", "year", "return", "record", "quiet", "hypnot", "headspac", "work", "newfound", "urgenc", "best", "recent", "record", "2018", "listen", "young", "collabor", "return", "demo", "60", "70", "finish", "thought", "abandon", "dont", "like", "stori", "your", "sing", "pick", "pen", "write", "inspir", "new", "phase", "career", "highlight", "that", "lost", "collabor", "friend", "time", "2014", "david", "crosbi", "sold", "mayan", "california", "billionair", "name", "beau", "vrolyk", "crosbi", "need", "money", "figur", "guy", "better", "care", "sail", "boat", "better", "blog", "dedic", "mainten", "vrolyk", "write", "passion", "mayan", "second", "life", "he", "boat", "habit", "futur", "gener", "got", "touch", "grandson", "origin", "builder", "learn", "histori", "enter", "race", "old", "boat", "need", "love", "write"], "date_published": ["2019-03-10T06:00:00"], "sentiment": 0.14273066421270017, "content": "The ’60s were over and David Crosby was living on a boat. Aside from the recording studio, his 59-foot schooner, named The Mayan, was the only place where things made sense. When Crosby was 11, his parents decided to enroll their son in sailing classes. The wild-eyed, giggling California kid had an anti-authoritarian streak that was starting to get him in trouble, and some time on the docks, they imagined, might give him some discipline, or at least a place to spend his summers. Sailing came naturally, like he had captained many vessels in a previous life. It was an uncanny feeling, comforting and strange. As the decade came to a close, Crosby wrote the title track of Crosby, Stills, Nash & Young’s blockbuster album Déjà Vu about this very sensation.\nAround the same time, he experienced his first major loss. In 1969, on her way to take the cats to the vet, Crosby’s girlfriend Christine Hinton swerved her van and crashed into a school bus. She died instantly. Grief-stricken and depressed, Crosby stood at the start of a long spiral that would consume his next two decades. “I watched a part of David die that day,” his bandmate Graham Nash wrote. “He wondered aloud what the universe was doing to him.” He turned to hard drugs. Fifteen years later, he was in prison, almost unrecognizable, the creative spark that had defined him all but dissipated. Crosby seemed to exist only in the past tense.\nIn the beautiful tragic comedy that is classic rock radio, David Crosby is almost never the protagonist. He’s more like the stoned sidekick—colorful, lovable, always just kind of around. Once in a while, he takes the lead, but his voice remains most recognizable as the one somewhere in the middle—first in the Byrds, next in CSN, and then in CSNY. Much has been said of his ego—and much of it by Crosby himself—but few artists have been so content to have a legacy defined by the people around them. Surrounded by friends, he was happy. “I had never seen anybody who had that much interest and joy and spontaneous reaction,” Grace Slick said of her first encounter with Crosby in the ’60s. “You could just look at his face and be delighted because there was a human being getting that childlike excitement out of stuff.”\nLike sailing, music came naturally to young Crosby. His awakening arrived at age four, when his mother took him to see a symphony orchestra in the park. He was transfixed by everything, save for the compositions themselves. He sat in awe of the chaotic murmurs as the musicians tuned their instruments; the syncopated dance of their elbows when they kicked into action; how a vast body of voices could unite, suddenly, in harmony. He noticed the way that none of these sounds would be nearly as powerful on their own. “It just broke over me like a wave,” he reflected. It’s a thread he followed throughout his career.\nWhile 1971’s If I Could Only Remember My Name is the first release credited to Crosby as a solo artist—and for a long time, the only release—it’s an album defined by harmony, community, and togetherness. The backing band is composed of members of the Grateful Dead and Jefferson Airplane, with notable appearances from Neil Young, Joni Mitchell, and Graham Nash. At the time of its release, these were some of the most popular names in music, nearly all of them coming off respective career-bests and commercial peaks. And yet together, they sound gloriously abstract. The music feels the way a dream sounds when you try to retell it in the morning: foggy, only loosely coherent, dissolving in real time.\nThis is David Crosby’s fingerprint. Look back at his earliest songs and you can hear an artist fighting against the confines of popular music. He played guitar in strange ways, opting for odd tunings that carried his songs and lyrics to unexpected places. His first great song, the Byrds’ “Everybody’s Been Burned,” sounds a little like a standard, except for the bass soloing through the entire thing. Later, in a cut called “What’s Happening?!?!,” he sang through what sounds like barely contained laughter, like someone exasperated with how much they have to say, realizing how words fail our deepest visions. The band can barely keep up with him.\nThe story goes, Crosby was kicked out of the Byrds for a few reasons. One, he was a pain to work with. Two, he had taken to indulging in long rants on stage, veering toward conspiracy theories about the assassination of John F. Kennedy. Third, he had written this troublesome little song about a threesome. Continuing his nonmonogamous streak, he had also accepted a role playing with Stephen Stills in Buffalo Springfield at the Monterey Pop Festival. His bandmates took it as a sign of disloyalty—or maybe just an excuse to abandon him. Soon after his dismissal from the Byrds, Crosby and Stills began working with the Hollies’ Graham Nash on a new project focused on tight songwriting and three-part harmony. With Nash, Crosby found his most natural and consistent partner: someone who laughed at his jokes, provided comfort and wisdom when he needed it, and joined him on The Mayan for long treks down the California coast.\nNear the end of If I Could Only Remember My Name, Nash and Crosby duet on a gorgeous, wordless piece of music, scatting along to one of the best melodies Crosby ever wrote. “I called it ‘A Song With No Words,’” he announces proudly at a show in 1970, gesturing toward Nash at his side. “He called it ‘A Tree With No Leaves.’ That shows you where he’s at.” The audience laughs. On the sleeve of the record, the song has both titles, Nash’s in parentheses, a symbolic compromise that speaks to the group mentality of the record. Alone with his music, Crosby heard sketches. With his friends around, they became forces of nature.\nThe creation of the album involved Crosby spending idle time alone in the studio, leaning against a wall or collapsing into tears, before his collaborators arrived to elevate the mood and enliven the music. Jerry Garcia’s pedal steel and Joni Mitchell’s harmony vocals turn “Laughing,” the most conventional song on the record, into the psych-folk ideal: a lazy sunset that gains resonance as it subdues. The kaleidoscopic opener  “Music Is Love” was just a plaintive guitar riff before the choir turned it into a commune. “Everybody’s saying that music is love,” they all sing, one after the other, creating a world where it’s true.\nCrosby was adamant not to let his pain define the record. “I got no more understanding than an ant does when you pull off his legs,” he told Rolling Stone about his grief. He spoke about his desire to keep the sadness to himself—“It was the most horrible trip of my life and nobody needs to go on it”—so that his music could remain an escape. The album ends up somewhere in the middle. It’s a peaceful but broken sound.\nThe only song with a narrative arc is “Cowboy Movie.” It tells the thinly veiled story of CSNY dissipating, less interesting for its hippy-comedown mythology than its depiction of a narrator finding himself more desperate and alone with each passing minute. The story is in the music too: a gnarled, paranoid skeleton of Young’s 1969 song “Down by the River” that crackles and fades like a dying campfire. Crosby’s voice is more ragged than usual. “Now I’m dying here in Albuquerque,” he sings at the end. “I might be the sorriest sight you ever saw.”\nThe record closes with two songs that Crosby recorded by himself. Both are mostly a cappella, his voice layered to sound angelic and vast. “I was sitting there, kind of goofing around,” he said of the experiments, “And then all of a sudden I wasn’t goofing around.” Titled “I’d Swear There Was Somebody Here,” the closing song has since been identified as Crosby’s elegy for Christine. On a record that includes some of his most pointed writing about politics (“What Are Their Names”) and loss (“Traction in the Rain”), this was his clearest statement. He sounds helpless, haunted.\nThroughout the ’70s, Crosby slowly fell out of focus. He and Nash made a few strong records as a duo and CSN had several more hits while they drifted apart. Nash knew the band was done when he saw Crosby abandoning a jam after his crack pipe fell from an amp. Things only got worse. At one point, Crosby boarded The Mayan in an attempt to flee from the cops before eventually turning himself in to the FBI. He left prison a year later with his hair cut short and his iconic mustache shaved off. Newly sober, his health began to deteriorate. He nearly died of liver failure in the ’90s, and, when he recovered, diabetes and heart disease followed.\nAlong the way, If I Could Only Remember My Name garnered a bigger reputation. Unlike anything else in Crosby’s catalog and misunderstood by its generation of critics, it was rediscovered by folk artists in the 2000s among similarly cosmic works by Judee Sill and Vashti Bunyan. Its most notable student, however, is Crosby himself. His last five years have found him returning to the record’s quiet, hypnotic headspace to work with a newfound urgency. On the best of his recent records, 2018’s Here If You Listen, he and his young collaborators return to some of the demos he made during the ’60s and ’70s, finishing the thoughts he abandoned. “If you don’t like the story you’re in,” he sings, “Pick up your pen and then write it again.”\nIt’s an inspiring new phase of his career, though it also highlights everything that’s been lost: collaborators, friends, time. In 2014, David Crosby sold The Mayan to a California billionaire named Beau Vrolyk. Crosby needed the money and figured this guy could take better care of it anyway. He hasn’t sailed since. The boat, however, has never been better. On a blog dedicated to its maintenance, Vrolyk writes passionately about the Mayan’s second life. He’s since made the boat more habitable for future generations. He got in touch with the grandson of the original builders to learn about its history. He even entered it in some races. “Old boats need love,” he writes. Some find it.\n", "pptitle": ["rememb"]}