{"id": "PF_35", "url": "https://pitchfork.com/reviews/albums/aretha-franklin-songs-of-faith-aretha-gospel/", "name": ["Songs", "of", "Faith:", "Aretha", "Gospel"], "description": ["record", "aretha", "franklin", "live", "new", "bethel", "baptist", "church", "hast", "street", "detroit", "michigan", "use", "sing", "congreg", "accompani", "piano", "hear", "voic", "aretha", "phrase", "turn", "familiar", "14", "year", "old", "1956", "song", "captur", "suffici", "impress", "begun", "sing", "church", "age", "entir", "brother", "cecil", "franklin", "said", "franklin", "famili", "bless", "preciou", "gene", "music", "ancestor", "aretha", "manifest", "talent", "ungodli", "earli", "age", "smokey", "robinson", "maintain", "came", "distant", "music", "planet", "children", "born", "gift", "fulli", "form", "song", "faith", "evid", "back", "claim", "aretha", "father", "rev", "cl", "franklin", "point", "nation", "star", "baptist", "church", "sunday", "sermon", "broadcast", "radio", "rev", "franklin", "invit", "preach", "congreg", "countri", "aretha", "travel", "essenti", "open", "father", "said", "father", "statur", "ensur", "aretha", "exposur", "lead", "gospel", "singer", "day", "particularli", "clara", "ward", "regard", "greatest", "soloist", "gospel", "histori", "accid", "record", "aretha", "tackl", "song", "ward", "perform", "ward", "sister", "appear", "rev", "franklin", "sister", "erma", "posit", "aretha", "sang", "song", "prove", "abil", "brother", "cecil", "maintain", "hear", "13yearold", "girl", "sound", "older", "wiser", "31yearold", "woman", "isnt", "aretha", "tri", "outshin", "clara", "just", "happen", "sister", "got", "sing", "earli", "record", "aretha", "captur", "detroit", "entrepreneur", "joe", "von", "battl", "record", "shop", "just", "street", "new", "bethel", "hast", "street", "heart", "black", "detroit", "time", "von", "battl", "began", "record", "distribut", "reverend", "sermon", "1953", "record", "song", "faith", "handiwork", "captur", "lone", "microphon", "given", "environ", "limit", "technolog", "clariti", "audio", "impress", "reissu", "bill", "remast", "doe", "slightli", "improv", "fidel", "previous", "circul", "record", "histori", "lesson", "asid", "phenomen", "element", "releas", "opportun", "hear", "aretha", "voic", "earli", "stage", "imbu", "power", "author", "known", "abil", "convey", "rang", "emot", "mood", "color", "keyboard", "vocal", "deliveri", "present", "wonder", "father", "soon", "decid", "need", "make", "break", "gospel", "turn", "popular", "music", "abil", "dictat", "sky", "limit", "album", "collect", "record", "gospel", "classic", "like", "fountain", "fill", "blood", "clara", "ward", "signatur", "number", "imposs", "rendit", "deliv", "teenag", "aretha", "summon", "patho", "feel", "ancient", "wash", "white", "snow", "yield", "temptat", "church", "favorit", "proudli", "make", "there", "fresh", "modern", "vocal", "deliveri", "decidedli", "secular", "bounc", "piano", "arrang", "like", "spend", "half", "hour", "time", "listen", "half", "hour", "aretha", "franklin", "music", "ministri", "worth", "minut", "listen", "rendit", "preciou", "lord", "split", "part", "fit", "78", "rpm", "record", "mahalia", "jackson", "sang", "preciou", "lord", "martin", "luther", "king", "jr", "funer", "aretha", "sang", "mahalia", "funer", "1956", "happen", "point", "stone", "gospel", "standard", "repertoir", "great", "perform", "level", "artist", "planet", "littl", "decad", "minut", "half", "invok", "line", "song", "unparallel", "magnific", "river", "lord", "ill", "stand", "guid", "feet", "hold", "hand", "hand", "preciou", "lord", "lead", "home", "shout", "testifi", "proclaim", "call", "glori", "achiev"], "date_published": ["2019-03-25T05:00:00"], "sentiment": 0.1768578643578643, "content": "These are the very first recordings of Aretha Franklin, live from the New Bethel Baptist Church on Hastings Street in Detroit, Michigan, where she used to sing for the congregation, accompanying herself on piano. You hear her voice, and she is already Aretha. There are phrasings and turns you are already familiar with. She was 14 years old in 1956 when these songs were captured, which is sufficiently impressive, but she had begun singing in church at the age of nine, which is something else entirely. Her brother Cecil Franklin said of the Franklin family, “We were blessed with the precious genes of our musical ancestors. But Aretha manifested that talent at an ungodly early age.” Smokey Robinson maintains, “She came from a distant musical planet where children are born with their gifts fully formed.” Songs of Faith is the evidence backing that claim.\nAretha’s father, the Rev. C.L. Franklin, was at this point a national star of the Baptist church, his Sunday sermons broadcast on radio. Rev. Franklin was invited to preach at congregations around the country, and Aretha traveled with him. “I essentially opened for my father,” she said. Her father’s stature also ensured Aretha’s exposure to the leading gospel singers of the day, particularly Clara Ward, regarded as one of the greatest soloists in gospel history. It’s not an accident that on this record, Aretha tackles not one, but three songs that Ward often performed when the Ward Sisters appeared with Rev. Franklin. Her sister Erma posited that Aretha sang those songs “to prove her abilities,” while her brother Cecil maintained, “If you hear a 13-year-old girl sounding older and wiser than a 31-year-old woman, it isn’t because Aretha was trying to outshine Clara. It’s just what happened when my sister got up to sing.”\nThese early recordings of Aretha were captured by Detroit entrepreneur Joe Von Battle, whose record shop was just down the street from New Bethel on Hastings Street, the heart of Black Detroit at that time. Von Battle began recording and distributing the Reverend’s sermons in 1953, and these recordings on Songs of Faith are his handiwork as well, captured with one lone microphone; given the environment and the limitations of the technology, the clarity of the audio is impressive, and this reissue is billed as a remaster, which does slightly improve the fidelity of the previously circulating recordings.\nHistory lesson aside, the phenomenal element of this release is the opportunity to hear Aretha’s voice in its early stages, already imbued with the power and authority she would become known for. Her ability to convey a range of emotions, moods, and colors both on the keyboard and in the vocal delivery is already present. It’s no wonder that she and her father would soon decide that she needed to make a break with gospel and turn to popular music, because her abilities dictated that the sky was the limit.\nThis is less an album than a collection of recordings, some gospel classics, like “There Is A Fountain Filled With Blood,” which was Clara Ward’s signature number; it seems impossible that this rendition is being delivered by a teenager, as Aretha summons a pathos that feels ancient. “He Will Wash You White As Snow” and “Yield Not To Temptation” are church favorites that she proudly makes her own: There’s a freshness and modernity to the vocal delivery as well as a decidedly secular bounce in the piano arrangement.\nIf you are not likely to spend half an hour of your time listening to half an hour of Aretha Franklin’s musical ministry, it is worth the six minutes to listen to her rendition of “Precious Lord,” split into two parts here so that it would fit on one 78 RPM record. Mahalia Jackson sang \"Precious Lord\" at Martin Luther King Jr.'s funeral, and Aretha herself sang it at Mahalia's funeral. But it’s 1956, and none of this has happened yet; the point is that this is a stone gospel standard in the repertoire of the greats, being performed at that level by an artist who had only been on the planet for little more than a decade. The last minute and a half of part two, when she is invoking the last three lines of the song, are unparalleled in their magnificence.\nAt the river, Lord I’ll stand,\nGuide my feet, hold my hand\nTake my hand, precious Lord, and lead me home\nShe is shouting, she is testifying, she is proclaiming, she is calling for glory; she is achieving all of this, and then some.\n", "pptitle": ["song", "faith", "aretha", "gospel"]}