{"id": "PF_51", "url": "https://pitchfork.com/reviews/albums/chai-punk/", "name": ["PUNK"], "description": ["consid", "follow", "lyric", "translat", "japanes", "pink", "butt", "cheek", "charmtwinkl", "jewel", "pearl", "princess", "twilight", "throw", "glitter", "mix", "distort", "vocal", "slightli", "jam", "multipl", "compet", "synth", "line", "add", "jolt", "fouronthefloor", "drum", "just", "hell", "im", "sugarrush", "bubblegum", "pop", "chai", "fourpiec", "discopunk", "band", "aspir", "destabil", "way", "beauti", "cute", "function", "japan", "embrac", "styliz", "camp", "match", "outfit", "nagoyabas", "band", "second", "album", "punk", "terrif", "current", "landscap", "indi", "rock", "produc", "song", "heavi", "note", "loss", "long", "chai", "band", "scream", "ye", "joy", "punk", "record", "written", "earnest", "love", "friend", "care", "think", "way", "live", "life", "dont", "know", "world", "know", "mei", "dont", "hide", "weight", "vocalist", "mana", "sing", "im", "punk", "kind", "bluntli", "feminist", "songwrit", "empower", "uncool", "women", "chai", "choos", "uncool", "singl", "time", "chai", "equal", "blog", "hous", "halcyon", "day", "ecstat", "joy", "downtown", "new", "waver", "like", "lizzi", "mercier", "descloux", "tom", "tom", "club", "album", "gleefulli", "overstuf", "30", "minut", "leav", "littl", "room", "come", "air", "great", "job", "resembl", "danc", "danc", "revolut", "song", "heard", "brightli", "lit", "suburban", "arcad", "win", "combin", "casino", "slot", "machin", "light", "synth", "mimic", "sound", "honk", "car", "horn", "vocal", "buzz", "innard", "track", "like", "swarm", "bee", "pollin", "greenhous", "fashionista", "jackhamm", "way", "neonlit", "guitar", "overdub", "get", "capitalist", "impuls", "industri", "cute", "makeupjust", "lip", "eyebrow", "setglossi", "yellow", "skinhav", "goe", "particularli", "emblemat", "line", "chai", "postpunk", "track", "built", "15second", "loop", "sound", "like", "march", "band", "brass", "quartet", "explor", "effect", "decay", "distort", "human", "voic", "listen", "song", "noisi", "layer", "come", "evok", "sight", "highli", "pressur", "whip", "cream", "explod", "closest", "chai", "come", "slow", "wintim", "starri", "pop", "song", "ring", "new", "year", "peopl", "love", "set", "synthes", "coat", "disco", "goopi", "band", "shift", "gear", "subdu", "set", "lyric", "travel", "deep", "space", "cold", "sky", "eclips", "laughto", "point", "bright", "quartet", "sing", "just", "song", "friendship", "wintim", "paint", "futur", "happi", "power", "pull", "planet", "night", "sky", "retrograd"], "date_published": ["2019-03-15T05:00:00"], "sentiment": 0.21187550975594455, "content": "Consider the following lyrics, as translated from Japanese: “Pink butt cheeks are my charm/Twinkle, jewels, pearls, princess, twilight!” Now throw some glitter into the mix: Distort those vocals ever so slightly, jam in multiple competing synth lines, and add a jolt of four-on-the-floor drums just for the hell of it. You now have “I’m Me,” a sugar-rush of bubblegum pop from Chai, the four-piece disco-punk band who aspire to destabilize the way beauty and cuteness function in Japan even as they embrace stylized camp and matching outfits.\nThe Nagoya-based band’s second album, PUNK, is terrifically over the top. The current landscape of indie rock produces songs with heavy notes of loss and longing. But Chai is a band who screams yes to joy, and PUNK is a record written in earnest about being yourself, loving your friends, and not caring about what anyone else thinks about the way you live your life. “I don’t know about the world but I know me/I don’t hide my weight,” vocalist Mana sings elsewhere in “I’m Me.” PUNK is full of that kind of bluntly feminist songwriting. If empowerment is uncool, the women of Chai would choose to be uncool every single time.\nChai call equally upon blog house’s halcyon days as they do the ecstatic joy of Downtown new wavers like Lizzy Mercier Descloux and Tom Tom Club. The album’s gleefully overstuffed 30 minutes leave little room to come up for air. Take “GREAT JOB,” which resembles a “Dance Dance Revolution” song as heard from the most brightly lit of suburban arcades. Winning combinations on casino slot machines light up, synths mimic the sound of honking car horns, and vocals buzz around the innards of the track like a swarm of bees pollinating a greenhouse. “Fashionista” jackhammers its way through neon-lit guitar overdubs while getting serious about the capitalistic impulses of industrial cuteness. “Too much makeup/Just lips and eyebrows all set/Glossy yellow skin/Have nothing more than this,” goes one particularly emblematic line. On “THIS IS CHAI,” a post-punk track built around a 15-second loop of what sounds like marching band brass, the quartet explores the effects of decay and distortion on the human voice. Listening to the all of the song’s noisy layers come together evokes the sight of a highly pressurized can of whipped cream exploding.\nThe closest Chai come to slowing down is “Wintime,” a starry pop song about ringing in the New Year with the people you love, set to synthesizers coated in disco goopiness. As the band shift gears into their most subdued setting, their lyrics travel to deep space: “In a cold sky the eclipse will laugh/To the point that it’s so bright,” the quartet sings. More than just a song about friendship, “Wintime” paints a future where happiness is powerful enough to pull the planets in the night sky out of retrograde.\n", "pptitle": ["punk"]}