{"id": "PF_55", "url": "https://pitchfork.com/reviews/albums/max-d-many-any/", "name": ["Many", "Any"], "description": ["washington", "dc", "metroplex", "10", "largest", "urban", "area", "usnot", "mention", "seat", "nation", "capitalth", "music", "produc", "tend", "feel", "insular", "intract", "unaffect", "outsid", "forc", "dc", "scene", "like", "hardcor", "punk", "gogo", "dmv", "hiphop", "sens", "commun", "incub", "21st", "centuri", "andrew", "fieldpick", "bit", "dc", "music", "punk", "drummer", "brokenbeat", "mc", "housemus", "produc", "jazzfus", "dabbler", "label", "futur", "time", "rang", "wildli", "year", "drop", "festiv", "hous", "boombap", "rb", "hiphop", "run", "jumbl", "amoeb", "fourth", "album", "max", "d", "fka", "maxmillion", "dunbar", "releas", "fanfar", "fellow", "dc", "imprint", "1432", "r", "draw", "sound", "like", "traffic", "circl", "citi", "fieldpick", "hub", "bring", "friend", "neighbor", "mike", "petillo", "protectu", "georip", "1432", "rs", "dawit", "eklund", "sami", "yenigun", "album", "listen", "feel", "casual", "choic", "track", "field", "record", "drag", "hard", "drive", "dropbox", "45", "minut", "breez", "past", "feel", "overthought", "random", "interludesa", "sneez", "airport", "termin", "crackl", "melt", "snowad", "littl", "breath", "room", "he", "tri", "creat", "dancefloor", "weapon", "explor", "dancer", "headspac", "approach", "careless", "inform", "hand", "electron", "music", "produc", "fieldpick", "craftsmanship", "come", "matter", "cut", "previou", "max", "d", "album", "show", "lith", "creami", "rhythm", "machin", "meter", "think", "soul", "peopl", "stiff", "robot", "yoga", "sevenminut", "track", "unfurl", "bass", "thump", "starchi", "snare", "slowli", "nudg", "apart", "incess", "throb", "vapor", "nois", "twirl", "space", "beat", "fall", "away", "altogeth", "pretti", "synthet", "swirl", "balloon", "track", "turn", "insid", "gentl", "ambient", "wash", "instead", "doe", "similar", "silki", "stutterstep", "fli", "room", "take", "early1990", "feel", "pepper", "small", "blip", "squiggl", "wriggli", "insid", "tackl", "box", "time", "prefer", "stasi", "product", "let", "loop", "roll", "fiddl", "dizzi", "hit", "dj", "tool", "dolo", "brush", "nod", "slipperi", "rhythm", "track", "releas", "dolo", "percuss", "cuz", "way", "throwback", "break", "early90", "hiphop", "chop", "vocal", "sampl", "chunki", "drum", "snip", "basslin", "cumul", "effect", "shoutout", "seefeel", "similarli", "construct", "just", "element", "mesmer", "longest", "track", "catalog", "shoutout", "seefeel", "stir", "videogam", "squelch", "gurgl", "pad", "tricki", "cymbal", "figur", "reverber", "guitar", "sound", "swim", "pool", "element", "rippl", "float", "weightless", "abruptli", "cut", "11", "minut", "feel", "short", "like", "45minut", "album", "offer", "expans", "look", "fieldpick", "casual", "subvers", "approach", "hous", "techno", "club", "track", "90", "rb"], "date_published": ["2019-03-16T05:00:00"], "sentiment": 0.005758281573498956, "content": "While the Washington, D.C. metroplex is one of the 10 largest urban areas in the U.S.—not to mention the seat of the nation’s capital—the music it produces tends to feel insular and intractable, unaffected by outside forces. D.C. scenes like hardcore punk, go-go, and DMV hip-hop show off a sense of both community and incubation. In the 21st century, Andrew Field-Pickering has been a bit of everything for D.C. music: punk drummer, broken-beat MC, house-music producer, jazz-fusion dabbler. His label Future Times also ranges wildly: In the last year it has dropped festive house, boom-bap R&B, and hip-hop that runs from jumbled to amoebic.\nMany Any, his fourth album as Max D (fka Maxmillion Dunbar), was released without much fanfare on fellow D.C. imprint 1432 R and draws on all of the above sounds. Like the traffic circles of his city, Field-Pickering is a hub himself, bringing together friends and neighbors Mike Petillo, of Protect-U and Geo-Rip, and 1432 R’s Dawit Eklund and Sami Yenigun. As an album listen, it feels as casual as a few choice tracks and field recordings that have been dragged from his hard drive into Dropbox. Its 45 minutes breeze past without feeling overthought, with random interludes—a sneeze in an airport terminal, the crackle of melting snow—adding a little breathing room. He’s not trying to create dancefloor weapons so much as explore dancers’ headspace. That approach might seem careless or informal in the hands of most electronic music producers, but Field-Pickering’s craftsmanship comes through no matter the cut.\nPrevious Max D albums showed off lithe, creamy rhythms, but the machine meter of “I Think Our Souls Are Other People” is stiff as robot yoga. As the seven-minute track unfurls, though, the bass thumps and starchy snares slowly get nudged further and further apart, first by an incessant throb and then by vaporous noises twirling around the space. Then the beat falls away altogether, and a pretty, synthetic swirl balloons until the track has turned itself inside out and become a gentle ambient wash instead. He does something similar to the silky stutter-step of “Fly Around the Room,” taking its early-1990s feel and peppering it with small blips and squiggles until it’s as wriggly as the inside of a tackle box.\nOther times he prefers stasis in his productions, letting the loops roll on without much fiddling. The dizzying hits of the DJ tool “Many Any Dolo Brush” nod to the slippery rhythm tracks he releases as Dolo Percussion. “Cuz Its the Way” is a throwback to the breaks of early-’90s hip-hop, all chopped vocal samples, chunky drums, and snipped basslines. The cumulative effect of “Shoutout Seefeel,” similarly constructed out of just a few elements, is mesmerizing. One of the longest tracks in his catalog, “Shoutout Seefeel” stirs video-game squelches, gurgling pads, tricky cymbal figures, and a reverberating guitar that seems to be sounding from the bottom of a swimming pool, every element rippling and floating weightless. When it abruptly cuts off after 11 minutes, it feels somehow too short, much like the 45-minute album itself. Even so, Many Any offers an expansive look at Field-Pickering’s casually subversive approach to house, techno, club tracks, and ’90s R&B.\n", "pptitle": []}