{"id": "PF_27", "url": "https://pitchfork.com/reviews/albums/zacari-run-wild-run-free/", "name": ["Run", "Wild", "Run", "Free"], "description": ["22yearold", "singersongwritersaxophonist", "zacari", "pacaldo", "kendrick", "lamar", "collabor", "dawg", "entertain", "signe", "fish", "guid", "right", "graduat", "high", "school", "california", "nativ", "start", "work", "summer", "alaska", "katmai", "nation", "park", "afford", "attend", "musician", "institut", "certif", "program", "lo", "angel", "eventu", "flyfish", "beartrack", "outdoorsman", "la", "zacari", "music", "career", "pop", "2016", "contribut", "vocal", "track", "tde", "heavi", "like", "isaiah", "rashad", "kendrick", "lamar", "absoul", "follow", "year", "zacari", "end", "kendrick", "heartfelt", "damn", "track", "love", "tender", "falsetto", "brighten", "grim", "album", "peopl", "clamor", "rel", "unknown", "artist", "year", "damn", "breakout", "zacari", "final", "unveil", "debut", "run", "wild", "run", "free", "ep", "project", "say", "indebt", "time", "spent", "natur", "lot", "sound", "tone", "drawn", "experi", "alaska", "explain", "want", "project", "feel", "like", "breath", "fresh", "air", "concept", "that", "broach", "pop", "sphere", "pharrel", "protg", "maggi", "roger", "viral", "hit", "alaska", "buoy", "lilt", "drum", "care", "place", "sampl", "collect", "cathart", "visit", "state", "run", "wild", "run", "free", "zacari", "tri", "establish", "feel", "clariti", "weightless", "ultim", "zacari", "ep", "burden", "clumsi", "songwrit", "bad", "advic", "zacari", "song", "riddl", "kind", "platitud", "post", "inspir", "pinterest", "board", "lone", "wolf", "zacari", "repeat", "provoc", "line", "didnt", "know", "id", "fail", "explor", "idea", "depth", "instead", "boast", "own", "gucci", "loafer", "titl", "track", "voic", "waver", "like", "he", "tri", "emul", "vulner", "rich", "sad", "king", "post", "malon", "yeah", "im", "anim", "yeah", "im", "radicalyeah", "sign", "horn", "im", "radic", "zacari", "just", "end", "sound", "like", "flounder", "rapper", "think", "differ", "word", "rhyme", "freestyl", "young", "invinc", "featur", "lil", "yachti", "equal", "cringeworthi", "zacari", "offer", "nickelodeondad", "vision", "rebelli", "young", "peopl", "ride", "town", "bump", "music", "loudempti", "bank", "account", "song", "antiestablishmentarianlit", "voic", "sound", "like", "yell", "intercom", "announc", "lil", "yachti", "come", "princip", "offic", "gag", "work", "yachti", "king", "teen", "turn", "21", "august", "sound", "like", "ounc", "commit", "goofbal", "class", "clown", "charact", "dont", "listen", "rule", "sing", "dour", "eeyoreish", "voic", "final", "get", "micdrop", "moment", "sheepishli", "offer", "fuck", "trump", "rich", "word", "trail", "like", "wait", "second", "run", "record", "booth", "zacari", "songwrit", "occasion", "bright", "moment", "he", "success", "intent", "employ", "repetit", "dont", "trip", "hook", "quit", "simpli", "goe", "whatchu", "trippin", "trippin", "trippin", "chug", "hook", "mimic", "rhythm", "cyclic", "argument", "describ", "hazi", "groov", "sooth", "friction", "gener", "lyric", "respit", "closest", "zacari", "get", "recreat", "magic", "kendrick", "love", "agil", "sentiment", "falsetto", "heartfelt", "tender", "background", "vocal", "pool", "rug", "drum", "intermitt", "sampl", "zacari", "kill", "romanc", "clunki", "line", "like", "morningsh", "give", "morn", "immedi", "follow", "incongru", "gorgeou", "vocal", "run", "common", "fail", "sad", "pop", "star", "like", "khalid", "billi", "eilish", "priorit", "captiv", "mood", "ahead", "lyric", "love", "zacari", "prove", "establish", "vibe", "debut", "ep", "he", "he", "capabl"], "date_published": ["2019-03-22T05:00:00"], "sentiment": 0.14446428571428568, "content": "Before 22-year-old singer/songwriter/saxophonist Zacari Pacaldo was a Kendrick Lamar collaborator and Top Dawg Entertainment signee, he was a fishing guide. Right after graduating high school, the California native started working summers at Alaska’s Katmai National Park so he could afford to attend Musicians Institute’s certificate program in Los Angeles, eventually becoming a fly-fishing, bear-tracking outdoorsman. But back in L.A., Zacari’s music career was popping off, and by 2016, he was already contributing vocals on tracks for TDE heavies like Isaiah Rashad, Kendrick Lamar, and Ab-Soul. The following year, when Zacari ended up on Kendrick’s heartfelt DAMN. track, “LOVE.,” his tender falsetto brightening up the otherwise grim album, people were clamoring to find out more about the relatively unknown artist.\nNow two years after his DAMN. breakout, Zacari has finally unveiled his debut Run Wild Run Free EP, a project he says is indebted to his time spent in nature. “A lot of the sounds and tones are drawn from my experiences in Alaska,” he explained. “I want the project to feel like a breath of fresh air.” It’s a concept that’s already been broached in the pop sphere by Pharrell protégée Maggie Rogers, whose viral hit “Alaska” is buoyed by lilting drums and carefully placed samples collected during her own cathartic visit to the state. Throughout Run Wild Run Free, Zacari tries to establish the same feeling of clarity and weightlessness. But ultimately, Zacari’s EP is too burdened with clumsy songwriting and bad advice.\nZacari’s songs are riddled with the kind of empty platitudes that would be posted up on a “inspirational” Pinterest board. On “Lone Wolf,” Zacari repeats the provocative line, “If I didn’t know myself, I’d be alone,” over and over again, but fails to explore the idea in depth and instead boasts about owning Gucci loafers. On the title track, his voice wavers like he’s trying to emulate the vulnerability of “Rich & Sad” king Post Malone: “Yeah, I'm an animal, yeah, I'm radical/Yeah, sign of the horns up, I'm radical.” Zacari just ends up sounding like a floundering rapper who can’t think of a different word to rhyme with in a freestyle.\n“Young and Invincible,” featuring Lil Yachty, is equally cringe-worthy. Zacari offers a Nickelodeon-dad vision of rebellious young people: “Riding around the town, bumping our music loud/Emptying bank accounts.” As if the song couldn’t get more anti-establishmentarian-lite, a voice that sounds like it’s yelling over the intercom announces, “Will Lil Yachty please come to the principal’s office.” This gag might have worked when Yachty was still the king of teens (he turned 21 in August), and if he sounded like he had an ounce of commitment to his goofball class clown character. “Don’t listen to the rules,” he sings in a dour, Eeyore-ish voice. And then when he finally gets to the mic-drop moment, he sheepishly offers “Fuck Trump, get rich,” his words trailing off like he couldn’t wait two more seconds to run out of the recording booth.\nZacari’s songwriting has occasional bright moments. He’s most successful when he intentionally employs repetition. On “Don’t Trip,” the hook quite simply goes: “Whatchu trippin’ on, trippin’ on, trippin’ on me for?” But the chugging hook mimics the rhythm of cyclical arguments he describes, while the hazy groove soothes the friction generated by his lyrics. It’s a respite.\nThe closest that Zacari gets to recreating the magic of Kendrick’s “LOVE.” is on “Ten Out of Ten.” His agile, sentimental falsetto is heartfelt, the tender background vocals pooling up against rugged drums and intermittent found samples. But Zacari kills the romance with clunky lines like, “Top of the morning/She gives me top in the morning,” immediately followed by a incongruously gorgeous vocal run. It’s a common failing of “sad” pop stars like Khalid and Billie Eilish, prioritizing a captivating mood ahead of the lyrics. On “LOVE.,” Zacari proved that he could establish a vibe. With his debut EP, he’s yet to show that he’s capable of much more.\n", "pptitle": ["run", "wild", "run", "free"]}