{"id": "PF_63", "url": "https://pitchfork.com/reviews/albums/gesaffelstein-hyperion/", "name": ["Hyperion"], "description": ["gesaffelstein", "french", "produc", "mike", "lvi", "built", "reput", "snarl", "fieri", "electron", "music", "deriv", "techno", "hand", "insist", "44", "puls", "assum", "sinist", "shape", "like", "kill", "eve", "villanel", "move", "pack", "club", "shiv", "readi", "career", "far", "31yearold", "releas", "nastysound", "music", "small", "montreal", "record", "label", "profil", "skyrocket", "coproduc", "kany", "west", "titan", "yeezu", "cut", "black", "skinhead", "send", "feroci", "stillinimit", "yeezu", "sound", "like", "thousand", "carcrash", "video", "autoplay", "browser", "windowprecis", "lvi", "highwaypileup", "sonic", "fit", "gesaffelstein", "banger", "isnt", "simpli", "walk", "away", "practic", "requir", "jaw", "life", "extric", "rude", "rumbl", "2013", "debut", "capit", "yeezu", "moment", "technic", "speak", "record", "year", "beraggress", "singl", "like", "pursuit", "hate", "glori", "moment", "simmer", "ambient", "reflect", "nod", "dimens", "palett", "elabor", "subtler", "work", "weeknd", "dear", "melancholi", "slow", "gfunk", "whine", "creep", "slither", "hurt", "gave", "mute", "glow", "similar", "weeknd", "daft", "punk", "collab", "feel", "come", "aesthet", "connect", "lvi", "daft", "punk", "dont", "end", "theyr", "labelm", "hardesthit", "gesaffelstein", "materi", "resembl", "roidedout", "brutalist", "hous", "hiphop", "daft", "punk", "explor", "homework", "second", "gesaffelstein", "album", "columbia", "hyperion", "lvi", "attempt", "channel", "access", "robot", "duo", "featur", "futurist", "pop", "vocal", "collabor", "rang", "weeknd", "pharrel", "haim", "toronto", "synthpop", "duo", "electr", "youth", "drive", "soundtrack", "fame", "hyperion", "feel", "meticul", "craft", "aleph", "sequenc", "evok", "journey", "dissimilar", "daft", "punk", "popasepcot", "ride", "random", "access", "memori", "2013", "decad", "experi", "belt", "hyperion", "suggest", "lvi", "isnt", "quit", "readi", "make", "profession", "leap", "album", "supposedli", "repres", "strongest", "track", "immedi", "impact", "sequenc", "titl", "track", "whirr", "oscil", "love", "synth", "spiral", "etern", "reset", "platon", "gesaffelstein", "experiencewonki", "hiphopinflect", "electron", "music", "respiratori", "sound", "angri", "turbin", "learn", "breath", "weeknd", "collab", "lost", "mark", "pair", "effect", "teamup", "date", "abel", "tesfay", "mjism", "blend", "seamlessli", "lvi", "inki", "background", "listen", "suss", "rank", "homophobia", "tesfay", "typic", "drab", "lyric", "attempt", "lascivi", "hyperion", "guest", "spot", "arent", "successfulevid", "jet", "black", "rang", "use", "wider", "color", "palett", "rel", "failur", "crossov", "attempt", "damn", "consid", "artist", "question", "effect", "collabor", "mainstream", "danc", "figur", "past", "stiff", "midtempo", "electr", "youth", "cut", "forev", "doesnt", "come", "close", "achiev", "weightless", "glori", "icon", "real", "hero", "french", "produc", "david", "grellier", "colleg", "project", "haim", "contribut", "misti", "bad", "lack", "impact", "perform", "calvin", "harri", "2015", "singl", "pray", "god", "lost", "pharrellfeatur", "blast", "offtwo", "song", "featur", "frequent", "daft", "punk", "collaboratorsc", "help", "come", "budgetlevel", "attempt", "replic", "past", "glori", "artist", "unfair", "judg", "hyperion", "weak", "work", "lvi", "suppos", "peer", "equal", "frustrat", "given", "real", "idea", "artist", "didnt", "invent", "roughandtumbl", "approach", "techno", "know", "churn", "instrument", "hyperion", "wouldv", "sound", "home", "amidst", "grabbag", "alephproof", "mayb", "consist", "true", "artist", "evolut", "remain", "lvi", "reach"], "date_published": ["2019-03-12T05:00:00"], "sentiment": 0.04296343537414967, "content": "As Gesaffelstein, the French producer Mike Lévy has built a reputation for snarling, fiery electronic music derived from techno. In his hands, the insistent 4/4 pulse assumes a sinister shape, like “Killing Eve”’s Villanelle moving through a packed club with a shiv at the ready. For much of his career thus far, the 31-year-old has released nasty-sounding music through a small Montreal record label, but his profile skyrocketed after co-producing Kanye West’s titanic Yeezus cuts “Black Skinhead” and “Send It Up.”\nAt its most ferocious, the still-inimitable Yeezus sounded like a thousand car-crash videos auto-playing in the same browser window—precisely why Lévy’s highway-pileup sonics fit in so well. A Gesaffelstein banger isn’t something you can simply walk away from; you practically require the Jaws of Life to extricate yourself. His rude and rumbling 2013 debut capitalized off his Yeezus moment (even though, technically speaking, it had been recorded two years before) with über-aggressive singles like “Pursuit” and “Hate or Glory” and moments of simmering ambient reflection that nodded to another dimension of his palette. He elaborated on this subtler side with his work on the Weeknd’s My Dear Melancholy,; “I Was Never There” slowed a G-funk whine to a creeping slither, and “Hurt You” gave off a muted glow similar to the Weeknd’s Daft Punk collab “I Feel It Coming.”\nThe aesthetic connections between Lévy and Daft Punk don’t end there; for one, they’re labelmates now. Some of the hardest-hitting Gesaffelstein material resembles a ’roided-out take on the brutalist house and hip-hop that Daft Punk explored on Homework. The second Gesaffelstein album and first for Columbia, Hyperion, is Lévy’s attempt to channel the more accessible side of the robot duo, featuring futuristic pop with vocal collaborations ranging from the Weeknd and Pharrell to Haim and Toronto synth-pop duo Electric Youth (of Drive soundtrack fame). Hyperion feels more meticulously crafted than Aleph, sequenced to evoke a journey not dissimilar to Daft Punk’s own pop-as-Epcot ride Random Access Memories from 2013.\nEven with a decade of experience under his belt, though, Hyperion suggests that Lévy isn’t quite ready to make the professional leap that the album supposedly represents. Its strongest tracks are immediate, both in impact and sequencing; the title track whirrs and oscillates with lovely synths spiraling into eternity, while “Reset” is the platonic Gesaffelstein experience—wonky, hip-hop-inflected electronic music with its own respiratory system, sounding as if angry turbines learned how to breathe. The Weeknd collab “Lost in the Fire” marks the pair’s most effective team-up to date: Abel Tesfaye’s MJ-isms blend so seamlessly with Lévy’s inky backgrounds that it might take a listen or two to suss out the rank homophobia of Tesfaye’s typically drab lyrical attempts at lasciviousness.\nHyperion’s other guest spots aren’t as successful—evidence that his jet black range could use a wider color palette. The relative failure of these crossover attempts is more damning considering that the artists in question have more effectively collaborated with mainstream dance figures in the past; the stiff, mid-tempo Electric Youth cut “Forever” doesn’t come close to achieving the weightless glory of their iconic “A Real Hero” with French producer David Grellier’s College project, while Haim’s contributions to the misty “So Bad” lacks the impact of their performance on Calvin Harris’ 2015 single “Pray to God.”\nEven “Lost in the Fire” and the Pharrell-featuring “Blast Off”—two songs featuring frequent Daft Punk collaborators—can’t help but come across as budget-level attempts to replicate past glories from other artists. If it seems unfair to judge Hyperion’s weaknesses against the work of Lévy’s supposed peers, it’s equally frustrating that he hasn’t yet given us a real idea of who he is as an artist. He didn’t invent the rough-and-tumble approach to techno that most know him for, and the churning instrumentals of Hyperion would’ve sounded at home amidst the grab-bag Aleph—proof, maybe, that while he has consistency on his side, true artistic evolution remains out of Lévy’s reach.\n", "pptitle": ["hyperion"]}