{"id": "PF_43", "url": "https://pitchfork.com/reviews/albums/the-coathangers-the-devil-you-know/", "name": ["The", "Devil", "You", "Know"], "description": ["coathang", "play", "atlanta", "hous", "parti", "2006", "bare", "play", "instrument", "began", "excus", "rowdi", "friend", "quickli", "evolv", "selftitl", "debut", "album", "lawless", "skullsmash", "potenc", "thirteen", "year", "later", "coathang", "develop", "riotou", "lofi", "earli", "work", "harmoni", "sound", "lose", "spiritu", "connect", "unprocess", "simplic", "belliger", "chaotic", "origin", "stori", "sixth", "studio", "album", "devil", "know", "collect", "gloriou", "cassettetap", "jam", "unfussi", "product", "tight", "melodi", "precis", "vocal", "harmoni", "fit", "easili", "toddler", "jigsaw", "puzzl", "bimbo", "peppi", "guitar", "riff", "drum", "loop", "bop", "sweetton", "vocal", "style", "guitarist", "julia", "kugel", "song", "shift", "jag", "riff", "support", "drummer", "stephani", "luke", "throati", "garbl", "vocal", "interplay", "hallmark", "coathang", "sound", "instinct", "wield", "near", "flawless", "good", "coathang", "song", "prove", "slick", "arrang", "facilit", "blunt", "messag", "substanc", "abus", "regularli", "punctuat", "lyric", "adderal", "desper", "ode", "prescriptiondrug", "depend", "2014", "suck", "shirt", "stand", "best", "song", "new", "album", "step", "offer", "quieter", "doom", "depict", "pain", "helpless", "addict", "scratchi", "guitar", "chord", "meredith", "franco", "basslin", "kugel", "reach", "love", "crisi", "youv", "gone", "long", "sing", "want", "fragil", "perform", "like", "sooth", "anecdotedissolut", "human", "spirit", "sound", "desir", "kugel", "hit", "ether", "oooooh", "song", "hook", "tender", "dissolv", "addict", "final", "slip", "arm", "care", "album", "melod", "strength", "occasion", "weak", "time", "littl", "earli", "raw", "appropri", "creep", "stranger", "danger", "instanc", "use", "extra", "muck", "franco", "bass", "punctuat", "horrormovi", "flavor", "rare", "sens", "caution", "collaps", "wellform", "set", "ratifi", "band", "unflinch", "code", "ethic", "ask", "rank", "group", "previou", "album", "noisey", "year", "kugel", "rank", "revers", "order", "devil", "know", "evolut", "continu"], "date_published": ["2019-03-20T05:00:00"], "sentiment": 0.14711760461760462, "content": "When the Coathangers played their first show at an Atlanta house party in 2006, they could barely play their instruments. What began as an excuse to get rowdy with friends quickly evolved into a self-titled debut album with lawless, skull-smashing potency.  Thirteen years later, the Coathangers have developed their riotous, lo-fi early work into a more harmonious sound without losing their spiritual connection to the unprocessed simplicity and belligerence of their chaotic origin story. Sixth studio album The Devil You Know is a collection of glorious cassette-tape jams with unfussy production, tight melodies, and precise vocal harmonies. It fits together as easily as a toddler’s jigsaw puzzle.\nOn \"Bimbo,\" a peppy guitar riff and drum loop bop along under the sweet-toned vocal stylings of guitarist Julia Kugel. The song then shifts into more jagged riffs to support drummer Stephanie Luke’s throaty garbles. The vocal interplay is a hallmark of the Coathangers’ sound, and their instincts when wielding it are near flawless.\nA good Coathangers song proves that slick arrangements can facilitate blunt messages. Substance abuse has regularly punctuated their lyrics: \"Adderall,\" a desperate ode to prescription-drug dependency from 2014’s Suck My Shirt, stands as one of their best songs. The new album’s “Step Back” offers a quieter but doomed depiction of the pain and helplessness of addiction. Over scratchy guitar chords and Meredith Franco’s bassline, Kugel reaches out to a loved one in crisis: “You’ve been gone too long,” she sings, “and I want you back.” Her fragile performance at first seems like a soothing anecdote—dissolution of the human spirit never sounded so desirable. Yet when Kugel hits the ethereal “ooooohs” on the song’s hook, her tenderness dissolves, as though the addict has finally slipped out of the arms of care.\nThe album’s melodic strengths can occasionally become a weakness, and at times a little more of that early rawness would have been appropriate. The creeping \"Stranger Danger,\" for instance, could have used some extra muck on Franco’s bass to punctuate its horror-movie flavor. But this rare sense of caution can’t collapse a well-formed set that ratifies the band’s unflinching code of ethics. When asked to rank the group’s previous albums by Noisey last year, Kugel ranked them in reverse order. On The Devil You Know, their evolution continues.\n", "pptitle": ["devil", "know"]}