{"id": "PF_19", "url": "https://pitchfork.com/reviews/albums/spiral-stairs-we-wanna-be-hyp-no-tized/", "name": ["We", "Wanna", "Be", "Hyp-No-Tized"], "description": ["scott", "kannberg", "enjoy", "kind", "indierock", "legaci", "easili", "undon", "lack", "tri", "wanna", "hypnot", "pavement", "cofound", "album", "spiral", "stair", "fifth", "solo", "lp", "overal", "count", "tediou", "ventur", "preston", "school", "industri", "repres", "strongest", "immedi", "appeal", "output", "date", "hypnot", "eventu", "succumb", "central", "conundrum", "kannberg", "postpav", "output", "he", "particularli", "compel", "songwrit", "album", "aspir", "cultclass", "obscur", "land", "realm", "toler", "gener", "twangi", "sunbronz", "rock", "familiar", "spiral", "stair", "territori", "explor", "2009", "real", "feel", "year", "later", "2017", "dori", "dagger", "hypnot", "acceler", "style", "faster", "clip", "gener", "supplement", "guitar", "part", "saxophon", "trumpet", "occasion", "foray", "psychedeliaon", "jaunti", "open", "hypnot", "probabl", "strongest", "track", "bunch", "btg", "short", "blame", "governmentfeel", "effect", "quit", "revelatori", "kannberg", "assur", "nasal", "singer", "achiev", "credit", "imit", "van", "morrison", "lyric", "abil", "continu", "lag", "instrument", "talent", "nearli", "turn", "he", "hamper", "clunki", "phrase", "regrett", "rhyme", "conveni", "dress", "clownyou", "just", "hide", "frown", "idea", "eloqu", "express", "there", "bad", "go", "denmark", "dori", "dagger", "incorpor", "person", "reflect", "hypnot", "tap", "time", "vagu", "polit", "theme", "nonspecif", "approach", "offer", "advantag", "unit", "state", "long", "polit", "nightmar", "need", "introduct", "doe", "want", "rhyme", "trump", "cumul", "effect", "uninspir", "swampland", "rebuk", "washington", "dc", "embrac", "hackney", "metaphor", "fingerprintz", "begin", "decri", "partisan", "bicker", "halfway", "meander", "thicket", "instrument", "return", "subject", "album", "topic", "entri", "borderlin", "address", "sensation", "talk", "border", "wall", "migrant", "caravansissu", "kannberg", "californian", "live", "mexico", "offer", "perspect", "song", "oper", "trite", "indel", "couplet", "theyll", "breadand", "shoot", "dead", "dim", "appeal", "solid", "pseudoclass", "rock", "near", "imposs", "avoid", "comparison", "bandmat", "stephen", "malkmu", "latterday", "career", "yield", "incis", "commentari", "senat", "middl", "america", "enjoy", "nonsens", "determin", "listen", "entireti", "greater", "pavementrel", "discographi", "sure", "thing", "appreci", "confid", "strut", "titl", "track", "guitar", "lap", "corner", "kannberg", "vocal", "hold", "til", "figur", "excit", "moment", "help", "elev", "wanna", "hypnot", "predecessor", "high", "bar", "clear"], "date_published": ["2019-03-27T05:00:00"], "sentiment": 0.11363731656184488, "content": "Scott Kannberg enjoys the kind of indie-rock legacy that can’t be easily undone, but not for lack of trying. We Wanna Be Hyp-No-Tized is the Pavement co-founder’s third album as Spiral Stairs, or his fifth solo LP overall, counting two sometimes tedious ventures as Preston School of Industry. Though it represents his strongest and most immediately appealing output to date, Hyp-No-Tized eventually succumbs to the central conundrum of Kannberg’s post-Pavement output: On his own, he’s not a particularly compelling songwriter. The album aspires to cult-classic obscurity and lands in the realm of the tolerably generic.\nTwangy, sun-bronzed rock is familiar Spiral Stairs territory, explored first on 2009’s The Real Feel and again eight years later on 2017’s Doris and the Daggers. Hyp-No-Tized accelerates the style to a faster clip, generously supplementing its guitar parts with saxophone and trumpet. The occasional forays into psychedelia—on jaunty opener “Hyp-No-Tized,” probably the strongest track of the bunch, and “BTG,” short for “Blame the Government”—feel effective, if not quite revelatory. Kannberg is a more assured and less nasal singer than he once was, an achievement he credits to imitating Van Morrison. But his lyrical abilities continue to lag behind his instrumental talents: At nearly every turn, he’s hampered by clunky phrasing, whether regrettable rhymes of convenience (“You were dressed up as a clown[...]/You just couldn’t hide your frown”) or ideas more eloquently expressed elsewhere (“There’s something bad going down in Denmark”).\nWhere Doris and the Daggers incorporated more personal reflection, Hyp-No-Tized taps into a timely but vague political theme. The nonspecific approach offers advantages: The United States’ long political nightmare needs no introduction, nor does anyone want to find out what rhymes with “Trump.” The cumulative effect, though, is uninspired. “Swampland” rebukes Washington, D.C. by embracing its most hackneyed metaphor. “Fingerprintz” begins by decrying partisan bickering, but halfway through it meanders into a thicket of instrumentation, never to return to the subject.\nThe album’s most topical entry, “Borderline,” addresses sensationalized talk of border walls and migrant caravans—issues on which Kannberg, as a Californian now living in Mexico, could offer a perspective. Yet the song operates in trite and indelicate couplets (“They’ll take your bread/And shoot you dead”), dimming the appeal of what would otherwise be solid pseudo-classic rock. As always, it’s near impossible to avoid comparison to former bandmate Stephen Malkmus, whose latter-day career has yielded both more incisive commentary (“Senator,” “Middle America”) and more enjoyable nonsense.\nThose determined to listen to the entirety of the greater Pavement-related discography will surely find things to appreciate: the confident strut of the title track, the guitars that lap and corner around Kannberg’s vocals on “Hold On (Til I Figure It Out).” These are exciting moments and help elevate We Wanna Be Hyp-No-Tized above its predecessors, which is not a high bar to clear.\n", "pptitle": ["wanna", "hypnot"]}