{"id": "PF_99", "url": "https://pitchfork.com/reviews/albums/ryuichi-sakamoto-bttb-20th-anniversary-edition/", "name": ["BTTB", "(20th", "Anniversary", "Edition)"], "description": ["late", "1990", "japanes", "compos", "ryuichi", "sakamoto", "stuck", "tokyo", "traffic", "jam", "melodi", "pop", "head", "drive", "standstil", "call", "home", "sang", "answer", "machin", "rememb", "time", "japan", "grip", "lost", "decad", "period", "econom", "downturn", "follow", "inflat", "tech", "optim", "conspicu", "consumpt", "1980", "y2k", "anxieti", "gather", "momentum", "amid", "stress", "busi", "citi", "street", "melodi", "harbor", "yearn", "reflect", "pleasur", "possibl", "meander", "littl", "tune", "eventu", "grew", "opu", "open", "track", "sakamoto", "midcar", "solo", "piano", "album", "bttb", "bttb", "acronym", "basic", "gener", "rememb", "homag", "sakamoto", "do", "sati", "paint", "impressionist", "scene", "speak", "subconsci", "memori", "tendenc", "behav", "like", "wateron", "minut", "flood", "sens", "smooth", "away", "detail", "bttb", "case", "weirder", "prescient", "occasion", "humor", "moment", "wash", "public", "record", "fair", "album", "form", "fluid", "start", "releas", "japan", "novemb", "1998", "14", "track", "reissu", "just", "month", "later", "addit", "somber", "snake", "eye", "fourhand", "piano", "version", "1979", "song", "tong", "poo", "sakamoto", "huge", "influenti", "yellow", "magic", "orchestra", "subsequ", "european", "version", "did", "away", "experiment", "track", "make", "room", "commerci", "offer", "new", "20thanniversari", "edit", "feel", "like", "sakamoto", "director", "cut", "18", "track", "combin", "1999", "japanes", "releas", "cut", "2000", "statesid", "version", "adsoundtrackturnedhitsingl", "energi", "flow", "beauti", "loop", "closer", "call", "revers", "odd", "plaintiv", "piano", "play", "bacteria", "sleep", "omit", "european", "releas", "use", "mouth", "harp", "bring", "life", "microscop", "world", "sound", "mouth", "harp", "peculiar", "vibrat", "decay", "rate", "piano", "note", "track", "midalbum", "posit", "offer", "palat", "cleanser", "stream", "familiar", "sound", "curio", "remind", "listen", "piano", "string", "interior", "mechan", "timeless", "appeal", "emphas", "point", "sakamoto", "lift", "piano", "lid", "trio", "composit", "album", "half", "use", "prepar", "piano", "channel", "sati", "john", "cage", "prelud", "rubber", "eras", "blunt", "vibrat", "piano", "string", "conjur", "xylophon", "rust", "sonata", "appli", "similar", "process", "tripl", "pace", "forc", "overlap", "note", "disson", "energi", "suggest", "mate", "undiscov", "bird", "trip", "recept", "partner", "uetax", "rais", "eyebrow", "classic", "listen", "critic", "expect", "pretti", "piano", "piec", "wateri", "gurgl", "unlik", "stomach", "middigest", "obscur", "faint", "voic", "imagin", "mic", "insid", "contain", "water", "atop", "piano", "string", "track", "share", "waterproof", "microphon", "design", "hurrican", "condit", "process", "import", "feelingin", "swerv", "convent", "tickl", "delight", "clear", "way", "aqua", "piano", "version", "synth", "instrument", "sakamoto", "wrote", "album", "daughter", "miu", "close", "balladri", "bttb", "get", "uetax", "prepar", "piano", "sibl", "predict", "sakamoto", "2017", "album", "async", "introspect", "adventur", "ambient", "zone", "reintroduct", "remind", "he", "break", "boundari", "music", "mere", "sound", "decad", "finger", "ravel", "brahm", "ye", "sati", "ambl", "alongsid", "sakamoto", "bttb", "appetit", "nest", "experiment", "sonic", "atmospher", "meander", "mark", "album", "contemporari", "treasur", "snatch", "moment", "paus", "bttb", "suggest", "surest", "path", "fresh", "perspect"], "date_published": ["2019-03-02T06:00:00"], "sentiment": 0.12906660949113777, "content": "Sometime in the late 1990s, Japanese composer Ryuichi Sakamoto was stuck in a Tokyo traffic jam. A melody had popped into his head while he was driving; during the standstill, he called home and sang it into his answering machine, he remembers. At the time, Japan was still in the grips of “The Lost Decade,” a period of economic downturn following the inflated tech optimism and conspicuous consumption of the 1980s. Y2K anxiety was gathering momentum. Amid the stress of busy city streets, the melody harbored a yearning for the reflective pleasures and possibilities of meandering. The little tune eventually grew into “Opus,” the opening track of Sakamoto’s mid-career solo piano album, BTTB.\nBTTB, an acronym for “Back to the Basics,” has generally been remembered as homage: Sakamoto doing Satie, painting impressionistic scenes to speak to the subconscious. Memory, however, has a tendency to behave like water—one minute flooding the senses, the next smoothing away details. In BTTB’s case, the weirder, more prescient, and occasionally humorous moments have been washed from the public record. To be fair, the album’s form was fluid from the start. First released in Japan in November 1998 with 14 tracks, it was reissued just four months later with the addition of the somber “Snake Eyes” and a four-handed piano version of the 1979 song “Tong Poo,” from Sakamoto’s hugely influential Yellow Magic Orchestra. Subsequent European and U.S. versions did away with some experimental tracks to make room for more commercial offerings.\nThis new 20th-anniversary edition feels like Sakamoto’s director’s cut. With 18 tracks, it combines the 1999 Japanese release with two cuts from the 2000 stateside version: the ad-soundtrack-turned-hit-single “Energy Flow” and a beautifully looping closer called “Reversing.” At odds with much of the plaintive piano playing, “Do Bacteria Sleep,” omitted from European and U.S. releases, uses a mouth harp to bring to life a microscopic world of sound. The mouth harp’s peculiar vibrations decay at more or less the same rate as a piano’s notes, so the track’s mid-album position offers a palate cleanser within the stream of familiar sounds. Still, the curio reminds the listener of the piano’s stringed interior, the mechanics of its timeless appeal.\nAs if to emphasize the point, Sakamoto lifts the piano’s lid on a trio of compositions during the album’s back half, using a prepared piano to channel Satie via John Cage. During “Prelude,” rubber erasers blunt the vibrations of the piano strings, conjuring a xylophone rusting in a well. “Sonata” applies a similar process to a tripled pace, forcing the overlapping notes into dissonance. The energy suggests the mating call of some undiscovered bird, tripping over itself to find a receptive partner.\n“Uetax” raised the most eyebrows among classical listeners and critics expecting only pretty piano pieces. Watery gurgles, not unlike a stomach mid-digestion, obscure a very faint voice. One imagines a mic inside a container of water atop the piano strings; the track even shares a name with a waterproof microphone designed for hurricane conditions. But the process is less important than the feeling—in its swerving of convention, it tickles and delights. It also clears the way for “Aqua,” a piano version of a synth instrumental Sakamoto wrote for an album by his daughter, Miu. It is as close to balladry as BTTB gets.\n“Uetax” and its prepared piano siblings predict Sakamoto’s 2017 album, async, which found him in an introspective yet adventurously ambient zone; their reintroductions here are reminders that he’s been breaking boundaries between music and mere sound for decades. While the fingers of Ravel, Brahms, and, yes, Satie all amble alongside Sakamoto’s on BTTB, his appetite for nesting experimental sonics within atmospheric meanderings mark the album as a contemporary treasure. Snatching a moment of pause, BTTB suggests, is the surest path to a fresh perspective.\n", "pptitle": ["bttb", "20th", "anniversari", "edit"]}