{"id": "PF_47", "url": "https://pitchfork.com/reviews/albums/dj-jenifa-jag-trax/", "name": ["Jag", "Trax"], "description": ["guess", "ymca", "chelmsford", "essex", "commut", "hub", "30", "mile", "outsid", "london", "hotb", "electron", "music", "talent", "town", "nativ", "tom", "jenkinson", "aka", "squarepush", "allegedli", "play", "1987", "12yearold", "old", "band", "sub", "zero", "accord", "old", "bio", "quot", "music", "maker", "forum", "year", "later", "derwin", "dicker", "better", "known", "gold", "panda", "saw", "squarepush", "aphex", "twin", "perform", "50", "peopl", "didnt", "recogn", "artist", "time", "complet", "camouflag", "dj", "booth", "recal", "2013", "interview", "later", "chelmsford", "make", "appear", "jag", "trax", "fulllength", "dicker", "surprisereleas", "month", "new", "alia", "dj", "jenifa", "album", "open", "dresscod", "male", "voic", "deadpan", "chelmsford", "saturday", "threechord", "keyboard", "motif", "sadtrombon", "blast", "bent", "wildli", "shape", "white", "shirt", "blue", "jean", "brown", "shoe", "continu", "mike", "skinner", "just", "get", "start", "yuppi", "brunch", "crowd", "track", "reveal", "smirk", "dicker", "realli", "shown", "interview", "unless", "count", "titl", "track", "2011", "companion", "suppos", "say", "thank", "shit", "gold", "panda", "owe", "tet", "warm", "intric", "electron", "j", "dilla", "master", "sampl", "dresscod", "closer", "sardon", "hous", "product", "like", "santiago", "salazar", "cool", "cut", "club", "went", "hollywood", "open", "jag", "trax", "distinct", "statement", "meant", "clearli", "separ", "dicker", "main", "gig", "hustl", "dan", "snaith", "daphni", "project", "carib", "dj", "jenifa", "clubori", "gold", "panda", "jag", "trax", "sleek", "propuls", "altern", "dicker", "histor", "samplestuf", "style", "breathlessli", "hypnot", "singl", "2010", "lucki", "shiner", "cherrypick", "element", "bargainbin", "vinyl", "press", "india", "mexico", "japan", "2013", "half", "live", "namecheck", "brazil", "hong", "kong", "japanes", "island", "enoshima", "run", "sampl", "s950", "akai", "mpc", "gold", "panda", "conjur", "ecstat", "panglob", "pinwheel", "mood", "tone", "color", "textur", "danc", "music", "trace", "time", "place", "dj", "jenifa", "genealog", "selfevid", "pledg", "allegi", "chicago", "hous", "es1a31flora", "play", "intersect", "disco", "garag", "trainfilters2", "serv", "lush", "handshigh", "ripper", "whyileft122", "doesnt", "attempt", "fulli", "camouflag", "who", "monik", "chime", "cymbal", "tap", "beguil", "violin", "figur", "mll", "briefli", "trick", "think", "itun", "shuffl", "gold", "panda", "whocares8087b", "wouldnt", "place", "2016", "nostalgia", "collag", "good", "luck", "best", "releas", "casual", "offthecuffit", "paywhatyouwish", "download", "track", "titl", "read", "like", "file", "namesjag", "trax", "focus", "function", "kickandclap", "workout", "tuesday", "tuesdaystringsmix", "dancefloor", "tool", "selector", "selector", "tough", "imposs", "distinguish", "shazam", "highlight", "dj", "set", "album", "worth", "servic", "hous", "jam", "like", "toolbox", "screwdriv", "matter", "variat", "pretti", "candycolor", "handl", "theyr", "limit", "util", "guis", "dj", "jenifa", "dicker", "sacrif", "littl", "bit", "worldli", "whimsic", "charm", "make", "gold", "panda", "sampledel", "shangrila", "worth", "return", "hear", "track", "pump", "dj", "booth", "say", "know", "who"], "date_published": ["2019-03-21T05:00:00"], "sentiment": 0.11210150446261553, "content": "You might not guess that the YMCA in Chelmsford, Essex, a commuter hub about 30 miles outside of London, is a hotbed of electronic music talent. It’s where town native Tom Jenkinson, aka Squarepusher, allegedly played his first show, in 1987, as a 12-year-old with his old band Sub Zero, according to an old bio quoted on the We Are the Music Makers forum. Years later, it’s also where Derwin Dicker, better known as Gold Panda, saw Squarepusher and Aphex Twin perform for about 50 people, even though he didn’t recognize the artists at the time. “They were both completely under camouflage in a DJ booth,” he recalled in a 2013 interview. “It was only later that I found out who they were.”\nChelmsford makes an appearance at the top of Jag Trax, a full-length Dicker surprise-released this month under his new alias DJ Jenifa. On album opener “Dresscode,” a male voice deadpans, “Chelmsford on a Saturday,” over a three-chord keyboard motif with sad-trombone blasts bent wildly out of shape. “White shirt. Blue jeans. Brown shoes,” he continues, as though he were Mike Skinner just getting started on yuppie brunch crowds.\nThe track reveals a smirking side of Dicker he hasn’t really shown before, except in interviews, unless you count him titling a track on 2011’s Companion “I Suppose I Should Say Thanks or Some Shit.” While Gold Panda owes as much to Four Tet’s warm, intricate electronics as J Dilla’s masterful sampling, “Dresscode” is closer to sardonic house productions like Santiago Salazar’s cool and cutting “Your Club Went Hollywood.” Opening Jag Trax with such a distinctive statement is meant to clearly separate Dicker’s main gig from his side hustle.\nAs Dan Snaith’s Daphni side project is to Caribou, DJ Jenifa is more club-oriented than Gold Panda. Jag Trax is a sleek and propulsive alternative to Dicker’s historically sample-stuffed style. The breathlessly hypnotic single “You,” off of 2010’s Lucky Shiner, cherry-picks elements from bargain-bin vinyl pressed in India, Mexico, and Japan, while 2013’s Half of Where You Live name-checks Brazil, Hong Kong, and the Japanese island Enoshima. Running these samples through his S950 and Akai MPC, Gold Panda conjures ecstatic, pan-global pinwheels of moods, tone colors, and textures. It’s dance music that can’t be traced to time or place.\nDJ Jenifa’s genealogy is more self-evident. He pledges allegiance to Chicago house (“ES1A31Flora”), plays with the intersection of disco and garage (“Trainfilters2”), and serves up lush, hands-high rippers (“Whyileft122”). Still, he doesn’t attempt to fully camouflage who’s behind the moniker. The chiming cymbal taps and beguiling violin figures on “MLL” briefly tricked me into thinking my iTunes had shuffled to Gold Panda, and “Whocares808_7B” wouldn’t be out of place on 2016’s nostalgia collage Good Luck and Do Your Best.\nThough the release seems casual and off-the-cuff—it’s a pay-what-you-wish download with track titles that read like file names—Jag Trax is focused and functional. Kick-and-clap workouts “Tuesday” and “TuesdaySTRINGSMIX” are dancefloor tools, for selectors by a selector. But it’s tough, if not impossible, to distinguish the Shazamable highlight of a DJ set on an album’s worth of serviceable house jams. It’s like a toolbox full of screwdrivers: No matter how many variations, or how pretty the candy-colored handles, they’re limited in their utility. Under the guise of DJ Jenifa, Dicker has sacrificed a little bit of the worldly, whimsical charm that makes Gold Panda’s sampledelic Shangri-La worth returning to. At least if you hear one of these tracks pumping out from the DJ booth, you can say you know who’s behind it.\n", "pptitle": ["jag", "trax"]}