{"id": "PF_7", "url": "https://pitchfork.com/reviews/albums/billie-eilish-when-we-all-fall-asleep-where-do-we-go/", "name": ["When", "We", "All", "Fall", "Asleep,", "Where", "Do", "We", "Go?"], "description": ["billi", "eilish", "suddenli", "obscen", "famou", "pop", "starth", "kind", "15", "million", "instagram", "follow", "soldout", "show", "world", "haut", "model", "contract", "couch", "time", "ellen", "degener", "brillianc", "obviou", "truth", "just", "ask", "teenag", "america", "wait", "patient", "rest", "world", "catch", "consumm", "tast", "pop", "music", "cours", "17yearold", "eilish", "wait", "teeth", "straighten", "fact", "trumpet", "arriv", "debut", "album", "fall", "asleep", "intro", "eilish", "remov", "muchloath", "transpar", "brace", "seri", "lightli", "gross", "asmrworthi", "slurp", "proclaim", "taken", "invisalign", "album", "dissolv", "heav", "cackl", "kind", "alien", "onlook", "prissi", "partak", "oddbal", "moment", "like", "thisabsentmind", "hum", "track", "giggl", "asidesthat", "remind", "she", "precoci", "creativ", "teen", "girl", "rocket", "gothic", "procliv", "dont", "cancel", "she", "enjoy", "ride", "rise", "strike", "14", "song", "ocean", "eye", "soundcloud", "glassi", "straightforward", "ballad", "tear", "synth", "woozi", "lana", "del", "reyindebt", "croon", "snare", "young", "fanbas", "hook", "rais", "middl", "finger", "pop", "statu", "quo", "music", "shift", "genresfrom", "pop", "trap", "edmmad", "lawless", "young", "femal", "singer", "sport", "baggi", "androgyn", "cloth", "cast", "bore", "listless", "eye", "upward", "instead", "bat", "camera", "fill", "video", "flow", "black", "tear", "plung", "needl", "arachnid", "hor", "doeuvr", "instead", "twirl", "sleek", "cityscap", "eilish", "creepi", "eccentr", "feel", "remov", "pop", "formula", "help", "distanc", "music", "industri", "histor", "lewd", "macer", "teen", "idol", "eilish", "just", "sharper", "meaner", "selfsufficienta", "young", "star", "lo", "angel", "grand", "tradit", "come", "hill", "burn", "best", "moment", "fall", "asleep", "play", "firmli", "formula", "inspir", "eilish", "frequent", "night", "terror", "lucid", "dream", "album", "juggl", "dark", "compuls", "grim", "eulog", "balanc", "featheri", "vocal", "deep", "grisli", "bass", "like", "spirit", "anim", "spider", "eilish", "weav", "delic", "grotesqu", "crown", "lull", "listen", "fals", "idyl", "murmur", "lilt", "leap", "cliff", "tecton", "dubstep", "bass", "drop", "sneer", "fulli", "audibl", "titl", "crib", "moriarti", "beguil", "psychopath", "televis", "sherlock", "speak", "pull", "sinist", "xanni", "plumb", "anxieti", "marrowshak", "bass", "kind", "blast", "apart", "pair", "headphon", "eilish", "voic", "crossfad", "narcolept", "beat", "slip", "despair", "whimper", "selfawar", "line", "record", "dont", "tri", "kiss", "sidewalkon", "cigarett", "breaki", "afford", "love", "someonewho", "isnt", "die", "mistak", "silver", "lake", "eilish", "lyric", "wonder", "underscor", "teen", "angst", "fierc", "affect", "partial", "inform", "similar", "spirit", "drive", "buri", "friend", "earli", "singl", "despit", "vocoderstyl", "distort", "eilish", "voic", "feel", "intim", "hiss", "step", "glass", "stapl", "tongu", "farcic", "singsong", "eilish", "namecheck", "tyler", "creator", "greatest", "influenc", "slightli", "jazzi", "trill", "nod", "clearest", "pop", "progenitor", "lord", "clear", "eilish", "path", "autonom", "creativ", "control", "heavylid", "social", "observ", "blith", "goth", "aura", "eilish", "weaponri", "stop", "overtli", "pop", "track", "bad", "guy", "go", "stale", "snappi", "puls", "launch", "eilish", "litani", "taunt", "partner", "rubberi", "electro", "beat", "say", "she", "makeyourgirlfriendmad", "typemightseduceyourdad", "type", "gave", "paus", "suggest", "eilish", "isnt", "far", "remov", "teen", "pop", "continuum", "weve", "come", "believ", "differ", "brag", "statutori", "rape", "cultur", "truss", "16yearold", "britney", "spear", "pigtail", "plaid", "teen", "girl", "decis", "entir", "flaunt", "sexual", "engag", "provoc", "roleplay", "line", "cross", "boundari", "plenti", "adult", "happi", "cosign", "quieter", "moment", "fall", "asleep", "nod", "eilish", "past", "mix", "result", "like", "ep", "2017", "dont", "smile", "skew", "glum", "instead", "macabr", "briefli", "twee", "wish", "gay", "spotlight", "eilish", "vocal", "deserv", "better", "spackl", "can", "studio", "laughter", "selfinvolv", "lyric", "lament", "lineag", "kati", "perri", "ur", "gay", "minimalist", "mourn", "piano", "ballad", "like", "listen", "parti", "prove", "vocal", "talent", "amid", "larger", "inertia", "throw", "cheeki", "extend", "riff", "episod", "offic", "strang", "addictionwhich", "smatter", "clip", "dunder", "mifflin", "crew", "react", "michael", "scott", "contenti", "creativ", "effortsand", "album", "wide", "collagist", "teen", "bedroom", "wall"], "date_published": ["2019-03-29T05:00:00"], "sentiment": 0.13869047619047617, "content": "Billie Eilish has suddenly become an obscenely famous pop star—the kind with 15 million Instagram followers, sold-out shows around the world, a haute modeling contract, and couch time with Ellen DeGeneres. Her brilliance is an obvious truth; just ask any teenager in America as they wait patiently for the rest of the world to catch up to their consummate taste in pop music.\nOf course, the 17-year-old Eilish is still waiting for her teeth to straighten out. This fact trumpets the arrival of her debut album When We All Fall Asleep, Where Do We Go?: For its intro, Eilish removes her much-loathed transparent braces in a series of lightly gross, ASMR-worthy slurps, and proclaims, “I have taken out my Invisalign and this is the album.” She then dissolves into heaving cackles, the kind that alienates any onlookers too prissy to partake. There are several more oddball moments like this—absent-minded humming to a track, giggling asides—that remind us she’s still a precocious, creative teen girl on this rocket, and all her gothic proclivities don’t cancel out how much she’s enjoying the ride.\nHer rise has been striking: At 14, she put the song “Ocean Eyes” on SoundCloud, a glassy, straightforward ballad with tearful synths and woozy, Lana Del Rey-indebted crooning. She snared a young fanbase with her hooks and raised her middle finger to pop’s status quo; here was this music that shifted between genres—from pop to trap and EDM—made by a lawless young female singer sporting baggy, androgynous clothes. She cast her bored, listless eyes upward instead of batting them at the camera. She filled her videos with flowing black tears, plunging needles, and arachnid hors d’oeuvres instead of twirling around sleek cityscapes. Eilish’s creepy eccentricity feels so removed from the pop formula; it helps distance her from the music industry’s historically lewd maceration of teen idols. Eilish just seems sharper, meaner, more self-sufficient—a young star from Los Angeles, in the grand tradition, but one that could only have come along while its hills are burning.\nThe best moments of When We All Fall Asleep play firmly into this formula. Inspired by Eilish’s frequent night terrors and lucid dreams, the album juggles dark compulsions with grim eulogies, balancing her feathery vocals with deep, grisly bass. Like her spirit animal, the spider, Eilish can weave something that is at once delicate and grotesque: In “you should see me in a crown,” she lulls the listener into a false idyll with her murmured lilt, then leaps off the cliff of a tectonic dubstep bass drop, her sneer fully audible. (That the title is cribbed from Moriarty, the beguiling psychopath of television’s “Sherlock,” also speaks to her pull toward the sinister.)\n“xanny” plumbs sincere anxiety over more marrow-shaking bass, the kind that could blast apart a few pairs of headphones. Eilish’s voice crossfades over the narcoleptic beat, and slips into full despair, whimpering her most self-aware lines on the record: “Please don't try to kiss me on the sidewalk/On your cigarette break/I can’t afford to love someone/Who isn't dying by mistake in Silver Lake.” Eilish’s lyrics wonderfully underscore how all teen angst is both fiercely sincere and an affect of being only partially informed.\nA similar spirit drives “bury a friend,” another early single. Despite the vocoder-style distortion, Eilish’s voice feels even more intimate as she hisses, “Step on the glass, staple your tongue” in a farcical singsong. Eilish has namechecked Tyler, the Creator as one of her greatest influences; in her slightly jazzy trill, too, she also nods to her clearest pop progenitor, Lorde, who cleared much of Eilish’s path with her autonomous creative control, heavy-lidded social observations, and blithely goth aura.\nStill, all Eilish’s weaponry can’t stop her most overtly pop track, “bad guy,” from going stale. A snappy pulse launches Eilish into a litany of taunts against her partner. Over the rubbery electro beat, she says she’s the “make-your-girlfriend-mad type/Might-seduce-your-dad type.” It gave me pause because it suggests that perhaps Eilish isn’t so far removed from the teen pop continuum as we’ve come to believe: How different is her bragging about statutory rape, culturally, from trussing up 16-year-old Britney Spears in pigtails and plaid? Even if it’s a teen girl’s decision, entirely, to flaunt her sexuality (or engage in provocative roleplay), the line crosses a boundary plenty of adults were happy to cosign.\nThe quieter moments of When We Fall Asleep nod more to Eilish’s past, and to mixed results. Much like her first EP, 2017’s Don’t Smile at Me, they skew glum instead of macabre, even briefly twee. “wish you were gay” spotlights Eilish’s vocals, which deserved better than being spackled with canned studio laughter and self-involved lyrics in the lamentable lineage of Katy Perry’s “Ur So Gay.” Minimalist, mournful piano ballads like “listen before i go” and “when the party’s over” further prove her vocal talents amid larger inertia. Throw in a cheeky, extended riff on an episode of “The Office” on “my strange addiction”—which smatters in clips of the Dunder Mifflin crew reacting to Michael Scott’s own contentious creative efforts—and you have an album as widely collagist as a teen’s bedroom wall.\n", "pptitle": ["fall", "asleep"]}