{"id": "PF_67", "url": "https://pitchfork.com/reviews/albums/juice-wrld-death-race-for-love/", "name": ["Death", "Race", "for", "Love"], "description": ["speed", "ascent", "felt", "like", "juic", "wrld", "didnt", "just", "appear", "hiphop", "doorstep", "2018", "interscop", "recordssign", "box", "messag", "new", "face", "rap", "use", "20yearold", "illinoi", "rapper", "develop", "style", "2015", "mix", "influenc", "perfect", "recip", "candor", "lil", "peep", "deliveri", "chief", "keef", "cheap", "acoust", "guitar", "xxxtentacion", "recip", "doesnt", "explain", "success", "scroll", "soundcloud", "reveal", "thousand", "artist", "blend", "ingredi", "fraction", "success", "truth", "juic", "wrld", "magnet", "line", "sound", "like", "ipod", "song", "work", "chemic", "romanc", "welcom", "black", "parad", "like", "just", "finish", "spin", "bang", "pt", "2", "death", "race", "love", "72", "minutesther", "reason", "juic", "wrld", "album", "length", "podcast", "halfjuic", "wrld", "lyric", "fall", "categori", "percent", "lyric", "bad", "bullshit", "devil", "emoji", "50", "percent", "bad", "stuck", "head", "ultim", "turn", "good", "tell", "darkest", "secret", "shit", "wouldnt", "tell", "jesu", "album", "open", "juic", "wrld", "use", "drug", "like", "bandaid", "cover", "issu", "problem", "solv", "styrofoam", "imit", "zaytoven", "key", "goto", "produc", "nick", "mira", "blunt", "carri", "piano", "lead", "track", "like", "robberi", "chant", "like", "openm", "slam", "poet", "channel", "john", "cusack", "say", "attempt", "girlfriend", "im", "throw", "rock", "window", "need", "home", "juic", "wrld", "emot", "damn", "time", "sound", "like", "he", "brink", "break", "leanfuel", "tear", "whim", "swerv", "bitter", "like", "futur", "releas", "collabor", "album", "juic", "wrld", "open", "limit", "afraid", "have", "masculin", "questionedto", "point", "song", "liter", "titl", "hemot", "juic", "wrld", "live", "jekyl", "hyde", "experi", "he", "errat", "commit", "feel", "infatu", "overcom", "hatr", "world", "revolv", "love", "suddenli", "doesnt", "death", "race", "love", "featur", "guest", "outofplac", "welcom", "interlud", "rb", "singer", "brent", "faiyaz", "zani", "young", "thug", "hokey", "featur", "clever", "clever", "appar", "just", "elev", "juic", "wrld", "socal", "emorap", "peer", "juic", "wrld", "isnt", "punk", "rock", "artist", "tri", "make", "hiphop", "saw", "dollar", "sign", "he", "rapper", "influenc", "outsid", "genr", "easili", "taken", "music", "poppunk", "lane", "left", "rap", "past", "didnt", "death", "race", "love", "feel", "like", "real", "juic", "wrld", "wear", "influenc", "heart", "sleev", "put", "up", "down", "music", "real", "time"], "date_published": ["2019-03-13T05:00:00"], "sentiment": 0.08121410180233708, "content": "Though the speed of his ascent may have felt like it, Juice WRLD didn’t just appear on hip-hop’s doorstep in 2018 in an Interscope Records-signed box with the message, “Here is the new face of rap, get used to it.” The 20-year-old Illinois rapper has been developing his style since 2015, mixing his influences into the perfect recipe: the candor of Lil Peep, the delivery of Chief Keef, and the cheap acoustic guitars of XXXTentacion. That recipe alone doesn’t explain his success; one scroll through SoundCloud reveals thousands of artists blending those same ingredients with a fraction of the success. The truth is Juice WRLD can be magnetic: One line can sound like he found an iPod where the only song that works is My Chemical Romance’s “Welcome To the Black Parade” and the very next like he just finished spinning Bang Pt. 2.\nThroughout Death Race For Love’s 72 minutes—there’s no reason a Juice WRLD album should be the length of a podcast and a half—Juice WRLD’s lyrics fall into two categories. Fifty percent of the lyrics are bad (“Back on my bullshit, devil emoji”) and the other 50 percent are also bad, but then they get stuck in your head and ultimately turn good (“Tell me your darkest secret shit you wouldn’t even tell Jesus”). On the album opener, “Empty,” Juice WRLD uses drugs like a Band-Aid to cover up his issues (“I problem solve with styrofoam”) over imitation Zaytoven keys from his go-to producer Nick Mira. That same bluntness carries over into other piano lead tracks like “Robbery” where he chants like an open-mic slam poet and channels John Cusack in Say Anything attempting to get his girlfriend back: “I’m throwing rocks at your window, I need to go home.”\nWhenever Juice WRLD is emotional (which is all the damn time) he sounds like he’s on the brink of breaking down into lean-fueled tears, but then on a whim will swerve into bitterness. Like Future, with whom he released a collaborative album, Juice WRLD’s openness has its limits, afraid of having his masculinity questioned—to that point, there is a song here literally titled “HeMotions.”\nJuice WRLD is living the Jekyll and Hyde experience. He’s erratic, never committed to his feelings, and still infatuated even when overcome by hatred, as his world revolves around love, until it suddenly doesn’t.\nDeath Race For Love features three guests: The first is an out-of-place but welcome interlude from R&B singer Brent Faiyaz, another is a zany Young Thug, and the third is a hokey feature from Clever. Next to Clever, it becomes apparent just how elevated Juice WRLD is from his so-called “emo-rap” peers. Juice WRLD isn’t a punk or rock artist trying to make hip-hop once he saw the dollar signs; he’s a rapper with influences outside of the genre. He could have easily taken his music further down the pop-punk lane and left rap in his past. But he didn’t, and it’s why Death Race For Love feels like the real Juice WRLD, wearing his influences and heart on his sleeve, putting his ups and downs into the music in real time.\n", "pptitle": ["death", "race", "love"]}