{"id": "PF_75", "url": "https://pitchfork.com/reviews/albums/helado-negro-this-is-how-you-smile/", "name": ["This", "Is", "How", "You", "Smile"], "description": ["antiguanamerican", "author", "jamaica", "kincaid", "publish", "short", "stori", "girl", "new", "yorker", "1978", "essenti", "long", "runon", "sentenc", "girl", "take", "form", "stern", "mother", "list", "instruct", "daughter", "skill", "selfpossess", "woman", "sweep", "hous", "sweep", "yard", "smile", "dont", "like", "smile", "dont", "like", "litani", "imbu", "intens", "matern", "love", "unspar", "critic", "imbal", "reflect", "colonialist", "structur", "kincaid", "sharpli", "excori", "write", "ive", "come", "ive", "work", "relationship", "mother", "girl", "relationship", "europ", "place", "im", "kincaid", "explain", "mississippi", "review", "1996", "say", "relationship", "power", "powerless", "metaphor", "relationship", "power", "forebear", "powerless", "descend", "color", "smile", "roberto", "carlo", "lang", "sixth", "best", "album", "helado", "negro", "monik", "follow", "2016", "privat", "energi", "album", "wrestl", "violenc", "peopl", "color", "electronicpop", "medit", "ident", "connect", "smile", "take", "kincaid", "weari", "passion", "wander", "sooth", "ambl", "soundscap", "frame", "stroll", "lang", "older", "brother", "sunbak", "street", "south", "florida", "grew", "album", "deepen", "expand", "imagist", "natur", "lang", "lyric", "cosmic", "synthfolk", "use", "sound", "sonor", "hum", "voic", "teas", "complic", "harmoni", "love", "power", "heart", "kincaid", "short", "stori", "sublim", "confess", "fixat", "persever", "embrac", "joy", "laughter", "face", "everyday", "difficulti", "grow", "immigr", "household", "blush", "nowthey", "knowlifelong", "histori", "show", "lang", "sing", "gentli", "chime", "vibraphon", "open", "wont", "brown", "wont", "gobrown", "just", "glow", "song", "pick", "thread", "privat", "energi", "young", "latin", "proud", "brown", "skin", "center", "lang", "experi", "live", "latinx", "person", "plainspoken", "lyric", "support", "encourag", "tender", "intent", "pave", "way", "rest", "smile", "openheart", "solicitud", "synth", "glow", "like", "footlight", "pa", "nublado", "bilingu", "explor", "uncertainti", "persist", "spirit", "laugh", "longersmil", "hardermak", "feelfeel", "stronger", "list", "sooth", "croon", "gray", "overcast", "imageri", "pa", "nublado", "cloudi", "countri", "repres", "precari", "futur", "address", "widespread", "presentday", "fear", "choos", "offer", "blanket", "relief", "resign", "lang", "employ", "stretch", "fuzzi", "cellphon", "record", "ambient", "medit", "temper", "encroach", "anxieti", "fantasma", "vaga", "sink", "comfort", "spectral", "twitchi", "pool", "echo", "synth", "modulacin", "en", "t", "sonrisadesplazamiento", "que", "puedo", "imitar", "modul", "smiledisplac", "imit", "lang", "sing", "placidli", "wateri", "cassett", "synthes", "speak", "experi", "displacementdeport", "gentrif", "themat", "y", "t", "cambia", "todo", "repeat", "song", "end", "music", "clear", "like", "reced", "fog", "highlight", "run", "cloth", "incorpor", "hazi", "recurs", "song", "structur", "pivot", "lang", "chant", "titl", "adept", "suggest", "optimist", "form", "escap", "worri", "distinct", "uplift", "smile", "fine", "drawn", "intimaci", "attribut", "lang", "famili", "sens", "collabor", "crew", "latinx", "artist", "breath", "life", "album", "corner", "member", "loungey", "puerto", "rican", "duo", "buscabulla", "provid", "punk", "group", "downtown", "boy", "appear", "back", "vocal", "xenia", "rubino", "rise", "colombian", "electron", "artist", "ela", "minu", "longtim", "collabor", "sufjan", "steven", "add", "brief", "novemb", "7", "transmut", "sampl", "piano", "sound", "quaver", "peac", "grotto", "wye", "oak", "jenn", "wasner", "thread", "hypnot", "electr", "guitar", "lith", "bound", "seen", "aura", "smile", "sound", "clutter", "overwrought", "appear", "servic", "lang", "cocoon", "vision", "like", "cast", "support", "charact", "flesh", "broader", "theme", "forg", "close", "polit", "social", "tumultu", "time", "list", "howto", "kincaid", "girl", "invok", "mother", "wisdom", "regardless", "flaw", "mistaken", "lang", "take", "role", "parent", "child", "receiv", "instruct", "smile", "relationship", "power", "powerless", "reveal", "gentl", "gener", "refut", "mandat", "weve", "told", "abid", "succeed", "life", "latinx", "peopl", "american", "citizen", "human", "be", "reassur", "listen", "power", "potenti", "exist", "guid", "voic", "time", "slow", "listen"], "date_published": ["2019-03-08T06:00:00"], "sentiment": 0.1271502907866544, "content": "The Antiguan-American author Jamaica Kincaid first published the short story “Girl” in The New Yorker in 1978. In what is essentially one long run-on sentence, “Girl” takes the form of a stern mother’s list of instructions to her daughter on how to become a skilled, self-possessed woman (“this is how you sweep a whole house; this is how you sweep a yard; this is how you smile to someone you don’t like too much; this is how you smile to someone you don’t like at all”). The litany is imbued with both intense maternal love and unsparing criticism, an imbalance that reflects a colonialist structure that Kincaid sharply excoriates in writing. “I’ve come to see that I’ve worked through the relationship of the mother and the girl to a relationship between Europe and the place that I’m from,” Kincaid explained to Mississippi Review in 1996. “Which is to say, a relationship between the powerful and the powerless.”\nThat metaphorical relationship, between a powerful forebear and powerless descendants, colors much of This Is How You Smile, Roberto Carlos Lange’s sixth and best album under his Helado Negro moniker. Following 2016’s Private Energy, an album that wrestled with violence against people of color through electronic-pop meditations on identity and connection, Smile takes Kincaid’s weary passion and wanders through soothing, ambling soundscapes, framed as a stroll with Lange’s older brother down the sun-baked streets of South Florida, where they grew up. The album deepens and expands upon the imagistic nature of Lange’s lyrics and cosmic synth-folk, using found sound and his own sonorous, humming voice to tease out the complicated harmony of love and power at the heart of Kincaid’s short story.\nThese sublime confessions are fixated on perseverance, of embracing joy and laughter while facing the everyday difficulties of growing up in an immigrant household. “Blush now/They can’t know/Lifelong history shows,” Lange sings over gently chiming vibraphone on the opener “Please Won’t Please,” “That brown won’t go/Brown just glows.” The song picks up the thread of Private Energy’s “Young, Latin and Proud” and “It’s My Brown Skin,” centering Lange’s experience of living as a Latinx person with plain-spoken lyrics of support and encouragement. That tender intention paves the way for the rest of This Is How You Smile’s open-hearted solicitude.\nSynths glow like footlights on “País Nublado,” a bilingual exploration of uncertainty and the persistence of spirit: “Laughing longer/Smiling harder/Makes me feel/Feeling stronger,” he lists in a soothing croon. The gray, overcast imagery of a “país nublado” (“cloudy country”) represents a precarious future, addressing a widespread present-day fear and choosing to offer a blanket of relief rather than resignation.\nLange employs stretches of fuzzy cellphone recordings and ambient meditations to temper other encroaching anxieties. “Fantasma Vaga” sinks comfortably into a spectral, twitchy pool of echoed synths. “Modulaciónes en tú sonrisa/Desplazamiento que no puedo imitar (Modulation in your smile/Displacement that I can’t imitate),” Lange sings placidly over watery cassette synthesizers, speaking to several experiences of displacement—deportation and gentrification among them—at once. “Y tú cambias todo,” he repeats at the song’s end, the music clearing around him like a receding fog. Highlight “Running” is of the same cloth, incorporating a hazy, recursive song structure that pivots around Lange’s chanting of the title. He is adept at suggesting an optimistic form of escapism from worry, distinct in its uplift.\nThis Is How You Smile’s finely drawn intimacy can be attributed to Lange’s familial sense of collaboration. A crew of Latinx artists breathes life into the album’s corners: members of the loungey Puerto Rican duo Buscabulla and Providence punk group Downtown Boys appear on backing vocals, as well as Xenia Rubinos and rising Colombian electronic artist Ela Minus. Longtime collaborator Sufjan Stevens adds to the brief “November 7,” transmuting sampled piano into the sounds of a quavering, peaceful grotto, while Wye Oak’s Jenn Wasner threads hypnotic electric guitar through the lithe, bounding “Seen My Aura.” Yet none of This Is How You Smile sounds cluttered or overwrought; each appearance is in service of Lange’s cocooning vision, like a cast of supporting characters fleshing out the broader theme of forging closeness with yourself and others within a politically and socially tumultuous time.\nThe list of how-tos in Kincaid’s “Girl” invokes a mother’s wisdom, regardless of how flawed or mistaken it may be. Lange, however, seems to be taking on the role of both the parent and the child receiving instruction across This Is How You Smile. The relationship between the powerful and the powerless is revealed here in the gentle and generous refutation of mandates we’ve been told to abide by to succeed in life, whether as Latinx people, as American citizens, or as human beings. He reassures listeners that both power and potential exist as guiding voices within each of us, if we take the time to slow down and listen.\n", "pptitle": ["smile"]}