{"id": "PF_103", "url": "https://pitchfork.com/reviews/albums/royal-trux-white-stuff/", "name": ["White", "Stuff"], "description": ["line", "album", "19", "year", "jennif", "herrema", "neil", "hagerti", "reintroduc", "royal", "trux", "joint", "affirm", "way", "suppos", "habitat", "natur", "longtim", "friend", "foil", "titl", "track", "white", "stuff", "cycl", "shapeshift", "riff", "tri", "outfox", "cop", "duo", "sing", "perfect", "disharmoni", "play", "rock", "band", "tour", "nation", "make", "dutyfre", "pit", "stop", "ye", "use", "white", "stuff", "song", "effortlessli", "resitu", "herrema", "hagerti", "element", "autogener", "algorithm", "that", "learn", "royal", "trux", "old", "trick", "herrema", "hagerti", "turbul", "track", "record", "shown", "way", "truli", "appear", "late", "bbc", "dj", "john", "peel", "quip", "favorit", "band", "fall", "differ", "1990", "royal", "trux", "sound", "like", "unravel", "creativ", "romant", "partner", "time", "herrema", "hagerti", "belong", "particular", "citi", "scene", "selfcontain", "upsidedown", "univers", "sleazi", "rock", "render", "avantgard", "vice", "versa", "shortli", "releas", "congeni", "convent", "album", "2000", "pound", "pound", "partnership", "collaps", "spur", "toughlov", "intervent", "relaps", "herrema", "given", "messi", "natur", "breakup", "royal", "trux", "reunion", "white", "stuff", "surpris", "end", "predict", "dysfunct", "winter", "north", "american", "tour", "reportedli", "cancel", "account", "herrema", "prior", "reschedul", "spring", "recent", "mojo", "interview", "seri", "cryptic", "tweet", "hagerti", "suggest", "linger", "discord", "tenuou", "truce", "long", "yield", "white", "stuff", "brief", "reconcili", "vain", "royal", "trux", "90", "catalog", "embrac", "outsiz", "mytholog", "sinist", "allur", "classic", "rock", "indi", "peer", "sought", "dismantl", "reemerg", "white", "stuff", "moment", "guitarbas", "rock", "push", "margin", "mainstream", "underground", "alik", "lament", "state", "affair", "royal", "trux", "revel", "white", "stuff", "herrema", "hagerti", "treat", "hallow", "build", "block", "classic", "rockchunki", "riff", "rippin", "guitar", "solo", "cowbellclankin", "grooveslik", "discard", "part", "salvag", "landfil", "upcycl", "1979", "fairground", "fantasia", "dream", "place", "score", "royal", "truxbrand", "coke", "mirror", "cover", "win", "carniv", "game", "atop", "arpeggioslath", "chug", "year", "dog", "ask", "hear", "rocknrol", "year", "dog", "assum", "answer", "duo", "devious", "trigger", "trusti", "phase", "effect", "send", "song", "careen", "like", "tiltawhirl", "bust", "control", "forsak", "earthier", "vibe", "later", "trux", "record", "like", "veteran", "disord", "pound", "pound", "white", "stuff", "feel", "like", "extens", "herrema", "work", "black", "banana", "thrive", "tension", "oldschool", "authent", "modernist", "manipul", "track", "like", "purpl", "audac", "2", "ice", "start", "decept", "anthem", "singalong", "swagger", "groov", "lyserg", "riff", "synth", "smear", "eventu", "meld", "hallucinatori", "swirl", "sic", "em", "slow", "tough", "boogi", "birth", "flurri", "tropic", "electron", "kool", "keith", "turn", "rap", "pizza", "boombox", "electro", "jam", "use", "great", "judgment", "night", "deep", "cut", "herrema", "hagerti", "wrote", "song", "email", "file", "swap", "hagerti", "reportedli", "bail", "record", "session", "album", "complet", "duo", "pissandvinegar", "vocal", "dynam", "feel", "brokenin", "old", "basebal", "mitt", "past", "herrema", "hagerti", "took", "solo", "lead", "turn", "there", "rare", "moment", "voic", "arent", "overlap", "ravag", "tandem", "surprisingli", "poignant", "suburban", "junki", "ladi", "slowmot", "psychfunk", "reveri", "empath", "homeless", "woman", "truck", "life", "belong", "shop", "cart", "passersbi", "blith", "toss", "food", "car", "herrema", "fashion", "stylist", "design", "la", "hagerti", "denverbas", "dadthi", "song", "serv", "bloodpact", "remind", "hardscrabbl", "past", "royal", "trux", "sound", "pure", "fulli", "realiz", "practic", "fine", "art", "fall", "apart", "white", "stuff", "disori", "track", "purpl", "audac", "1", "herrema", "hagerti", "sing", "compet", "melodi", "wage", "custodi", "battl", "track", "progregga", "rhythm", "aton", "guitar", "solo", "blare", "continu", "like", "broken", "televis", "room", "hagerti", "twist", "nonsens", "mantrasouthern", "california", "driver", "19th", "wonder", "worldinto", "catchi", "hook", "admir", "imit", "royal", "trux", "amass", "absentia", "make", "music", "like", "that", "way", "suppos"], "date_published": ["2019-03-04T06:00:00"], "sentiment": 0.07794418842805939, "content": "On the first line of their first album together in 19 years, Jennifer Herrema and Neil Hagerty reintroduce Royal Trux with a joint affirmation: “This is the way it’s supposed to be.” You will find no habitat more natural for these longtime friends and foils than the title track of White Stuff. Cycling through shape-shifting riffs as if trying to outfox the cops, the duo sings in perfect disharmony about playing in a rock band, touring the nation, making duty-free pit stops, and, yes, using that white stuff. The song so effortlessly resituates Herrema and Hagerty in their element, it seems auto-generated by an algorithm that’s learned all Royal Trux’s old tricks. But as Herrema and Hagerty’s turbulent track record has shown, nothing here is ever the way it truly appears.\nLate BBC DJ John Peel quipped that his favorite band, the Fall, were “always different, always the same.” Throughout the 1990s, Royal Trux sounded like they were always together but always unraveling, too. Creative and romantic partners at the time, Herrema and Hagerty belonged to no particular city or scene beyond their own self-contained upside-down universe, where sleazy rock was rendered avant-garde and vice versa. Shortly after releasing their most congenial, conventional album, 2000’s Pound for Pound, the partnership collapsed, spurred in part by tough-love interventions for a relapsing Herrema.\nGiven the messy nature of their breakup, Royal Trux’s reunion for White Stuff has been surprising and, in the end, predictably dysfunctional. A winter North American tour was reportedly canceled on account of Herrema’s priors (but rescheduled for the spring, it seems), while a recent MOJO interview and a series of cryptic Tweets from Hagerty suggest a lingering discord. But if the tenuous truce should only last long enough to yield White Stuff, the brief reconciliation was not in vain.\nRoyal Trux’s ’90s catalog embraced the outsized mythology and sinister allure of classic rock when their indie peers sought to dismantle it; they reemerge on White Stuff at a moment when guitar-based rock has been pushed to the margins in the mainstream and underground alike. Rather than lament this state of affairs, Royal Trux again revel in it. Throughout White Stuff, Herrema and Hagerty treat the hallowed building blocks of classic rock—chunky riffs, rippin’ guitar solos, cowbell-clankin’ grooves—like discarded parts salvaged from the landfill. They upcycle them into the 1979 fairground fantasia of their dreams, a place where you might score the Royal Trux-branded coke mirror on the cover by winning a carnival game. Atop the arpeggio-slathered chug of “Year of the Dog,” they ask, “Can you hear rock’n’roll, in the year of the dog?” Assuming the answer is no, the duo deviously triggers their trusty phasing effects and sends the song careening like a Tilt-a-Whirl with busted controls.\nForsaking the earthier vibe of later Trux records like Veterans of Disorder and Pound for Pound, White Stuff feels like an extension of Herrema’s work with Black Bananas, thriving on the tension between old-school authenticity and modernist manipulations. Tracks like “Purple Audacity #2” and “Under Ice” start out as deceptively anthemic sing-alongs, though the swaggering grooves, lysergic riffs, and synth smears eventually meld into hallucinatory swirls. “Sic Em Slow” is a tough boogie birthed from a flurry of tropical electronics. Kool Keith, meanwhile, turns up to rap about pizza on the boombox electro jam “Get Used to This,” the great Judgment Night deep cut that never was.\nHerrema and Hagerty wrote these songs via emailed file swaps, and Hagerty reportedly bailed on recording sessions before the album was completed. Still, the duo’s piss-and-vinegar vocal dynamic feels as broken-in as an old baseball mitt. In the past, Herrema and Hagerty often took solo lead turns; here, there’s rarely a moment when their voices aren’t overlapping. The ravaged tandem can be surprisingly poignant, too. “Suburban Junkie Lady” is a slow-motion psych-funk reverie about empathizing with a homeless woman trucking her life’s belongings in a shopping cart, as passersby blithely toss her food from their cars. Herrema’s a fashion stylist and designer in L.A. now, Hagerty a Denver-based dad—this song, though, serves as a blood-pact reminder of their hardscrabble past.\nBut Royal Trux never sound more pure and fully realized than when practicing the fine art of falling apart. On White Stuff’s most disorienting track, “Purple Audacity #1,” Herrema and Hagerty sing competing melodies as if waging a custody battle over the track’s prog-reggae rhythm. An atonal guitar solo blares continuously, like a broken television in the next room. Hagerty somehow twists a nonsensical mantra—“Southern California drivers are the 19th wonder of the world!”—into a catchy hook. For all the admirers and imitators Royal Trux have amassed in absentia, no one else can make music like this. That’s the way it’s supposed to be.\n", "pptitle": ["white", "stuff"]}