{"id": "RS_71", "url": "https://www.rollingstone.com/music/music-album-reviews/review-metallicas-breakthrough-lp-and-justice-for-all-gets-a-revealing-deep-reissue-753250/", "name": ["Review:", "Metallica’s", "‘…", "And", "Justice", "for", "All’", "Super", "Deluxe", "Box", "Set", "–", "Rolling", "Stone"], "description": ["metallica", "forc", "reckon", "justic", "fourth", "album", "death", "bassist", "cliff", "burton", "previou", "lp", "theyd", "laid", "groundwork", "thrash", "metal", "introduc", "melodi", "catchi", "genr", "built", "follow", "relentless", "tour", "album", "1986", "master", "puppet", "apotheosi", "form", "underground", "year", "justic", "releas", "year", "later", "usher", "new", "mainstream", "era", "band", "dens", "complex", "mad", "world", "justic", "contain", "statement", "aggress", "reson", "fan", "heavi", "music", "en", "mass", "track", "address", "polit", "oppress", "corrupt", "eye", "behold", "titl", "cut", "feel", "betray", "famili", "dyer", "eve", "cope", "murder", "insan", "incred", "heavi", "harvest", "sorrow", "cours", "concept", "just", "utterli", "mess", "render", "mute", "quadripleg", "war", "stark", "opposit", "preen", "spandexwear", "hair", "farmer", "domin", "rock", "time", "song", "shorter", "minut", "music", "video", "time", "best", "way", "notic", "metallica", "abl", "play", "arena", "record", "gone", "doubleplatinum", "year", "justic", "releas", "certifi", "eighttim", "platinum", "lavish", "new", "delux", "box", "set", "reissu", "offer", "360degre", "look", "record", "huge", "newli", "remast", "origin", "album", "sound", "crisp", "forc", "power", "album", "way", "drum", "rhythm", "guitar", "punch", "face", "band", "gone", "great", "length", "document", "make", "tour", "follow", "remast", "version", "b", "side", "live", "record", "demo", "interview", "hardcov", "book", "includ", "video", "incred", "perform", "1989", "grammi", "year", "lost", "best", "hard", "rock", "award", "jethro", "tull", "curiou", "record", "jame", "hetfield", "riff", "tape", "trace", "song", "riff", "snippet", "tune", "bandmat", "write", "hear", "sort", "tricki", "time", "chang", "titl", "track", "find", "right", "swing", "main", "riff", "shortest", "straw", "hear", "mess", "hetfield", "shout", "hi", "dick", "tape", "record", "work", "lar", "ulrich", "goe", "left", "downsid", "hetfield", "scratch", "vocal", "wahnanana", "interest", "hear", "tri", "differ", "sing", "style", "song", "riff", "tape", "version", "dyer", "eve", "hetfield", "cut", "song", "direct", "parent", "sound", "bit", "like", "kurt", "cobain", "croon", "ballad", "crunchi", "guitar", "drum", "machin", "provid", "new", "perspect", "song", "record", "hetfield", "ulrich", "write", "session", "provid", "insight", "metal", "lennon", "mccartney", "work", "song", "time", "hear", "lose", "place", "work", "earli", "version", "eye", "behold", "disc", "rough", "mix", "song", "featur", "differ", "take", "kirk", "hammett", "guitar", "solo", "differ", "version", "band", "vocal", "harmoni", "disc", "closest", "diehard", "fan", "hear", "bass", "mix", "album", "infam", "nix", "new", "member", "jason", "newst", "contribut", "origin", "mix", "confirm", "band", "member", "said", "newst", "mimick", "hetfield", "rhythm", "guitar", "truth", "told", "good", "didnt", "mix", "bass", "main", "record", "newst", "play", "radic", "chang", "sound", "nowclass", "record", "want", "hollow", "thump", "bang", "eardrum", "live", "record", "video", "variou", "qualiti", "come", "set", "quickli", "metallica", "grew", "arena", "band", "spring", "1988", "justic", "came", "troubadour", "captur", "loos", "club", "gig", "weve", "la", "do", "shit", "call", "new", "album", "hetfield", "say", "brazenli", "point", "includ", "time", "play", "harvest", "sorrow", "live", "despit", "inconsist", "show", "band", "vision", "place", "theyv", "work", "kink", "time", "play", "song", "london", "hammersmith", "odeon", "month", "later", "cours", "there", "1989", "seattl", "concert", "featur", "vinyl", "previous", "came", "video", "band", "live", "shit", "bing", "purg", "set", "earli", "nineti", "feel", "electr", "perform", "thank", "new", "mix", "make", "sound", "liveli", "set", "dvd", "captur", "great", "1989", "show", "grandios", "band", "damag", "justic", "tour", "complet", "replica", "ladi", "justic", "explod", "toppl", "justic", "fun", "band", "member", "danzig", "misfit", "tshirt", "rage", "catalogu", "come", "instrument", "break", "embrac", "burgeon", "statu", "biggest", "metal", "band", "time", "hetfield", "guitar", "eet", "fuk", "scrawl", "interview", "time", "altern", "humbl", "cocki", "figur", "definit", "thing", "video", "good", "hetfield", "say", "proudli", "clip", "just", "hey", "rock", "chick", "walk", "book", "contain", "tribut", "peopl", "work", "band", "studio", "tour", "revel", "fact", "metallica", "pick", "justic", "mix", "engin", "like", "work", "madonna", "sammi", "hagar", "member", "van", "halen", "invit", "metallica", "monster", "rock", "tour", "predict", "success", "come", "page", "photo", "band", "time", "record", "log", "album", "bass", "read", "note", "b", "princ", "finish", "set", "art", "print", "pushead", "reproduct", "handwritten", "lyric", "song", "gnarlylook", "patch", "battl", "jacket", "backstag", "lamin", "call", "capn", "krunch", "art", "look", "like", "cereal", "box", "delux", "edit", "overwhelm", "portrait", "pivot", "moment", "live", "metallica", "metal", "genr", "band", "justic", "templat", "streamlin", "megastar", "just", "year", "best", "box", "reissu", "that", "heavi", "music", "insid"], "date_published": ["2018-11-12T15:18:14+00:00"], "sentiment": 0.14399906971335547, "content": "Metallica became a force to be reckoned with on … And Justice for All, their fourth album and first after the death of bassist Cliff Burton. On their three previous LPs, they'd laid the groundwork for thrash metal, introduced melody and catchiness to the genre and built a following through relentless touring. If their third album, 1986's Master of Puppets, was the apotheosis of their formative, underground years, then Justice, released two years later, ushered in a new, mainstream era for the band.\r\n\r\nDense, complex and mad at the world – Justice contained nine statements of aggression that resonated with fans of heavy music en masse. The tracks addressed political oppression and corruption (\"Eye of the Beholder,\" the title cut), feeling betrayed by your family (\"Dyers Eve\"), coping with murderous insanity (the incredibly heavy \"Harvester of Sorrow\") and, of course, the concept of just how utterly messed up it would be to rendered a mute quadriplegic by war (\"One\"). It was the stark opposite of the preened, spandex-wearing hair farmers that dominated rock at the time. Even though no song was shorter than five minutes and they made only one music video at a time when that was the best way to get noticed, Metallica were able to play arenas and the record had gone double-platinum within a year of Justice's release; it's since been certified eight-times platinum.\r\n\r\nA lavish, new deluxe box set reissue offers a 360-degree look at why the record was so huge. The newly remastered original album sounds crisp and forceful – the power of the album has always been the way the drums and rhythm guitar punches you in the face – and the band has gone to great lengths to document both its making and the tours that followed it with remastered versions of the B sides, live recordings, demos, interviews and a hardcover book. They even included video of their incredible performance of \"One\" at the 1989 Grammys – the year they lost the Best Hard Rock award to Jethro Tull.\r\n\r\nThe most curious recordings here are James Hetfield's riff tapes, which trace the songs' riffs and snippets of tunes as he and his bandmates were writing them. You can hear them sort out the tricky time changes on the title track, finding the right amount of swing for the main riff in \"The Shortest Straw,\" and you can hear them messing around, such as when Hetfield shouts, \"Hi, dick,\" into his tape recorder before working out \"One\" and Lars Ulrich goes, \"You left that on?\" The downside of some of this are some of Hetfield's scratch vocals, which often go \"wah-na-na-na,\" though it's interesting to hear him try out a few different singing styles on some of the songs. During one \"riff tape\" version of \"Dyers Eve\" – one of Hetfield's most cutting songs, directed at his parents – he sounds a bit like Kurt Cobain crooning a ballad over crunchy guitars and drum machine; it provides a whole new perspective on the song.\r\n\r\nThere are also recordings of Hetfield and Ulrich's writing sessions, providing some insight into how metal's Lennon and McCartney worked out the songs at the time (you can hear them lose their places as they work through an early version of \"Eye of Beholder\"). And there is a disc of rough mixes of the songs, which feature a few different takes on Kirk Hammett's guitar solos and some different versions of the band's vocal harmonies. That disc is also the closest that diehard fans will get to hearing a \"bass mix\" of the album, since they infamously all but nixed new member Jason Newsted's contributions from the original mix. It confirms what the band members have always said: Newsted mostly mimicked Hetfield's rhythm guitar. (And truth be told, it's good they didn't mix up the bass on the main recording, not because of Newsted's playing but because it would radically change the sound of a now-classic record – you want that hollow thump banging at your eardrums.)\r\n\r\nThe live recordings and videos of various quality that come with the set also show how quickly Metallica grew up as they became an arena band. A spring 1988 show, before Justice came out, at the Troubadour captures a loose club gig (\"So we've been down here in L.A. doing this shit called a new album,\" Hetfield says brazenly at one point) that includes the first time they ever played \"Harvester of Sorrow\" live and, despite a few inconsistencies, it shows the band had its vision in place. They've worked out the kinks by the time they played the same song at London's Hammersmith Odeon a few months later. And then of course there's the 1989 Seattle concert, featured here on vinyl, which previously came out as a video in the band's Live Shit: Binge & Purge set in the early Nineties; you can feel how electric the performance was thanks to a new mix that makes it sound livelier.\r\n\r\nThe set's DVDs capture some great 1989 shows where you can see the grandiosity of the band's Damaged Justice tour, complete with a replica of Lady Justice that explodes and topples over during \"… And Justice for All.\" But it's also fun to see the band members, in their Danzig and Misfits T-shirts, raging through their catalogue, coming together for instrumental breaks and embracing their burgeoning status as the biggest metal band of all time (even if Hetfield's guitar still had \"Eet fuk\" scrawled on it). And in the interviews from the time, they alternate between being humble and cocky, as they figure out who they are. \"I definitely thing [the 'One' video] is a good one to show what we're all about,\" Hetfield says proudly in one clip. \"It's not just, 'Hey, rock!' and chicks walking.\"\r\n\r\nThe book contains tributes from many of the people who worked with the band in the studio and on tour, as well as a few revelations, such as the fact that Metallica picked Justice's mixing engineers because they liked their work with Madonna or that Sammy Hagar was the member of Van Halen who invited Metallica on the Monsters of Rock tour and predicted their success to come. There are also pages of photos of the band at the time and their recording logs for the album (\"more bass\" reads a note next to the B side \"The Prince\"). They finished the set off with an art print by Pushead, reproductions of handwritten lyrics for each song, gnarly-looking patches for your battle jacket and a backstage laminate calling them the \"Cap'ns of Krunch\" with art that looks like the cereal box.\r\n\r\nThe deluxe edition is an overwhelming portrait of one of the most pivotal moments in the lives of Metallica but also the metal genre as a whole, because the band would take the Justice template and streamline it to become megastars within just a few years. Best of all, with so much in the box, it's a reissue that's as heavy as the music inside.", "pptitle": ["review", "metallica", "justic", "super", "delux", "box", "set", "roll", "stone"]}