{"id": "RS_59", "url": "https://www.rollingstone.com/music/music-album-reviews/vox-lux-soundtrack-review-sia-natalie-portman-771088/", "name": ["‘Vox", "Lux’", "Soundtrack", "Review:", "Natalie", "Portman", "Sings", "Sia", "Songs", "–", "Rolling", "Stone"], "description": ["pop", "particular", "plight", "femal", "pop", "star", "proven", "prime", "fodder", "oscarbait", "featur", "film", "award", "season", "star", "born", "told", "music", "love", "stori", "set", "music", "written", "star", "ladi", "gaga", "soon", "teen", "spirit", "ell", "fan", "star", "intern", "sing", "competit", "perform", "preexist", "hit", "robyn", "ariana", "grand", "vox", "lux", "ambiti", "polar", "stori", "told", "part", "accent", "extrem", "violenc", "half", "film", "introduc", "celest", "raffey", "cassidi", "godlov", "teenag", "world", "shatter", "shoot", "school", "write", "song", "recov", "gun", "shot", "wound", "perform", "memori", "servic", "unexpect", "hit", "mourn", "nation", "she", "thrust", "world", "bud", "pop", "stardom", "travers", "globe", "sister", "manag", "second", "half", "stori", "jump", "ahead", "nearli", "20", "year", "older", "celest", "natali", "portman", "cynic", "pop", "demigod", "depend", "chemic", "fame", "day", "hometown", "gunmen", "european", "beach", "wear", "mask", "inspir", "look", "debut", "music", "video", "she", "left", "answer", "question", "ahead", "perform", "failur", "achiev", "bradi", "corbet", "second", "film", "accent", "halv", "music", "dark", "ambianc", "scott", "walker", "score", "sia", "glitter", "origin", "song", "pop", "star", "celest", "build", "career", "journey", "tackl", "film", "soundtrack", "sia", "song", "work", "backward", "theyr", "present", "film", "celest", "invinc", "megalomaniac", "pop", "figur", "believ", "she", "bigger", "jesu", "beatl", "wrap", "incarn", "especi", "perform", "portman", "album", "movi", "highlight", "siapen", "song", "heard", "film", "raffey", "cassidi", "perform", "keyboardassist", "ballad", "memori", "held", "slain", "teacher", "classmat", "song", "mourn", "hope", "believ", "narr", "type", "song", "immedi", "captur", "heart", "nation", "make", "star", "singer", "songwrit", "sia", "felt", "heard", "portman", "version", "stadiumworthi", "tackl", "swim", "synth", "excess", "hear", "young", "celest", "career", "shift", "real", "hardtobeliev", "time", "film", "follow", "emot", "reson", "wrap", "empowerpop", "followup", "aliv", "inexplic", "quit", "suddenli", "thrust", "hypersexu", "latenineti", "teen", "idol", "territori", "bodi", "talk", "hologram", "lusti", "brilliant", "pop", "tune", "believ", "hit", "current", "time", "era", "theyr", "place", "natali", "portmansung", "celest", "track", "kick", "soundtrack", "come", "time", "film", "final", "highstak", "hometown", "concert", "hear", "glitz", "live", "offer", "appreci", "sia", "hook", "write", "littl", "theyr", "lifeless", "nearli", "big", "movi", "demand", "feel", "hollaback", "girlbit", "sweat", "tear", "cloy", "privat", "girl", "muddl", "metaphor", "ekg", "border", "parodi", "simplic", "bare", "scratch", "surfac", "sia", "abl", "pop", "writer", "eras", "film", "pop", "pessim", "juxtaposit", "song", "moment", "intens", "tragedi", "violenc", "reinforc", "messag", "pop", "music", "meaningless", "distract", "pain", "instead", "poignant", "reflect", "heal", "balm", "walker", "score", "compel", "time", "omin", "laid", "sceneri", "wind", "road", "sure", "meant", "reflect", "inner", "dark", "celest", "world", "grow", "doe", "mimic", "fail", "pop", "song", "film"], "date_published": ["2018-12-20T14:20:55+00:00"], "sentiment": 0.12346763085399448, "content": "Pop, and the particular plight of a female pop star, has proven itself to be prime fodder for Oscar-bait feature films this awards season. First, A Star Is Born told a musical love story, set to music written by its star Lady Gaga. Soon, we'll have Teen Spirit, where Elle Fanning will become the star of an international singing competition, performing preexisting hits by Robyn and Ariana Grande.\r\n\r\nBut now we have Vox Lux, an ambitious and polarizing story told in two parts and accented by extreme violence. The first half of the film introduces Celeste (Raffey Cassidy), a God-loving teenager whose world is shattered by a shooting at her school. She writes a song while recovering from a gun shot wound and performs it at a memorial service. When it becomes an unexpected hit for a mourning nation, she's thrust into the world of budding pop stardom, traversing the globe with her sister and manager.\r\n\r\nThe second half of the story jumps ahead nearly 20 years, with the older Celeste (Natalie Portman), now a more cynical pop demigod, dependent on both chemicals and fame. On the day of a hometown show, gunmen at a European beach wear masks inspired by the look from her debut music video, and she's left to answer questions ahead of her performance.\r\n\r\nFor both the failures and achievements of Brady Corbet's second film, it's accented by two halves of a musical whole: the dark ambiance of Scott Walker's score and Sia's glittering original songs for pop star Celeste, which build through her career journey. The first to tackle on the film's soundtrack are Sia's songs, which work backwards from how they're presented in the film. This is Celeste at her most invincible: a megalomaniac pop figure who believes she's bigger than both Jesus and the Beatles.\r\n\r\n\"Wrapped Up\" — in both its incarnations, but especially as performed by Portman — is the album and the movie's highlight. It's the first of the Sia-penned songs to be heard in the film, when Raffey Cassidy performs it as a keyboard-assisted ballad at the memorial held for her slain teachers and classmates. It's a song of mourning and hope, believable to the narrative not only as the type of song that would immediately capture the heart of the nation but also make a star of its singer and songwriter. Sia is felt and heard in Portman's version: It becomes stadium-worthy when she tackles it, swimming in synths and excess.\r\n\r\nWe hear young Celeste's career shift in real, but hard-to-believe, time in the film: Following the emotional resonance of \"Wrapped Up\" and its empower-pop follow-up \"Alive,\" she is inexplicably and quite suddenly thrusted into hyper-sexualized, late-Nineties teen idol territory. \"Your Body Talk\" and \"Hologram\" are lusty but brilliant pop tunes, believable hits for our current time more than for the era in which they're placed.\r\n\r\nThe Natalie Portman-sung Celeste tracks that kick off the soundtrack all come at the same time during the film: the final, high-stakes, hometown concert. Hearing them without the glitz of the live show offers appreciation for Sia's hook writing but little else. They're almost lifeless, not nearly as big as the movie demands you to feel they are. The \"Hollaback Girl\"-biting \"Sweat and Tears,\" cloying \"Private Girl\" and muddled metaphors of \"Ekg\" border on parody. The simplicity barely scratches the surface of what Sia is able to do as a pop writer and even seems to get erased by the film's own pop pessimism. The juxtaposition of such empty songs between moments of intense tragedy and violence reinforces a message that pop music is nothing more than meaningless distraction from pain — instead of as a poignant reflection or healing balm.\r\n\r\nWalker's score is compelling but at times almost too ominous as it's laid over scenery and winding roads. Sure, it was meant to reflect both the inner darkness of Celeste and the world around her as she grows up, but it does nothing more than mimic the failings of what the pop songs in the film could and should have done on their own.", "pptitle": ["vox", "lux", "soundtrack", "review", "natali", "portman", "sing", "sia", "song", "roll", "stone"]}