{"id": "RS_39", "url": "https://www.rollingstone.com/music/music-album-reviews/ariana-grande-thank-u-next-album-review-793887/", "name": ["Review:", "Ariana", "Grande", "Moves", "on", "in", "Spectacular", "Style", "on", "‘Thank", "U,", "Next’", "–", "Rolling", "Stone"], "description": ["ariana", "grand", "woman", "word", "drop", "new", "album", "just", "month", "oneand", "thank", "u", "turn", "best", "album", "sweeten", "potenti", "hit", "oldschool", "model", "milk", "coupl", "year", "tour", "death", "start", "cycl", "instead", "grand", "went", "studio", "energi", "rage", "bang", "album", "week", "amnesiac", "sweeten", "kid", "theme", "basic", "break", "music", "industri", "im", "bore", "sweeten", "ambiti", "artist", "craft", "selfconsci", "widescal", "pop", "statement", "thank", "u", "just", "woman", "mood", "take", "mood", "drive", "pedaltothemet", "right", "cliff", "gloriou", "pop", "rush", "isth", "album", "version", "emerg", "breakup", "karaok", "session", "therapeut", "hour", "mari", "j", "blige", "toni", "braxton", "song", "late", "ive", "roller", "coastertri", "hold", "emot", "ariana", "confess", "needi", "late", "mean", "tast", "oxygen", "hold", "emot", "mean", "turn", "emot", "spectacular", "largerthanlif", "mess", "she", "ringer", "past", "yearsth", "manchest", "bomb", "mac", "miller", "death", "whirlwind", "engag", "turn", "messi", "public", "split", "thank", "u", "respons", "reflect", "new", "determin", "fast", "spontan", "dream", "obvious", "rapper", "like", "music", "way", "rapper", "doe", "told", "billboard", "decemb", "just", "like", "bruh", "just", "want", "fuck", "talk", "fan", "sing", "write", "music", "drop", "way", "boy", "surpris", "world", "thank", "u", "fall", "expect", "quicki", "celebrityshad", "novelti", "turn", "ballad", "astonish", "grace", "resonanceand", "album", "level", "she", "go", "offthedom", "energi", "hiphop", "mixtap", "guest", "star", "duet", "work", "trust", "collabor", "like", "max", "martin", "tommi", "brown", "victoria", "monet", "tayla", "parx", "pop", "wansel", "sing", "ghostin", "surprisingli", "candid", "ballad", "death", "grief", "recoveri", "im", "girl", "lot", "baggag", "strang", "listen", "danger", "woman", "just", "year", "ago", "ariana", "sang", "need", "dude", "make", "feel", "danger", "pictur", "day", "gonethi", "ariana", "need", "danger", "lesson", "like", "need", "extra", "ponytail", "like", "sing", "excel", "makeup", "let", "stay", "bag", "caus", "like", "madit", "mood", "vibe", "look", "match", "7", "ring", "bite", "sound", "music", "cooler", "time", "gwen", "stefani", "did", "lone", "goatherdari", "fuse", "trap", "maria", "von", "trapp", "alp", "atl", "realli", "song", "expens", "jewelri", "bubbl", "heart", "song", "treat", "friend", "like", "superstar", "notic", "version", "cher", "mom", "rich", "man", "speech", "nasa", "excel", "spaceodd", "ballad", "emot", "solar", "way", "orbit", "chang", "time", "fake", "smile", "sampl", "wendi", "rene", "dusti", "soul", "groov", "laughter", "hiphop", "touchston", "wutang", "clan", "break", "girlfriend", "im", "bore", "perfect", "song", "titl", "tradit", "britney", "nake", "got", "plan", "max", "martin", "clever", "interpol", "nsync", "deep", "cut", "make", "ill", "perfect", "way", "end", "albumaft", "cri", "tear", "scream", "scream", "feel", "feel", "ari", "flirt", "bartend", "way", "readi", "punish", "year", "best", "pop", "album", "far", "2019", "that", "turn", "great", "new", "music", "thank", "u", "make", "suspect", "best", "ariana", "come"], "date_published": ["2019-02-12T20:35:56+00:00"], "sentiment": 0.11998531230674087, "content": "Ariana Grande is a woman of her word, dropping her new album just six months after her last one—and Thank U, Next turns out to be her best album yet. Sweetener was full of potential hits; the old-school model would have been to milk it for a couple of years, tour it to death, then start the cycle all over again. Instead, Grande went back in the studio while her energy was raging and banged out another album in two weeks. This is her Amnesiac to Sweetener’s Kid A. The theme is basically, “Break up with your music industry, I’m bored.”\r\n\r\nSweetener was an ambitious artist crafting a self-consciously wide-scale pop statement. Thank U, Next is just a woman and a mood, taking that mood out for a drive until she pedal-to-the-metals it right off a cliff. What a glorious pop rush it is—the album version of one of those emergency break-up karaoke sessions with a few therapeutic hours of Mary J. Blige and Toni Braxton songs.\r\n\r\n“Lately I’ve been on a roller coaster/Trying to get hold of my emotions,” Ariana confesses in “Needy.” By “lately,” she seems to mean since she first tasted oxygen, and by “get hold of my emotions” she means turning her emotions into a spectacular, larger-than-life mess. She’s been through the ringer in the past two years—the Manchester bombing, Mac Miller’s death, a whirlwind engagement that turned into a messy public split. Thank U, Next is her response, reflecting her new determination to move fast and keep it spontaneous. “My dream has always been to be . . . obviously not a rapper, but, like, to put out music in the way that a rapper does,” she told Billboard in December. “It’s just like, ‘Bruh, I just want to fucking talk to my fans and sing and write music and drop it the way these boys do.’”\r\n\r\nWhen she surprised the world with “Thank U, Next” last fall, no one was expecting more than a quickie celebrity-shade novelty, yet it turned out to be a ballad with astonishing grace and resonance—and the whole album is up to that level. She’s going for the off-the-dome energy of a hip-hop mixtape: no guest stars, no duets. She works with her most trusted collaborators, like Max Martin, Tommy Brown, Victoria Monet, Tayla Parx and Pop Wansel. As she sings in “Ghostin’,” her surprisingly candid ballad about death, grief and recovery, “I’m a girl with a whole lot of baggage.”\r\n\r\nIt’s strange to go back and listen to “Dangerous Woman” from just three years ago, back when Ariana sang about needing a dude to make her feel dangerous. Picture that. Well, those days are gone—this Ariana needs danger lessons like she needs an extra ponytail. Like she sings in the excellent “Makeup,” “Let me stay in my bag, ‘cause I like when you mad/It’s a mood, it’s a vibe, it’s a look, it’s a match.”\r\n\r\n“7 Rings” bites The Sound of Music, but it’s much cooler than that time Gwen Stefani did “The Lonely Goatherd”—Ari fuses trap and Maria Von Trapp, from the Alps to the ATL. Yet it’s not really a song about expensive jewelry and bubbly. At heart, it’s a song about treating yourself and your friends like superstars even if nobody else notices. It’s her version of Cher's “But mom, I am a rich man” speech. “NASA” is her excellent space-oddity ballad about her emotional solar system and the way her orbit changes over time; “Fake Smile” samples the Wendy Rene dusty soul groove “After Laughter,” a hip-hop touchstone via the Wu-Tang Clan.\r\n\r\n“Break Up With Your Girlfriend, I’m Bored” is a perfect song title in the tradition of Britney’s “Get Naked (I Got a Plan),” with Max Martin and a clever interpolation of the 'NSync deep cut “It Makes Me Ill.” It’s the perfect way to end this album—after crying her tears and screaming her screams and feeling her feels, Ari flirts with the bartender on her way out, ready for more punishment. This is one of the year’s best pop albums so far, even in a 2019 that’s already turning out to be a great one for new music. Thank U, Next makes you suspect that the best Ariana is yet to come.", "pptitle": ["review", "ariana", "grand", "move", "spectacular", "style", "thank", "u", "roll", "stone"]}