{"id": "UN_39", "url": "https://www.uncut.co.uk/news/lambchop-guess-im-going-create-map-109346", "name": ["Lambchop:", "\"I", "guess", "I’m", "going", "to", "create", "my", "own", "map\"", "-", "Uncut"], "description": ["current", "issu", "uncut", "shop", "avail", "buy", "onlin", "click", "kurt", "wagner", "talk", "lambchop", "gradual", "streamlin", "11piec", "altcountri", "band", "intim", "dreami", "electronica", "new", "album", "want", "tell", "youth", "way", "creat", "coupl", "record", "differ", "way", "start", "make", "record", "just", "get", "play", "basement", "eventu", "record", "say", "wagner", "uncut", "stephen", "deusner", "song", "final", "got", "studio", "reverseengin", "subscrib", "uncut", "save", "50", "here", "howwhil", "want", "tell", "radic", "differ", "band", "earliest", "releas", "play", "like", "lambchop", "record", "remark", "sound", "simultan", "say", "ira", "kaplan", "yo", "la", "tengo", "impress", "heard", "theyv", "chang", "lot", "year", "struck", "time", "peopl", "play", "quietli", "lambchop", "creat", "cacophoni", "sweet", "cacophonywagn", "settl", "grace", "beatif", "day", "job", "artist", "chuckl", "describ", "typic", "hous", "husband", "tri", "normal", "work", "hour", "tri", "clock", "cook", "dinner", "wife", "housework", "love", "life", "way", "im", "tri", "way", "make", "thing", "coexist", "that", "goal", "begin", "just", "normal", "dude", "seduc", "thing", "make", "notbett", "personwhat", "wagner", "doesnt", "want", "indierock", "curmudgeon", "grumbl", "good", "old", "day", "shout", "kid", "lawn", "find", "inspir", "like", "reassur", "new", "gener", "musician", "move", "nashvil", "imagin", "tri", "start", "environ", "peopl", "everyday", "excit", "imagin", "young", "right", "live", "nashvil", "start", "theyr", "work", "job", "play", "music", "incred", "merec", "wagner", "wife", "friend", "invest", "club", "downtown", "theyr", "turn", "allag", "venu", "im", "just", "landlord", "say", "mayb", "itll", "hous", "who", "weird", "old", "dude", "club", "thatll", "word", "know", "involv", "remov", "allow", "younger", "gener", "devis", "scene", "play", "show", "form", "band", "im", "complet", "realist", "dont", "grant", "tomorrow", "far", "ill", "make", "stuff", "anybodi", "hear", "dont", "know", "way", "sustain", "myselfwhen", "he", "club", "hell", "home", "dream", "lambchop", "album", "hope", "end", "old", "guy", "offic", "put", "record", "im", "just", "old", "mayb", "genr", "someday", "call", "old", "fuck", "do", "thing", "dont", "know", "there", "roadmap", "elder", "statesmen", "guess", "im", "just", "go", "creat", "map", "allow", "thing", "love", "avoid", "thing", "dontyou", "read", "lambchop", "current", "issu", "uncut", "shop", "leonard", "cohen", "coversubscrib", "uncut", "make", "huge", "save", "cover", "price", "click", "like", "facebook", "follow", "twitter", "date", "latest", "news", "uncutth", "march", "2019", "issu", "uncut", "sale", "uk", "leonard", "cohen", "cover", "insid", "youll", "david", "bowi", "bob", "marley", "yardbird", "lambchop", "jessica", "pratt", "crass", "neu", "sean", "ono", "lennon", "15track", "cd", "showcas", "best", "month", "new", "music", "includ", "cass", "mccomb", "sleaford", "mod", "julia", "jacklin", "royal", "truxuncut", "past", "present", "futur", "great", "music"], "date_published": ["2019-02-15T15:03:46+00:00", "2019-02-15T15:03:46+00:00"], "sentiment": 0.1431054239877769, "content": "In the current issue of Uncut – in shops now and available to buy online by clicking here – Kurt Wagner talks about Lambchop’s gradual streamlining from an 11-piece alt.country band to the intimate, dreamy electronica of new album This (Is What I Wanted To Tell You).“The way we created the last couple of records is different from the way we started making records, which was just getting together and playing around in the basement and then eventually recording it,” says Wagner to Uncut’s Stephen Deusner. “The songs were already there when we finally got to the studio. Now it’s about reverse-engineering it.” SUBSCRIBE TO UNCUT AND SAVE 50% – HERE’S HOW!While This (Is What I Wanted To Tell You) may seem radically different from \u2028the band’s earliest releases, it still plays like a Lambchop record. “It’s remarkable how it sounds simultaneously them and not them,” says Ira Kaplan of Yo La Tengo. “It’s the same impression \u2028I had of them when I first heard them. They’ve changed a lot over the years, but what struck me that first time was how so many people could play so quietly together. Lambchop create a cacophony, but it’s such a sweet cacophony.”Wagner has settled gracefully, even beatifically into his day job as an artist, and he chuckles when he describes himself as “your typical house husband. \u2028I try to do what I can during normal working hours, but I try to clock out at five. Cook dinner for my wife. Do some housework. I love my life the way it is, but I’m always trying to find ways to make these things coexist. That’s been my goal from the beginning: to just be a normal dude and do this without being seduced by things that make me a not-better person.”What Wagner doesn’t want is to become the indie-rock curmudgeon, grumbling about the good old days while shouting at the kids to get off his lawn. Rather, he finds inspiration and something like reassurance in the new generation of musicians moving to Nashville. “I can’t imagine trying to start out in this environment, but people do it everyday. It’s exciting to see them do it. But I can’t imagine being young right now. To live in Nashville and be starting out – they’re working three jobs and playing music, and it’s incredible to me.”Recently, Wagner and his wife, along with a few friends, invested \u2028in a club downtown, which they’re turning into an all-ages venue. “I’m just one of the landlords,” he says. “Maybe it’ll get me out of the house more. Who’s that weird old dude in the back of the club? That’ll be me.” In other words, he knows he can be involved but only at a remove that allows a younger generation to devise their own scene, to play their own shows, to form their own bands. “I’m completely realistic about it. I don’t take for granted that there will be a tomorrow as far as what I do. I’ll always make stuff, whether or not anybody will hear it or not, but \u2028I don’t know if it will be a way of sustaining myself.”When he’s not at the club, he’ll be at home, dreaming up the next Lambchop album and the next one after that. “This is hopefully where I end up, this old guy in an office putting out a record every now and then. I’m just too old to do anything else. Maybe there will be a genre someday called Old Fucks Who Keep Doing Their Thing. I don’t know if there’s a roadmap for us elder statesmen, so I guess I’m just going to create my own map that allows me to do the things I love and avoid the things I don’t.”You can read much more about Lambchop in the current issue of Uncut, in shops now with Leonard Cohen on the cover.Subscribe to Uncut and make huge savings on the cover price – find out by clicking here! Like us on Facebook or follow us on Twitter to keep up to date with the latest news from Uncut.The March 2019 issue of Uncut is now on sale in the UK – with Leonard Cohen on the cover. Inside, you’ll find David Bowie, Bob Marley, The Yardbirds, Lambchop, Jessica Pratt, Crass, Neu!, Sean Ono Lennon and much more. Our 15-track CD also showcases the best of the month’s new music, including Cass McCombs, Sleaford Mods, Julia Jacklin and Royal Trux.Uncut: the past, present and future of great music.", "pptitle": ["lambchop", "guess", "im", "go", "creat", "map", "uncut"]}